Core dump limits :
	soft - 0
	hard - NONE
Checking that ptrace can change system call numbers...OK
Checking syscall emulation for ptrace...OK
Checking environment variables for a tempdir...none found
Checking if /dev/shm is on tmpfs...OK
Checking PROT_EXEC mmap in /dev/shm...OK
Adding 23912448 bytes to physical memory to account for exec-shield gap
Linux version 6.12.20 (ubuntu@82045ecf2438) (gcc (Ubuntu 11.4.0-1ubuntu1~22.04.3) 11.4.0, GNU ld (GNU Binutils for Ubuntu) 2.38) #6 Wed Mar 18 12:13:06 EDT 2026
Zone ranges:
  Normal   [mem 0x0000000000000000-0x00000000e16cdfff]
Movable zone start for each node
Early memory node ranges
  node   0: [mem 0x0000000000000000-0x00000000816cdfff]
Initmem setup node 0 [mem 0x0000000000000000-0x00000000816cdfff]
random: crng init done
Kernel command line: rootfstype=hostfs rootflags=/home/ubuntu/uml-rootfs rw init=/init mem=2G root=98:0 console=tty0
Unknown kernel command line parameters "mem=2G", will be passed to user space.
Dentry cache hash table entries: 262144 (order: 9, 2097152 bytes, linear)
Inode-cache hash table entries: 131072 (order: 8, 1048576 bytes, linear)
Sorting __ex_table...
Built 1 zonelists, mobility grouping on.  Total pages: 530126
mem auto-init: stack:off, heap alloc:off, heap free:off
SLUB: HWalign=64, Order=0-3, MinObjects=0, CPUs=1, Nodes=1
RCU Tasks Trace: Setting shift to 0 and lim to 1 rcu_task_cb_adjust=1 rcu_task_cpu_ids=1.
NR_IRQS: 64

libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: held lock and object are not in the same allocation
bpf_spin_lock at off=0 must be held for bpf_list_head
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/75  linked_list/inner_map_map_incorrect_lock_pop_front:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'inner_map_inner_map_incorrect_lock_pop_front': BPF program load failed: unknown error (-524)
libbpf: prog 'inner_map_inner_map_incorrect_lock_pop_front': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: held lock and object are not in the same allocation
bpf_spin_lock at off=0 must be held for bpf_list_head
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/76  linked_list/inner_map_inner_map_incorrect_lock_pop_front:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'inner_map_kptr_incorrect_lock_pop_back': BPF program load failed: unknown error (-524)
libbpf: prog 'inner_map_kptr_incorrect_lock_pop_back': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: held lock and object are not in the same allocation
bpf_spin_lock at off=40 must be held for bpf_list_head
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/77  linked_list/inner_map_kptr_incorrect_lock_pop_back:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'inner_map_global_incorrect_lock_pop_back': BPF program load failed: unknown error (-524)
libbpf: prog 'inner_map_global_incorrect_lock_pop_back': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: held lock and object are not in the same allocation
bpf_spin_lock at off=16 must be held for bpf_list_head
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/78  linked_list/inner_map_global_incorrect_lock_pop_back:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'inner_map_map_incorrect_lock_pop_back': BPF program load failed: unknown error (-524)
libbpf: prog 'inner_map_map_incorrect_lock_pop_back': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: held lock and object are not in the same allocation
bpf_spin_lock at off=0 must be held for bpf_list_head
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/79  linked_list/inner_map_map_incorrect_lock_pop_back:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'inner_map_inner_map_incorrect_lock_pop_back': BPF program load failed: unknown error (-524)
libbpf: prog 'inner_map_inner_map_incorrect_lock_pop_back': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: held lock and object are not in the same allocation
bpf_spin_lock at off=0 must be held for bpf_list_head
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/80  linked_list/inner_map_inner_map_incorrect_lock_pop_back:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'map_compat_kprobe': BPF program load failed: Invalid argument
libbpf: prog 'map_compat_kprobe': failed to load: -22
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -22
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -22
Expected: tracing progs cannot use bpf_{list_head,rb_root} yet
Verifier: magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 3520
str_off: 3520
str_len: 7267
btf_total_size: 10811
[1] PTR (anon) type_id=3
[2] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[3] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=2
[4] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
[5] PTR (anon) type_id=2
[6] PTR (anon) type_id=7
[7] STRUCT map_value size=24 vlen=3
	lock type_id=8 bits_offset=0
	data type_id=2 bits_offset=32
	head type_id=11 bits_offset=64
[8] STRUCT bpf_spin_lock size=4 vlen=1
	val type_id=9 bits_offset=0
[9] TYPEDEF __u32 type_id=10
[10] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
[11] STRUCT bpf_list_head size=16 vlen=1
	__opaque type_id=14 bits_offset=0
[12] TYPEDEF __u64 type_id=13
[13] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
[14] ARRAY (anon) type_id=12 index_type_id=4 nr_elems=2
[15] DECL_TAG contains:foo:node2 type=7 component_idx=2
[16] PTR (anon) type_id=17
[17] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=1
[18] STRUCT array_map size=32 vlen=4
	type type_id=1 bits_offset=0
	key type_id=5 bits_offset=64
	value type_id=6 bits_offset=128
	max_entries type_id=16 bits_offset=192
[19] VAR inner_map type_id=18 linkage=1
[20] PTR (anon) type_id=21
[21] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=12
[22] PTR (anon) type_id=18
[23] ARRAY (anon) type_id=22 index_type_id=4 nr_elems=0
[24] STRUCT (anon) size=32 vlen=5
	type type_id=20 bits_offset=0
	max_entries type_id=16 bits_offset=64
	key type_id=5 bits_offset=128
	value type_id=5 bits_offset=192
	values type_id=23 bits_offset=256
[25] VAR map_of_maps type_id=24 linkage=1
[26] VAR array_map type_id=18 linkage=1
[27] PTR (anon) type_id=0
[28] FUNC_PROTO (anon) return=2 args=(27 ctx)
[29] FUNC kptr_missing_lock_pop_front type_id=28
[30] STRUCT foo size=72 vlen=5
	node type_id=31 bits_offset=0
	head type_id=11 bits_offset=192
	lock type_id=8 bits_offset=320
	data type_id=2 bits_offset=352
	node2 type_id=31 bits_offset=384
[31] STRUCT bpf_list_node size=24 vlen=1
	__opaque type_id=32 bits_offset=0
[32] ARRAY (anon) type_id=12 index_type_id=4 nr_elems=3
[33] DECL_TAG contains:bar:node type=30 component_idx=1
[34] FUNC_PROTO (anon) return=27 args=(12 dummy_ksym, 27 dummy_ksym)
[35] FUNC bpf_obj_new_impl type_id=34
[36] FUNC_PROTO (anon) return=0 args=(27 dummy_ksym, 27 dummy_ksym)
[37] FUNC bpf_obj_drop_impl type_id=36
[38] STRUCT bar size=32 vlen=2
	node type_id=31 bits_offset=0
	data type_id=2 bits_offset=192
[39] FUNC_PROTO (anon) return=40 args=(41 dummy_ksym)
[40] PTR (anon) type_id=31
[41] PTR (anon) type_id=11
[42] FUNC bpf_list_pop_front type_id=39
[43] FUNC kptr_missing_lock_pop_back type_id=28
[44] FUNC bpf_list_pop_back type_id=39
[45] FUNC global_missing_lock_pop_front type_id=28
[46] FUNC global_missing_lock_pop_back type_id=28
[47] FUNC map_missing_lock_pop_front type_id=28
[48] FUNC map_missing_lock_pop_back type_id=28
[49] FUNC inner_map_missing_lock_pop_front type_id=28
[50] FUNC inner_map_missing_lock_pop_back type_id=28
[51] FUNC kptr_missing_lock_push_front type_id=28
[52] FUNC_PROTO (anon) return=2 args=(41 dummy_ksym, 40 dummy_ksym, 27 dummy_ksym, 12 dummy_ksym)
[53] FUNC bpf_list_push_front_impl type_id=52
[54] FUNC kptr_missing_lock_push_back type_id=28
[55] FUNC bpf_list_push_back_impl type_id=52
[56] FUNC global_missing_lock_push_front type_id=28
[57] FUNC global_missing_lock_push_back type_id=28
[58] FUNC map_missing_lock_push_front type_id=28
[59] FUNC map_missing_lock_push_back type_id=28
[60] FUNC inner_map_missing_lock_push_front type_id=28
[61] FUNC inner_map_missing_lock_push_back type_id=28
[62] FUNC kptr_kptr_incorrect_lock_pop_front type_id=28
[63] FUNC kptr_global_incorrect_lock_pop_front type_id=28
[64] FUNC kptr_map_incorrect_lock_pop_front type_id=28
[65] FUNC kptr_inner_map_incorrect_lock_pop_front type_id=28
[66] FUNC global_global_incorrect_lock_pop_front type_id=28
[67] FUNC global_kptr_incorrect_lock_pop_front type_id=28
[68] FUNC global_map_incorrect_lock_pop_front type_id=28
[69] FUNC global_inner_map_incorrect_lock_pop_front type_id=28
[70] FUNC map_map_incorrect_lock_pop_front type_id=28
[71] FUNC map_kptr_incorrect_lock_pop_front type_id=28
[72] FUNC map_global_incorrect_lock_pop_front type_id=28
[73] FUNC map_inner_map_incorrect_lock_pop_front type_id=28
[74] FUNC inner_map_inner_map_incorrect_lock_pop_front type_id=28
[75] FUNC inner_map_kptr_incorrect_lock_pop_front type_id=28
[76] FUNC inner_map_global_incorrect_lock_pop_front type_id=28
[77] FUNC inner_map_map_incorrect_lock_pop_front type_id=28
[78] FUNC kptr_kptr_incorrect_lock_pop_back type_id=28
[79] FUNC kptr_global_incorrect_lock_pop_back type_id=28
[80] FUNC kptr_map_incorrect_lock_pop_back type_id=28
[81] FUNC kptr_inner_map_incorrect_lock_pop_back type_id=28
[82] FUNC global_global_incorrect_lock_pop_back type_id=28
[83] FUNC global_kptr_incorrect_lock_pop_back type_id=28
[84] FUNC global_map_incorrect_lock_pop_back type_id=28
[85] FUNC global_inner_map_incorrect_lock_pop_back type_id=28
[86] FUNC map_map_incorrect_lock_pop_back type_id=28
[87] FUNC map_kptr_incorrect_lock_pop_back type_id=28
[88] FUNC map_global_incorrect_lock_pop_back type_id=28
[89] FUNC map_inner_map_incorrect_lock_pop_back type_id=28
[90] FUNC inner_map_inner_map_incorrect_lock_pop_back type_id=28
[91] FUNC inner_map_kptr_incorrect_lock_pop_back type_id=28
[92] FUNC inner_map_global_incorrect_lock_pop_back type_id=28
[93] FUNC inner_map_map_incorrect_lock_pop_back type_id=28
[94] FUNC kptr_kptr_incorrect_lock_push_front type_id=28
[95] FUNC kptr_global_incorrect_lock_push_front type_id=28
[96] FUNC kptr_map_incorrect_lock_push_front type_id=28
[97] FUNC kptr_inner_map_incorrect_lock_push_front type_id=28
[98] FUNC global_global_incorrect_lock_push_front type_id=28
[99] FUNC global_kptr_incorrect_lock_push_front type_id=28
[100] FUNC global_map_incorrect_lock_push_front type_id=28
[101] FUNC global_inner_map_incorrect_lock_push_front type_id=28
[102] FUNC map_map_incorrect_lock_push_front type_id=28
[103] FUNC map_kptr_incorrect_lock_push_front type_id=28
[104] FUNC map_global_incorrect_lock_push_front type_id=28
[105] FUNC map_inner_map_incorrect_lock_push_front type_id=28
[106] FUNC inner_map_inner_map_incorrect_lock_push_front type_id=28
[107] FUNC inner_map_kptr_incorrect_lock_push_front type_id=28
[108] FUNC inner_map_global_incorrect_lock_push_front type_id=28
[109] FUNC inner_map_map_incorrect_lock_push_front type_id=28
[110] FUNC kptr_kptr_incorrect_lock_push_back type_id=28
[111] FUNC kptr_global_incorrect_lock_push_back type_id=28
[112] FUNC kptr_map_incorrect_lock_push_back type_id=28
[113] FUNC kptr_inner_map_incorrect_lock_push_back type_id=28
[114] FUNC global_global_incorrect_lock_push_back type_id=28
[115] FUNC global_kptr_incorrect_lock_push_back type_id=28
[116] FUNC global_map_incorrect_lock_push_back type_id=28
[117] FUNC global_inner_map_incorrect_lock_push_back type_id=28
[118] FUNC map_map_incorrect_lock_push_back type_id=28
[119] FUNC map_kptr_incorrect_lock_push_back type_id=28
[120] FUNC map_global_incorrect_lock_push_back type_id=28
[121] FUNC map_inner_map_incorrect_lock_push_back type_id=28
[122] FUNC inner_map_inner_map_incorrect_lock_push_back type_id=28
[123] FUNC inner_map_kptr_incorrect_lock_push_back type_id=28
[124] FUNC inner_map_global_incorrect_lock_push_back type_id=28
[125] FUNC inner_map_map_incorrect_lock_push_back type_id=28
[126] FUNC map_compat_kprobe type_id=28
[127] FUNC map_compat_kretprobe type_id=28
[128] FUNC map_compat_tp type_id=28
[129] FUNC map_compat_perf type_id=28
[130] FUNC map_compat_raw_tp type_id=28
[131] FUNC map_compat_raw_tp_w type_id=28
[132] FUNC obj_type_id_oor type_id=28
[133] FUNC obj_new_no_composite type_id=28
[134] FUNC obj_new_no_struct type_id=28
[135] UNION (anon) size=4 vlen=2
	data type_id=2 bits_offset=0
	udata type_id=10 bits_offset=0
[136] FUNC obj_drop_non_zero_off type_id=28
[137] FUNC new_null_ret type_id=28
[138] FUNC obj_new_acq type_id=28
[139] FUNC use_after_drop type_id=28
[140] FUNC ptr_walk_scalar type_id=28
[141] STRUCT test1 size=8 vlen=1
	ptr type_id=142 bits_offset=0
[142] PTR (anon) type_id=187
[143] FUNC direct_read_lock type_id=28
[144] FUNC direct_write_lock type_id=28
[145] FUNC direct_read_head type_id=28
[146] FUNC direct_write_head type_id=28
[147] FUNC direct_read_node type_id=28
[148] FUNC direct_write_node type_id=28
[149] FUNC use_after_unlock_push_front type_id=28
[150] FUNC use_after_unlock_push_back type_id=28
[151] FUNC double_push_front type_id=28
[152] FUNC double_push_back type_id=28
[153] FUNC no_node_value_type type_id=28
[154] STRUCT (anon) size=4 vlen=1
	data type_id=2 bits_offset=0
[155] FUNC incorrect_value_type type_id=28
[156] PTR (anon) type_id=157
[157] STRUCT __sk_buff size=192 vlen=34
	len type_id=9 bits_offset=0
	pkt_type type_id=9 bits_offset=32
	mark type_id=9 bits_offset=64
	queue_mapping type_id=9 bits_offset=96
	protocol type_id=9 bits_offset=128
	vlan_present type_id=9 bits_offset=160
	vlan_tci type_id=9 bits_offset=192
	vlan_proto type_id=9 bits_offset=224
	priority type_id=9 bits_offset=256
	ingress_ifindex type_id=9 bits_offset=288
	ifindex type_id=9 bits_offset=320
	tc_index type_id=9 bits_offset=352
	cb type_id=158 bits_offset=384
	hash type_id=9 bits_offset=544
	tc_classid type_id=9 bits_offset=576
	data type_id=9 bits_offset=608
	data_end type_id=9 bits_offset=640
	napi_id type_id=9 bits_offset=672
	family type_id=9 bits_offset=704
	remote_ip4 type_id=9 bits_offset=736
	local_ip4 type_id=9 bits_offset=768
	remote_ip6 type_id=159 bits_offset=800
	local_ip6 type_id=159 bits_offset=928
	remote_port type_id=9 bits_offset=1056
	local_port type_id=9 bits_offset=1088
	data_meta type_id=9 bits_offset=1120
	(anon) type_id=160 bits_offset=1152
	tstamp type_id=12 bits_offset=1216
	wire_len type_id=9 bits_offset=1280
	gso_segs type_id=9 bits_offset=1312
	(anon) type_id=162 bits_offset=1344
	gso_size type_id=9 bits_offset=1408
	tstamp_type type_id=164 bits_offset=1440
	hwtstamp type_id=12 bits_offset=1472
[158] ARRAY (anon) type_id=9 index_type_id=4 nr_elems=5
[159] ARRAY (anon) type_id=9 index_type_id=4 nr_elems=4
[160] UNION (anon) size=8 vlen=1
	flow_keys type_id=161 bits_offset=0
[161] PTR (anon) type_id=186
[162] UNION (anon) size=8 vlen=1
	sk type_id=163 bits_offset=0
[163] PTR (anon) type_id=188
[164] TYPEDEF __u8 type_id=165
[165] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
[166] FUNC_PROTO (anon) return=2 args=(156 ctx)
[167] FUNC incorrect_node_var_off type_id=166
[168] FUNC incorrect_node_off1 type_id=28
[169] FUNC incorrect_node_off2 type_id=28
[170] FUNC no_head_type type_id=28
[171] FUNC incorrect_head_var_off1 type_id=166
[172] FUNC incorrect_head_var_off2 type_id=166
[173] FUNC incorrect_head_off1 type_id=28
[174] FUNC incorrect_head_off2 type_id=28
[175] FUNC pop_front_off type_id=28
[176] STRUCT (anon) size=24 vlen=2
	head type_id=11 bits_offset=0
	lock type_id=8 bits_offset=128
[177] DECL_TAG contains:foo:node2 type=176 component_idx=0
[178] FUNC pop_back_off type_id=28
[179] VAR ghead type_id=11 linkage=0
[180] DECL_TAG contains:foo:node2 type=179 component_idx=-1
[181] VAR glock2 type_id=8 linkage=0
[182] VAR glock type_id=8 linkage=0
[183] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
[184] ARRAY (anon) type_id=183 index_type_id=4 nr_elems=4
[185] VAR _license type_id=184 linkage=1
[186] FWD bpf_flow_keys struct
[187] FWD test2 struct
[188] FWD bpf_sock struct
[189] DATASEC .maps size=104 vlen=3
	 type_id=19 offset=0 size=32
	 type_id=25 offset=32 size=40
	 type_id=26 offset=72 size=32
[190] DATASEC .bss.A size=20 vlen=2
	 type_id=179 offset=0 size=16
	 type_id=182 offset=16 size=4
[191] DATASEC .bss.B size=4 vlen=1
	 type_id=181 offset=0 size=4
[192] DATASEC license size=4 vlen=1
	 type_id=185 offset=0 size=4
[193] DATASEC .ksyms size=24 vlen=6
	 type_id=194 offset=0 size=4
	 type_id=194 offset=4 size=4
	 type_id=194 offset=8 size=4
	 type_id=194 offset=12 size=4
	 type_id=194 offset=16 size=4
	 type_id=194 offset=20 size=4
[194] VAR dummy_ksym type_id=2 linkage=1

#134/81  linked_list/map_compat_kprobe:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'map_compat_kretprobe': BPF program load failed: Invalid argument
libbpf: prog 'map_compat_kretprobe': failed to load: -22
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -22
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -22
Expected: tracing progs cannot use bpf_{list_head,rb_root} yet
Verifier: magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 3520
str_off: 3520
str_len: 7267
btf_total_size: 10811
[1] PTR (anon) type_id=3
[2] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[3] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=2
[4] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
[5] PTR (anon) type_id=2
[6] PTR (anon) type_id=7
[7] STRUCT map_value size=24 vlen=3
	lock type_id=8 bits_offset=0
	data type_id=2 bits_offset=32
	head type_id=11 bits_offset=64
[8] STRUCT bpf_spin_lock size=4 vlen=1
	val type_id=9 bits_offset=0
[9] TYPEDEF __u32 type_id=10
[10] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
[11] STRUCT bpf_list_head size=16 vlen=1
	__opaque type_id=14 bits_offset=0
[12] TYPEDEF __u64 type_id=13
[13] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
[14] ARRAY (anon) type_id=12 index_type_id=4 nr_elems=2
[15] DECL_TAG contains:foo:node2 type=7 component_idx=2
[16] PTR (anon) type_id=17
[17] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=1
[18] STRUCT array_map size=32 vlen=4
	type type_id=1 bits_offset=0
	key type_id=5 bits_offset=64
	value type_id=6 bits_offset=128
	max_entries type_id=16 bits_offset=192
[19] VAR inner_map type_id=18 linkage=1
[20] PTR (anon) type_id=21
[21] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=12
[22] PTR (anon) type_id=18
[23] ARRAY (anon) type_id=22 index_type_id=4 nr_elems=0
[24] STRUCT (anon) size=32 vlen=5
	type type_id=20 bits_offset=0
	max_entries type_id=16 bits_offset=64
	key type_id=5 bits_offset=128
	value type_id=5 bits_offset=192
	values type_id=23 bits_offset=256
[25] VAR map_of_maps type_id=24 linkage=1
[26] VAR array_map type_id=18 linkage=1
[27] PTR (anon) type_id=0
[28] FUNC_PROTO (anon) return=2 args=(27 ctx)
[29] FUNC kptr_missing_lock_pop_front type_id=28
[30] STRUCT foo size=72 vlen=5
	node type_id=31 bits_offset=0
	head type_id=11 bits_offset=192
	lock type_id=8 bits_offset=320
	data type_id=2 bits_offset=352
	node2 type_id=31 bits_offset=384
[31] STRUCT bpf_list_node size=24 vlen=1
	__opaque type_id=32 bits_offset=0
[32] ARRAY (anon) type_id=12 index_type_id=4 nr_elems=3
[33] DECL_TAG contains:bar:node type=30 component_idx=1
[34] FUNC_PROTO (anon) return=27 args=(12 dummy_ksym, 27 dummy_ksym)
[35] FUNC bpf_obj_new_impl type_id=34
[36] FUNC_PROTO (anon) return=0 args=(27 dummy_ksym, 27 dummy_ksym)
[37] FUNC bpf_obj_drop_impl type_id=36
[38] STRUCT bar size=32 vlen=2
	node type_id=31 bits_offset=0
	data type_id=2 bits_offset=192
[39] FUNC_PROTO (anon) return=40 args=(41 dummy_ksym)
[40] PTR (anon) type_id=31
[41] PTR (anon) type_id=11
[42] FUNC bpf_list_pop_front type_id=39
[43] FUNC kptr_missing_lock_pop_back type_id=28
[44] FUNC bpf_list_pop_back type_id=39
[45] FUNC global_missing_lock_pop_front type_id=28
[46] FUNC global_missing_lock_pop_back type_id=28
[47] FUNC map_missing_lock_pop_front type_id=28
[48] FUNC map_missing_lock_pop_back type_id=28
[49] FUNC inner_map_missing_lock_pop_front type_id=28
[50] FUNC inner_map_missing_lock_pop_back type_id=28
[51] FUNC kptr_missing_lock_push_front type_id=28
[52] FUNC_PROTO (anon) return=2 args=(41 dummy_ksym, 40 dummy_ksym, 27 dummy_ksym, 12 dummy_ksym)
[53] FUNC bpf_list_push_front_impl type_id=52
[54] FUNC kptr_missing_lock_push_back type_id=28
[55] FUNC bpf_list_push_back_impl type_id=52
[56] FUNC global_missing_lock_push_front type_id=28
[57] FUNC global_missing_lock_push_back type_id=28
[58] FUNC map_missing_lock_push_front type_id=28
[59] FUNC map_missing_lock_push_back type_id=28
[60] FUNC inner_map_missing_lock_push_front type_id=28
[61] FUNC inner_map_missing_lock_push_back type_id=28
[62] FUNC kptr_kptr_incorrect_lock_pop_front type_id=28
[63] FUNC kptr_global_incorrect_lock_pop_front type_id=28
[64] FUNC kptr_map_incorrect_lock_pop_front type_id=28
[65] FUNC kptr_inner_map_incorrect_lock_pop_front type_id=28
[66] FUNC global_global_incorrect_lock_pop_front type_id=28
[67] FUNC global_kptr_incorrect_lock_pop_front type_id=28
[68] FUNC global_map_incorrect_lock_pop_front type_id=28
[69] FUNC global_inner_map_incorrect_lock_pop_front type_id=28
[70] FUNC map_map_incorrect_lock_pop_front type_id=28
[71] FUNC map_kptr_incorrect_lock_pop_front type_id=28
[72] FUNC map_global_incorrect_lock_pop_front type_id=28
[73] FUNC map_inner_map_incorrect_lock_pop_front type_id=28
[74] FUNC inner_map_inner_map_incorrect_lock_pop_front type_id=28
[75] FUNC inner_map_kptr_incorrect_lock_pop_front type_id=28
[76] FUNC inner_map_global_incorrect_lock_pop_front type_id=28
[77] FUNC inner_map_map_incorrect_lock_pop_front type_id=28
[78] FUNC kptr_kptr_incorrect_lock_pop_back type_id=28
[79] FUNC kptr_global_incorrect_lock_pop_back type_id=28
[80] FUNC kptr_map_incorrect_lock_pop_back type_id=28
[81] FUNC kptr_inner_map_incorrect_lock_pop_back type_id=28
[82] FUNC global_global_incorrect_lock_pop_back type_id=28
[83] FUNC global_kptr_incorrect_lock_pop_back type_id=28
[84] FUNC global_map_incorrect_lock_pop_back type_id=28
[85] FUNC global_inner_map_incorrect_lock_pop_back type_id=28
[86] FUNC map_map_incorrect_lock_pop_back type_id=28
[87] FUNC map_kptr_incorrect_lock_pop_back type_id=28
[88] FUNC map_global_incorrect_lock_pop_back type_id=28
[89] FUNC map_inner_map_incorrect_lock_pop_back type_id=28
[90] FUNC inner_map_inner_map_incorrect_lock_pop_back type_id=28
[91] FUNC inner_map_kptr_incorrect_lock_pop_back type_id=28
[92] FUNC inner_map_global_incorrect_lock_pop_back type_id=28
[93] FUNC inner_map_map_incorrect_lock_pop_back type_id=28
[94] FUNC kptr_kptr_incorrect_lock_push_front type_id=28
[95] FUNC kptr_global_incorrect_lock_push_front type_id=28
[96] FUNC kptr_map_incorrect_lock_push_front type_id=28
[97] FUNC kptr_inner_map_incorrect_lock_push_front type_id=28
[98] FUNC global_global_incorrect_lock_push_front type_id=28
[99] FUNC global_kptr_incorrect_lock_push_front type_id=28
[100] FUNC global_map_incorrect_lock_push_front type_id=28
[101] FUNC global_inner_map_incorrect_lock_push_front type_id=28
[102] FUNC map_map_incorrect_lock_push_front type_id=28
[103] FUNC map_kptr_incorrect_lock_push_front type_id=28
[104] FUNC map_global_incorrect_lock_push_front type_id=28
[105] FUNC map_inner_map_incorrect_lock_push_front type_id=28
[106] FUNC inner_map_inner_map_incorrect_lock_push_front type_id=28
[107] FUNC inner_map_kptr_incorrect_lock_push_front type_id=28
[108] FUNC inner_map_global_incorrect_lock_push_front type_id=28
[109] FUNC inner_map_map_incorrect_lock_push_front type_id=28
[110] FUNC kptr_kptr_incorrect_lock_push_back type_id=28
[111] FUNC kptr_global_incorrect_lock_push_back type_id=28
[112] FUNC kptr_map_incorrect_lock_push_back type_id=28
[113] FUNC kptr_inner_map_incorrect_lock_push_back type_id=28
[114] FUNC global_global_incorrect_lock_push_back type_id=28
[115] FUNC global_kptr_incorrect_lock_push_back type_id=28
[116] FUNC global_map_incorrect_lock_push_back type_id=28
[117] FUNC global_inner_map_incorrect_lock_push_back type_id=28
[118] FUNC map_map_incorrect_lock_push_back type_id=28
[119] FUNC map_kptr_incorrect_lock_push_back type_id=28
[120] FUNC map_global_incorrect_lock_push_back type_id=28
[121] FUNC map_inner_map_incorrect_lock_push_back type_id=28
[122] FUNC inner_map_inner_map_incorrect_lock_push_back type_id=28
[123] FUNC inner_map_kptr_incorrect_lock_push_back type_id=28
[124] FUNC inner_map_global_incorrect_lock_push_back type_id=28
[125] FUNC inner_map_map_incorrect_lock_push_back type_id=28
[126] FUNC map_compat_kprobe type_id=28
[127] FUNC map_compat_kretprobe type_id=28
[128] FUNC map_compat_tp type_id=28
[129] FUNC map_compat_perf type_id=28
[130] FUNC map_compat_raw_tp type_id=28
[131] FUNC map_compat_raw_tp_w type_id=28
[132] FUNC obj_type_id_oor type_id=28
[133] FUNC obj_new_no_composite type_id=28
[134] FUNC obj_new_no_struct type_id=28
[135] UNION (anon) size=4 vlen=2
	data type_id=2 bits_offset=0
	udata type_id=10 bits_offset=0
[136] FUNC obj_drop_non_zero_off type_id=28
[137] FUNC new_null_ret type_id=28
[138] FUNC obj_new_acq type_id=28
[139] FUNC use_after_drop type_id=28
[140] FUNC ptr_walk_scalar type_id=28
[141] STRUCT test1 size=8 vlen=1
	ptr type_id=142 bits_offset=0
[142] PTR (anon) type_id=187
[143] FUNC direct_read_lock type_id=28
[144] FUNC direct_write_lock type_id=28
[145] FUNC direct_read_head type_id=28
[146] FUNC direct_write_head type_id=28
[147] FUNC direct_read_node type_id=28
[148] FUNC direct_write_node type_id=28
[149] FUNC use_after_unlock_push_front type_id=28
[150] FUNC use_after_unlock_push_back type_id=28
[151] FUNC double_push_front type_id=28
[152] FUNC double_push_back type_id=28
[153] FUNC no_node_value_type type_id=28
[154] STRUCT (anon) size=4 vlen=1
	data type_id=2 bits_offset=0
[155] FUNC incorrect_value_type type_id=28
[156] PTR (anon) type_id=157
[157] STRUCT __sk_buff size=192 vlen=34
	len type_id=9 bits_offset=0
	pkt_type type_id=9 bits_offset=32
	mark type_id=9 bits_offset=64
	queue_mapping type_id=9 bits_offset=96
	protocol type_id=9 bits_offset=128
	vlan_present type_id=9 bits_offset=160
	vlan_tci type_id=9 bits_offset=192
	vlan_proto type_id=9 bits_offset=224
	priority type_id=9 bits_offset=256
	ingress_ifindex type_id=9 bits_offset=288
	ifindex type_id=9 bits_offset=320
	tc_index type_id=9 bits_offset=352
	cb type_id=158 bits_offset=384
	hash type_id=9 bits_offset=544
	tc_classid type_id=9 bits_offset=576
	data type_id=9 bits_offset=608
	data_end type_id=9 bits_offset=640
	napi_id type_id=9 bits_offset=672
	family type_id=9 bits_offset=704
	remote_ip4 type_id=9 bits_offset=736
	local_ip4 type_id=9 bits_offset=768
	remote_ip6 type_id=159 bits_offset=800
	local_ip6 type_id=159 bits_offset=928
	remote_port type_id=9 bits_offset=1056
	local_port type_id=9 bits_offset=1088
	data_meta type_id=9 bits_offset=1120
	(anon) type_id=160 bits_offset=1152
	tstamp type_id=12 bits_offset=1216
	wire_len type_id=9 bits_offset=1280
	gso_segs type_id=9 bits_offset=1312
	(anon) type_id=162 bits_offset=1344
	gso_size type_id=9 bits_offset=1408
	tstamp_type type_id=164 bits_offset=1440
	hwtstamp type_id=12 bits_offset=1472
[158] ARRAY (anon) type_id=9 index_type_id=4 nr_elems=5
[159] ARRAY (anon) type_id=9 index_type_id=4 nr_elems=4
[160] UNION (anon) size=8 vlen=1
	flow_keys type_id=161 bits_offset=0
[161] PTR (anon) type_id=186
[162] UNION (anon) size=8 vlen=1
	sk type_id=163 bits_offset=0
[163] PTR (anon) type_id=188
[164] TYPEDEF __u8 type_id=165
[165] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
[166] FUNC_PROTO (anon) return=2 args=(156 ctx)
[167] FUNC incorrect_node_var_off type_id=166
[168] FUNC incorrect_node_off1 type_id=28
[169] FUNC incorrect_node_off2 type_id=28
[170] FUNC no_head_type type_id=28
[171] FUNC incorrect_head_var_off1 type_id=166
[172] FUNC incorrect_head_var_off2 type_id=166
[173] FUNC incorrect_head_off1 type_id=28
[174] FUNC incorrect_head_off2 type_id=28
[175] FUNC pop_front_off type_id=28
[176] STRUCT (anon) size=24 vlen=2
	head type_id=11 bits_offset=0
	lock type_id=8 bits_offset=128
[177] DECL_TAG contains:foo:node2 type=176 component_idx=0
[178] FUNC pop_back_off type_id=28
[179] VAR ghead type_id=11 linkage=0
[180] DECL_TAG contains:foo:node2 type=179 component_idx=-1
[181] VAR glock2 type_id=8 linkage=0
[182] VAR glock type_id=8 linkage=0
[183] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
[184] ARRAY (anon) type_id=183 index_type_id=4 nr_elems=4
[185] VAR _license type_id=184 linkage=1
[186] FWD bpf_flow_keys struct
[187] FWD test2 struct
[188] FWD bpf_sock struct
[189] DATASEC .maps size=104 vlen=3
	 type_id=19 offset=0 size=32
	 type_id=25 offset=32 size=40
	 type_id=26 offset=72 size=32
[190] DATASEC .bss.A size=20 vlen=2
	 type_id=179 offset=0 size=16
	 type_id=182 offset=16 size=4
[191] DATASEC .bss.B size=4 vlen=1
	 type_id=181 offset=0 size=4
[192] DATASEC license size=4 vlen=1
	 type_id=185 offset=0 size=4
[193] DATASEC .ksyms size=24 vlen=6
	 type_id=194 offset=0 size=4
	 type_id=194 offset=4 size=4
	 type_id=194 offset=8 size=4
	 type_id=194 offset=12 size=4
	 type_id=194 offset=16 size=4
	 type_id=194 offset=20 size=4
[194] VAR dummy_ksym type_id=2 linkage=1

#134/82  linked_list/map_compat_kretprobe:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'map_compat_tp': BPF program load failed: Invalid argument
libbpf: prog 'map_compat_tp': failed to load: -22
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -22
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -22
Expected: tracing progs cannot use bpf_{list_head,rb_root} yet
Verifier: magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 3520
str_off: 3520
str_len: 7267
btf_total_size: 10811
[1] PTR (anon) type_id=3
[2] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[3] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=2
[4] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
[5] PTR (anon) type_id=2
[6] PTR (anon) type_id=7
[7] STRUCT map_value size=24 vlen=3
	lock type_id=8 bits_offset=0
	data type_id=2 bits_offset=32
	head type_id=11 bits_offset=64
[8] STRUCT bpf_spin_lock size=4 vlen=1
	val type_id=9 bits_offset=0
[9] TYPEDEF __u32 type_id=10
[10] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
[11] STRUCT bpf_list_head size=16 vlen=1
	__opaque type_id=14 bits_offset=0
[12] TYPEDEF __u64 type_id=13
[13] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
[14] ARRAY (anon) type_id=12 index_type_id=4 nr_elems=2
[15] DECL_TAG contains:foo:node2 type=7 component_idx=2
[16] PTR (anon) type_id=17
[17] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=1
[18] STRUCT array_map size=32 vlen=4
	type type_id=1 bits_offset=0
	key type_id=5 bits_offset=64
	value type_id=6 bits_offset=128
	max_entries type_id=16 bits_offset=192
[19] VAR inner_map type_id=18 linkage=1
[20] PTR (anon) type_id=21
[21] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=12
[22] PTR (anon) type_id=18
[23] ARRAY (anon) type_id=22 index_type_id=4 nr_elems=0
[24] STRUCT (anon) size=32 vlen=5
	type type_id=20 bits_offset=0
	max_entries type_id=16 bits_offset=64
	key type_id=5 bits_offset=128
	value type_id=5 bits_offset=192
	values type_id=23 bits_offset=256
[25] VAR map_of_maps type_id=24 linkage=1
[26] VAR array_map type_id=18 linkage=1
[27] PTR (anon) type_id=0
[28] FUNC_PROTO (anon) return=2 args=(27 ctx)
[29] FUNC kptr_missing_lock_pop_front type_id=28
[30] STRUCT foo size=72 vlen=5
	node type_id=31 bits_offset=0
	head type_id=11 bits_offset=192
	lock type_id=8 bits_offset=320
	data type_id=2 bits_offset=352
	node2 type_id=31 bits_offset=384
[31] STRUCT bpf_list_node size=24 vlen=1
	__opaque type_id=32 bits_offset=0
[32] ARRAY (anon) type_id=12 index_type_id=4 nr_elems=3
[33] DECL_TAG contains:bar:node type=30 component_idx=1
[34] FUNC_PROTO (anon) return=27 args=(12 dummy_ksym, 27 dummy_ksym)
[35] FUNC bpf_obj_new_impl type_id=34
[36] FUNC_PROTO (anon) return=0 args=(27 dummy_ksym, 27 dummy_ksym)
[37] FUNC bpf_obj_drop_impl type_id=36
[38] STRUCT bar size=32 vlen=2
	node type_id=31 bits_offset=0
	data type_id=2 bits_offset=192
[39] FUNC_PROTO (anon) return=40 args=(41 dummy_ksym)
[40] PTR (anon) type_id=31
[41] PTR (anon) type_id=11
[42] FUNC bpf_list_pop_front type_id=39
[43] FUNC kptr_missing_lock_pop_back type_id=28
[44] FUNC bpf_list_pop_back type_id=39
[45] FUNC global_missing_lock_pop_front type_id=28
[46] FUNC global_missing_lock_pop_back type_id=28
[47] FUNC map_missing_lock_pop_front type_id=28
[48] FUNC map_missing_lock_pop_back type_id=28
[49] FUNC inner_map_missing_lock_pop_front type_id=28
[50] FUNC inner_map_missing_lock_pop_back type_id=28
[51] FUNC kptr_missing_lock_push_front type_id=28
[52] FUNC_PROTO (anon) return=2 args=(41 dummy_ksym, 40 dummy_ksym, 27 dummy_ksym, 12 dummy_ksym)
[53] FUNC bpf_list_push_front_impl type_id=52
[54] FUNC kptr_missing_lock_push_back type_id=28
[55] FUNC bpf_list_push_back_impl type_id=52
[56] FUNC global_missing_lock_push_front type_id=28
[57] FUNC global_missing_lock_push_back type_id=28
[58] FUNC map_missing_lock_push_front type_id=28
[59] FUNC map_missing_lock_push_back type_id=28
[60] FUNC inner_map_missing_lock_push_front type_id=28
[61] FUNC inner_map_missing_lock_push_back type_id=28
[62] FUNC kptr_kptr_incorrect_lock_pop_front type_id=28
[63] FUNC kptr_global_incorrect_lock_pop_front type_id=28
[64] FUNC kptr_map_incorrect_lock_pop_front type_id=28
[65] FUNC kptr_inner_map_incorrect_lock_pop_front type_id=28
[66] FUNC global_global_incorrect_lock_pop_front type_id=28
[67] FUNC global_kptr_incorrect_lock_pop_front type_id=28
[68] FUNC global_map_incorrect_lock_pop_front type_id=28
[69] FUNC global_inner_map_incorrect_lock_pop_front type_id=28
[70] FUNC map_map_incorrect_lock_pop_front type_id=28
[71] FUNC map_kptr_incorrect_lock_pop_front type_id=28
[72] FUNC map_global_incorrect_lock_pop_front type_id=28
[73] FUNC map_inner_map_incorrect_lock_pop_front type_id=28
[74] FUNC inner_map_inner_map_incorrect_lock_pop_front type_id=28
[75] FUNC inner_map_kptr_incorrect_lock_pop_front type_id=28
[76] FUNC inner_map_global_incorrect_lock_pop_front type_id=28
[77] FUNC inner_map_map_incorrect_lock_pop_front type_id=28
[78] FUNC kptr_kptr_incorrect_lock_pop_back type_id=28
[79] FUNC kptr_global_incorrect_lock_pop_back type_id=28
[80] FUNC kptr_map_incorrect_lock_pop_back type_id=28
[81] FUNC kptr_inner_map_incorrect_lock_pop_back type_id=28
[82] FUNC global_global_incorrect_lock_pop_back type_id=28
[83] FUNC global_kptr_incorrect_lock_pop_back type_id=28
[84] FUNC global_map_incorrect_lock_pop_back type_id=28
[85] FUNC global_inner_map_incorrect_lock_pop_back type_id=28
[86] FUNC map_map_incorrect_lock_pop_back type_id=28
[87] FUNC map_kptr_incorrect_lock_pop_back type_id=28
[88] FUNC map_global_incorrect_lock_pop_back type_id=28
[89] FUNC map_inner_map_incorrect_lock_pop_back type_id=28
[90] FUNC inner_map_inner_map_incorrect_lock_pop_back type_id=28
[91] FUNC inner_map_kptr_incorrect_lock_pop_back type_id=28
[92] FUNC inner_map_global_incorrect_lock_pop_back type_id=28
[93] FUNC inner_map_map_incorrect_lock_pop_back type_id=28
[94] FUNC kptr_kptr_incorrect_lock_push_front type_id=28
[95] FUNC kptr_global_incorrect_lock_push_front type_id=28
[96] FUNC kptr_map_incorrect_lock_push_front type_id=28
[97] FUNC kptr_inner_map_incorrect_lock_push_front type_id=28
[98] FUNC global_global_incorrect_lock_push_front type_id=28
[99] FUNC global_kptr_incorrect_lock_push_front type_id=28
[100] FUNC global_map_incorrect_lock_push_front type_id=28
[101] FUNC global_inner_map_incorrect_lock_push_front type_id=28
[102] FUNC map_map_incorrect_lock_push_front type_id=28
[103] FUNC map_kptr_incorrect_lock_push_front type_id=28
[104] FUNC map_global_incorrect_lock_push_front type_id=28
[105] FUNC map_inner_map_incorrect_lock_push_front type_id=28
[106] FUNC inner_map_inner_map_incorrect_lock_push_front type_id=28
[107] FUNC inner_map_kptr_incorrect_lock_push_front type_id=28
[108] FUNC inner_map_global_incorrect_lock_push_front type_id=28
[109] FUNC inner_map_map_incorrect_lock_push_front type_id=28
[110] FUNC kptr_kptr_incorrect_lock_push_back type_id=28
[111] FUNC kptr_global_incorrect_lock_push_back type_id=28
[112] FUNC kptr_map_incorrect_lock_push_back type_id=28
[113] FUNC kptr_inner_map_incorrect_lock_push_back type_id=28
[114] FUNC global_global_incorrect_lock_push_back type_id=28
[115] FUNC global_kptr_incorrect_lock_push_back type_id=28
[116] FUNC global_map_incorrect_lock_push_back type_id=28
[117] FUNC global_inner_map_incorrect_lock_push_back type_id=28
[118] FUNC map_map_incorrect_lock_push_back type_id=28
[119] FUNC map_kptr_incorrect_lock_push_back type_id=28
[120] FUNC map_global_incorrect_lock_push_back type_id=28
[121] FUNC map_inner_map_incorrect_lock_push_back type_id=28
[122] FUNC inner_map_inner_map_incorrect_lock_push_back type_id=28
[123] FUNC inner_map_kptr_incorrect_lock_push_back type_id=28
[124] FUNC inner_map_global_incorrect_lock_push_back type_id=28
[125] FUNC inner_map_map_incorrect_lock_push_back type_id=28
[126] FUNC map_compat_kprobe type_id=28
[127] FUNC map_compat_kretprobe type_id=28
[128] FUNC map_compat_tp type_id=28
[129] FUNC map_compat_perf type_id=28
[130] FUNC map_compat_raw_tp type_id=28
[131] FUNC map_compat_raw_tp_w type_id=28
[132] FUNC obj_type_id_oor type_id=28
[133] FUNC obj_new_no_composite type_id=28
[134] FUNC obj_new_no_struct type_id=28
[135] UNION (anon) size=4 vlen=2
	data type_id=2 bits_offset=0
	udata type_id=10 bits_offset=0
[136] FUNC obj_drop_non_zero_off type_id=28
[137] FUNC new_null_ret type_id=28
[138] FUNC obj_new_acq type_id=28
[139] FUNC use_after_drop type_id=28
[140] FUNC ptr_walk_scalar type_id=28
[141] STRUCT test1 size=8 vlen=1
	ptr type_id=142 bits_offset=0
[142] PTR (anon) type_id=187
[143] FUNC direct_read_lock type_id=28
[144] FUNC direct_write_lock type_id=28
[145] FUNC direct_read_head type_id=28
[146] FUNC direct_write_head type_id=28
[147] FUNC direct_read_node type_id=28
[148] FUNC direct_write_node type_id=28
[149] FUNC use_after_unlock_push_front type_id=28
[150] FUNC use_after_unlock_push_back type_id=28
[151] FUNC double_push_front type_id=28
[152] FUNC double_push_back type_id=28
[153] FUNC no_node_value_type type_id=28
[154] STRUCT (anon) size=4 vlen=1
	data type_id=2 bits_offset=0
[155] FUNC incorrect_value_type type_id=28
[156] PTR (anon) type_id=157
[157] STRUCT __sk_buff size=192 vlen=34
	len type_id=9 bits_offset=0
	pkt_type type_id=9 bits_offset=32
	mark type_id=9 bits_offset=64
	queue_mapping type_id=9 bits_offset=96
	protocol type_id=9 bits_offset=128
	vlan_present type_id=9 bits_offset=160
	vlan_tci type_id=9 bits_offset=192
	vlan_proto type_id=9 bits_offset=224
	priority type_id=9 bits_offset=256
	ingress_ifindex type_id=9 bits_offset=288
	ifindex type_id=9 bits_offset=320
	tc_index type_id=9 bits_offset=352
	cb type_id=158 bits_offset=384
	hash type_id=9 bits_offset=544
	tc_classid type_id=9 bits_offset=576
	data type_id=9 bits_offset=608
	data_end type_id=9 bits_offset=640
	napi_id type_id=9 bits_offset=672
	family type_id=9 bits_offset=704
	remote_ip4 type_id=9 bits_offset=736
	local_ip4 type_id=9 bits_offset=768
	remote_ip6 type_id=159 bits_offset=800
	local_ip6 type_id=159 bits_offset=928
	remote_port type_id=9 bits_offset=1056
	local_port type_id=9 bits_offset=1088
	data_meta type_id=9 bits_offset=1120
	(anon) type_id=160 bits_offset=1152
	tstamp type_id=12 bits_offset=1216
	wire_len type_id=9 bits_offset=1280
	gso_segs type_id=9 bits_offset=1312
	(anon) type_id=162 bits_offset=1344
	gso_size type_id=9 bits_offset=1408
	tstamp_type type_id=164 bits_offset=1440
	hwtstamp type_id=12 bits_offset=1472
[158] ARRAY (anon) type_id=9 index_type_id=4 nr_elems=5
[159] ARRAY (anon) type_id=9 index_type_id=4 nr_elems=4
[160] UNION (anon) size=8 vlen=1
	flow_keys type_id=161 bits_offset=0
[161] PTR (anon) type_id=186
[162] UNION (anon) size=8 vlen=1
	sk type_id=163 bits_offset=0
[163] PTR (anon) type_id=188
[164] TYPEDEF __u8 type_id=165
[165] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
[166] FUNC_PROTO (anon) return=2 args=(156 ctx)
[167] FUNC incorrect_node_var_off type_id=166
[168] FUNC incorrect_node_off1 type_id=28
[169] FUNC incorrect_node_off2 type_id=28
[170] FUNC no_head_type type_id=28
[171] FUNC incorrect_head_var_off1 type_id=166
[172] FUNC incorrect_head_var_off2 type_id=166
[173] FUNC incorrect_head_off1 type_id=28
[174] FUNC incorrect_head_off2 type_id=28
[175] FUNC pop_front_off type_id=28
[176] STRUCT (anon) size=24 vlen=2
	head type_id=11 bits_offset=0
	lock type_id=8 bits_offset=128
[177] DECL_TAG contains:foo:node2 type=176 component_idx=0
[178] FUNC pop_back_off type_id=28
[179] VAR ghead type_id=11 linkage=0
[180] DECL_TAG contains:foo:node2 type=179 component_idx=-1
[181] VAR glock2 type_id=8 linkage=0
[182] VAR glock type_id=8 linkage=0
[183] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
[184] ARRAY (anon) type_id=183 index_type_id=4 nr_elems=4
[185] VAR _license type_id=184 linkage=1
[186] FWD bpf_flow_keys struct
[187] FWD test2 struct
[188] FWD bpf_sock struct
[189] DATASEC .maps size=104 vlen=3
	 type_id=19 offset=0 size=32
	 type_id=25 offset=32 size=40
	 type_id=26 offset=72 size=32
[190] DATASEC .bss.A size=20 vlen=2
	 type_id=179 offset=0 size=16
	 type_id=182 offset=16 size=4
[191] DATASEC .bss.B size=4 vlen=1
	 type_id=181 offset=0 size=4
[192] DATASEC license size=4 vlen=1
	 type_id=185 offset=0 size=4
[193] DATASEC .ksyms size=24 vlen=6
	 type_id=194 offset=0 size=4
	 type_id=194 offset=4 size=4
	 type_id=194 offset=8 size=4
	 type_id=194 offset=12 size=4
	 type_id=194 offset=16 size=4
	 type_id=194 offset=20 size=4
[194] VAR dummy_ksym type_id=2 linkage=1

#134/83  linked_list/map_compat_tp:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'map_compat_perf': BPF program load failed: Invalid argument
libbpf: prog 'map_compat_perf': failed to load: -22
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -22
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -22
Expected: tracing progs cannot use bpf_{list_head,rb_root} yet
Verifier: magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 3520
str_off: 3520
str_len: 7267
btf_total_size: 10811
[1] PTR (anon) type_id=3
[2] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[3] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=2
[4] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
[5] PTR (anon) type_id=2
[6] PTR (anon) type_id=7
[7] STRUCT map_value size=24 vlen=3
	lock type_id=8 bits_offset=0
	data type_id=2 bits_offset=32
	head type_id=11 bits_offset=64
[8] STRUCT bpf_spin_lock size=4 vlen=1
	val type_id=9 bits_offset=0
[9] TYPEDEF __u32 type_id=10
[10] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
[11] STRUCT bpf_list_head size=16 vlen=1
	__opaque type_id=14 bits_offset=0
[12] TYPEDEF __u64 type_id=13
[13] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
[14] ARRAY (anon) type_id=12 index_type_id=4 nr_elems=2
[15] DECL_TAG contains:foo:node2 type=7 component_idx=2
[16] PTR (anon) type_id=17
[17] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=1
[18] STRUCT array_map size=32 vlen=4
	type type_id=1 bits_offset=0
	key type_id=5 bits_offset=64
	value type_id=6 bits_offset=128
	max_entries type_id=16 bits_offset=192
[19] VAR inner_map type_id=18 linkage=1
[20] PTR (anon) type_id=21
[21] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=12
[22] PTR (anon) type_id=18
[23] ARRAY (anon) type_id=22 index_type_id=4 nr_elems=0
[24] STRUCT (anon) size=32 vlen=5
	type type_id=20 bits_offset=0
	max_entries type_id=16 bits_offset=64
	key type_id=5 bits_offset=128
	value type_id=5 bits_offset=192
	values type_id=23 bits_offset=256
[25] VAR map_of_maps type_id=24 linkage=1
[26] VAR array_map type_id=18 linkage=1
[27] PTR (anon) type_id=0
[28] FUNC_PROTO (anon) return=2 args=(27 ctx)
[29] FUNC kptr_missing_lock_pop_front type_id=28
[30] STRUCT foo size=72 vlen=5
	node type_id=31 bits_offset=0
	head type_id=11 bits_offset=192
	lock type_id=8 bits_offset=320
	data type_id=2 bits_offset=352
	node2 type_id=31 bits_offset=384
[31] STRUCT bpf_list_node size=24 vlen=1
	__opaque type_id=32 bits_offset=0
[32] ARRAY (anon) type_id=12 index_type_id=4 nr_elems=3
[33] DECL_TAG contains:bar:node type=30 component_idx=1
[34] FUNC_PROTO (anon) return=27 args=(12 dummy_ksym, 27 dummy_ksym)
[35] FUNC bpf_obj_new_impl type_id=34
[36] FUNC_PROTO (anon) return=0 args=(27 dummy_ksym, 27 dummy_ksym)
[37] FUNC bpf_obj_drop_impl type_id=36
[38] STRUCT bar size=32 vlen=2
	node type_id=31 bits_offset=0
	data type_id=2 bits_offset=192
[39] FUNC_PROTO (anon) return=40 args=(41 dummy_ksym)
[40] PTR (anon) type_id=31
[41] PTR (anon) type_id=11
[42] FUNC bpf_list_pop_front type_id=39
[43] FUNC kptr_missing_lock_pop_back type_id=28
[44] FUNC bpf_list_pop_back type_id=39
[45] FUNC global_missing_lock_pop_front type_id=28
[46] FUNC global_missing_lock_pop_back type_id=28
[47] FUNC map_missing_lock_pop_front type_id=28
[48] FUNC map_missing_lock_pop_back type_id=28
[49] FUNC inner_map_missing_lock_pop_front type_id=28
[50] FUNC inner_map_missing_lock_pop_back type_id=28
[51] FUNC kptr_missing_lock_push_front type_id=28
[52] FUNC_PROTO (anon) return=2 args=(41 dummy_ksym, 40 dummy_ksym, 27 dummy_ksym, 12 dummy_ksym)
[53] FUNC bpf_list_push_front_impl type_id=52
[54] FUNC kptr_missing_lock_push_back type_id=28
[55] FUNC bpf_list_push_back_impl type_id=52
[56] FUNC global_missing_lock_push_front type_id=28
[57] FUNC global_missing_lock_push_back type_id=28
[58] FUNC map_missing_lock_push_front type_id=28
[59] FUNC map_missing_lock_push_back type_id=28
[60] FUNC inner_map_missing_lock_push_front type_id=28
[61] FUNC inner_map_missing_lock_push_back type_id=28
[62] FUNC kptr_kptr_incorrect_lock_pop_front type_id=28
[63] FUNC kptr_global_incorrect_lock_pop_front type_id=28
[64] FUNC kptr_map_incorrect_lock_pop_front type_id=28
[65] FUNC kptr_inner_map_incorrect_lock_pop_front type_id=28
[66] FUNC global_global_incorrect_lock_pop_front type_id=28
[67] FUNC global_kptr_incorrect_lock_pop_front type_id=28
[68] FUNC global_map_incorrect_lock_pop_front type_id=28
[69] FUNC global_inner_map_incorrect_lock_pop_front type_id=28
[70] FUNC map_map_incorrect_lock_pop_front type_id=28
[71] FUNC map_kptr_incorrect_lock_pop_front type_id=28
[72] FUNC map_global_incorrect_lock_pop_front type_id=28
[73] FUNC map_inner_map_incorrect_lock_pop_front type_id=28
[74] FUNC inner_map_inner_map_incorrect_lock_pop_front type_id=28
[75] FUNC inner_map_kptr_incorrect_lock_pop_front type_id=28
[76] FUNC inner_map_global_incorrect_lock_pop_front type_id=28
[77] FUNC inner_map_map_incorrect_lock_pop_front type_id=28
[78] FUNC kptr_kptr_incorrect_lock_pop_back type_id=28
[79] FUNC kptr_global_incorrect_lock_pop_back type_id=28
[80] FUNC kptr_map_incorrect_lock_pop_back type_id=28
[81] FUNC kptr_inner_map_incorrect_lock_pop_back type_id=28
[82] FUNC global_global_incorrect_lock_pop_back type_id=28
[83] FUNC global_kptr_incorrect_lock_pop_back type_id=28
[84] FUNC global_map_incorrect_lock_pop_back type_id=28
[85] FUNC global_inner_map_incorrect_lock_pop_back type_id=28
[86] FUNC map_map_incorrect_lock_pop_back type_id=28
[87] FUNC map_kptr_incorrect_lock_pop_back type_id=28
[88] FUNC map_global_incorrect_lock_pop_back type_id=28
[89] FUNC map_inner_map_incorrect_lock_pop_back type_id=28
[90] FUNC inner_map_inner_map_incorrect_lock_pop_back type_id=28
[91] FUNC inner_map_kptr_incorrect_lock_pop_back type_id=28
[92] FUNC inner_map_global_incorrect_lock_pop_back type_id=28
[93] FUNC inner_map_map_incorrect_lock_pop_back type_id=28
[94] FUNC kptr_kptr_incorrect_lock_push_front type_id=28
[95] FUNC kptr_global_incorrect_lock_push_front type_id=28
[96] FUNC kptr_map_incorrect_lock_push_front type_id=28
[97] FUNC kptr_inner_map_incorrect_lock_push_front type_id=28
[98] FUNC global_global_incorrect_lock_push_front type_id=28
[99] FUNC global_kptr_incorrect_lock_push_front type_id=28
[100] FUNC global_map_incorrect_lock_push_front type_id=28
[101] FUNC global_inner_map_incorrect_lock_push_front type_id=28
[102] FUNC map_map_incorrect_lock_push_front type_id=28
[103] FUNC map_kptr_incorrect_lock_push_front type_id=28
[104] FUNC map_global_incorrect_lock_push_front type_id=28
[105] FUNC map_inner_map_incorrect_lock_push_front type_id=28
[106] FUNC inner_map_inner_map_incorrect_lock_push_front type_id=28
[107] FUNC inner_map_kptr_incorrect_lock_push_front type_id=28
[108] FUNC inner_map_global_incorrect_lock_push_front type_id=28
[109] FUNC inner_map_map_incorrect_lock_push_front type_id=28
[110] FUNC kptr_kptr_incorrect_lock_push_back type_id=28
[111] FUNC kptr_global_incorrect_lock_push_back type_id=28
[112] FUNC kptr_map_incorrect_lock_push_back type_id=28
[113] FUNC kptr_inner_map_incorrect_lock_push_back type_id=28
[114] FUNC global_global_incorrect_lock_push_back type_id=28
[115] FUNC global_kptr_incorrect_lock_push_back type_id=28
[116] FUNC global_map_incorrect_lock_push_back type_id=28
[117] FUNC global_inner_map_incorrect_lock_push_back type_id=28
[118] FUNC map_map_incorrect_lock_push_back type_id=28
[119] FUNC map_kptr_incorrect_lock_push_back type_id=28
[120] FUNC map_global_incorrect_lock_push_back type_id=28
[121] FUNC map_inner_map_incorrect_lock_push_back type_id=28
[122] FUNC inner_map_inner_map_incorrect_lock_push_back type_id=28
[123] FUNC inner_map_kptr_incorrect_lock_push_back type_id=28
[124] FUNC inner_map_global_incorrect_lock_push_back type_id=28
[125] FUNC inner_map_map_incorrect_lock_push_back type_id=28
[126] FUNC map_compat_kprobe type_id=28
[127] FUNC map_compat_kretprobe type_id=28
[128] FUNC map_compat_tp type_id=28
[129] FUNC map_compat_perf type_id=28
[130] FUNC map_compat_raw_tp type_id=28
[131] FUNC map_compat_raw_tp_w type_id=28
[132] FUNC obj_type_id_oor type_id=28
[133] FUNC obj_new_no_composite type_id=28
[134] FUNC obj_new_no_struct type_id=28
[135] UNION (anon) size=4 vlen=2
	data type_id=2 bits_offset=0
	udata type_id=10 bits_offset=0
[136] FUNC obj_drop_non_zero_off type_id=28
[137] FUNC new_null_ret type_id=28
[138] FUNC obj_new_acq type_id=28
[139] FUNC use_after_drop type_id=28
[140] FUNC ptr_walk_scalar type_id=28
[141] STRUCT test1 size=8 vlen=1
	ptr type_id=142 bits_offset=0
[142] PTR (anon) type_id=187
[143] FUNC direct_read_lock type_id=28
[144] FUNC direct_write_lock type_id=28
[145] FUNC direct_read_head type_id=28
[146] FUNC direct_write_head type_id=28
[147] FUNC direct_read_node type_id=28
[148] FUNC direct_write_node type_id=28
[149] FUNC use_after_unlock_push_front type_id=28
[150] FUNC use_after_unlock_push_back type_id=28
[151] FUNC double_push_front type_id=28
[152] FUNC double_push_back type_id=28
[153] FUNC no_node_value_type type_id=28
[154] STRUCT (anon) size=4 vlen=1
	data type_id=2 bits_offset=0
[155] FUNC incorrect_value_type type_id=28
[156] PTR (anon) type_id=157
[157] STRUCT __sk_buff size=192 vlen=34
	len type_id=9 bits_offset=0
	pkt_type type_id=9 bits_offset=32
	mark type_id=9 bits_offset=64
	queue_mapping type_id=9 bits_offset=96
	protocol type_id=9 bits_offset=128
	vlan_present type_id=9 bits_offset=160
	vlan_tci type_id=9 bits_offset=192
	vlan_proto type_id=9 bits_offset=224
	priority type_id=9 bits_offset=256
	ingress_ifindex type_id=9 bits_offset=288
	ifindex type_id=9 bits_offset=320
	tc_index type_id=9 bits_offset=352
	cb type_id=158 bits_offset=384
	hash type_id=9 bits_offset=544
	tc_classid type_id=9 bits_offset=576
	data type_id=9 bits_offset=608
	data_end type_id=9 bits_offset=640
	napi_id type_id=9 bits_offset=672
	family type_id=9 bits_offset=704
	remote_ip4 type_id=9 bits_offset=736
	local_ip4 type_id=9 bits_offset=768
	remote_ip6 type_id=159 bits_offset=800
	local_ip6 type_id=159 bits_offset=928
	remote_port type_id=9 bits_offset=1056
	local_port type_id=9 bits_offset=1088
	data_meta type_id=9 bits_offset=1120
	(anon) type_id=160 bits_offset=1152
	tstamp type_id=12 bits_offset=1216
	wire_len type_id=9 bits_offset=1280
	gso_segs type_id=9 bits_offset=1312
	(anon) type_id=162 bits_offset=1344
	gso_size type_id=9 bits_offset=1408
	tstamp_type type_id=164 bits_offset=1440
	hwtstamp type_id=12 bits_offset=1472
[158] ARRAY (anon) type_id=9 index_type_id=4 nr_elems=5
[159] ARRAY (anon) type_id=9 index_type_id=4 nr_elems=4
[160] UNION (anon) size=8 vlen=1
	flow_keys type_id=161 bits_offset=0
[161] PTR (anon) type_id=186
[162] UNION (anon) size=8 vlen=1
	sk type_id=163 bits_offset=0
[163] PTR (anon) type_id=188
[164] TYPEDEF __u8 type_id=165
[165] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
[166] FUNC_PROTO (anon) return=2 args=(156 ctx)
[167] FUNC incorrect_node_var_off type_id=166
[168] FUNC incorrect_node_off1 type_id=28
[169] FUNC incorrect_node_off2 type_id=28
[170] FUNC no_head_type type_id=28
[171] FUNC incorrect_head_var_off1 type_id=166
[172] FUNC incorrect_head_var_off2 type_id=166
[173] FUNC incorrect_head_off1 type_id=28
[174] FUNC incorrect_head_off2 type_id=28
[175] FUNC pop_front_off type_id=28
[176] STRUCT (anon) size=24 vlen=2
	head type_id=11 bits_offset=0
	lock type_id=8 bits_offset=128
[177] DECL_TAG contains:foo:node2 type=176 component_idx=0
[178] FUNC pop_back_off type_id=28
[179] VAR ghead type_id=11 linkage=0
[180] DECL_TAG contains:foo:node2 type=179 component_idx=-1
[181] VAR glock2 type_id=8 linkage=0
[182] VAR glock type_id=8 linkage=0
[183] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
[184] ARRAY (anon) type_id=183 index_type_id=4 nr_elems=4
[185] VAR _license type_id=184 linkage=1
[186] FWD bpf_flow_keys struct
[187] FWD test2 struct
[188] FWD bpf_sock struct
[189] DATASEC .maps size=104 vlen=3
	 type_id=19 offset=0 size=32
	 type_id=25 offset=32 size=40
	 type_id=26 offset=72 size=32
[190] DATASEC .bss.A size=20 vlen=2
	 type_id=179 offset=0 size=16
	 type_id=182 offset=16 size=4
[191] DATASEC .bss.B size=4 vlen=1
	 type_id=181 offset=0 size=4
[192] DATASEC license size=4 vlen=1
	 type_id=185 offset=0 size=4
[193] DATASEC .ksyms size=24 vlen=6
	 type_id=194 offset=0 size=4
	 type_id=194 offset=4 size=4
	 type_id=194 offset=8 size=4
	 type_id=194 offset=12 size=4
	 type_id=194 offset=16 size=4
	 type_id=194 offset=20 size=4
[194] VAR dummy_ksym type_id=2 linkage=1

#134/84  linked_list/map_compat_perf:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'map_compat_raw_tp': BPF program load failed: Invalid argument
libbpf: prog 'map_compat_raw_tp': failed to load: -22
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -22
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -22
Expected: tracing progs cannot use bpf_{list_head,rb_root} yet
Verifier: magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 3520
str_off: 3520
str_len: 7267
btf_total_size: 10811
[1] PTR (anon) type_id=3
[2] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[3] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=2
[4] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
[5] PTR (anon) type_id=2
[6] PTR (anon) type_id=7
[7] STRUCT map_value size=24 vlen=3
	lock type_id=8 bits_offset=0
	data type_id=2 bits_offset=32
	head type_id=11 bits_offset=64
[8] STRUCT bpf_spin_lock size=4 vlen=1
	val type_id=9 bits_offset=0
[9] TYPEDEF __u32 type_id=10
[10] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
[11] STRUCT bpf_list_head size=16 vlen=1
	__opaque type_id=14 bits_offset=0
[12] TYPEDEF __u64 type_id=13
[13] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
[14] ARRAY (anon) type_id=12 index_type_id=4 nr_elems=2
[15] DECL_TAG contains:foo:node2 type=7 component_idx=2
[16] PTR (anon) type_id=17
[17] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=1
[18] STRUCT array_map size=32 vlen=4
	type type_id=1 bits_offset=0
	key type_id=5 bits_offset=64
	value type_id=6 bits_offset=128
	max_entries type_id=16 bits_offset=192
[19] VAR inner_map type_id=18 linkage=1
[20] PTR (anon) type_id=21
[21] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=12
[22] PTR (anon) type_id=18
[23] ARRAY (anon) type_id=22 index_type_id=4 nr_elems=0
[24] STRUCT (anon) size=32 vlen=5
	type type_id=20 bits_offset=0
	max_entries type_id=16 bits_offset=64
	key type_id=5 bits_offset=128
	value type_id=5 bits_offset=192
	values type_id=23 bits_offset=256
[25] VAR map_of_maps type_id=24 linkage=1
[26] VAR array_map type_id=18 linkage=1
[27] PTR (anon) type_id=0
[28] FUNC_PROTO (anon) return=2 args=(27 ctx)
[29] FUNC kptr_missing_lock_pop_front type_id=28
[30] STRUCT foo size=72 vlen=5
	node type_id=31 bits_offset=0
	head type_id=11 bits_offset=192
	lock type_id=8 bits_offset=320
	data type_id=2 bits_offset=352
	node2 type_id=31 bits_offset=384
[31] STRUCT bpf_list_node size=24 vlen=1
	__opaque type_id=32 bits_offset=0
[32] ARRAY (anon) type_id=12 index_type_id=4 nr_elems=3
[33] DECL_TAG contains:bar:node type=30 component_idx=1
[34] FUNC_PROTO (anon) return=27 args=(12 dummy_ksym, 27 dummy_ksym)
[35] FUNC bpf_obj_new_impl type_id=34
[36] FUNC_PROTO (anon) return=0 args=(27 dummy_ksym, 27 dummy_ksym)
[37] FUNC bpf_obj_drop_impl type_id=36
[38] STRUCT bar size=32 vlen=2
	node type_id=31 bits_offset=0
	data type_id=2 bits_offset=192
[39] FUNC_PROTO (anon) return=40 args=(41 dummy_ksym)
[40] PTR (anon) type_id=31
[41] PTR (anon) type_id=11
[42] FUNC bpf_list_pop_front type_id=39
[43] FUNC kptr_missing_lock_pop_back type_id=28
[44] FUNC bpf_list_pop_back type_id=39
[45] FUNC global_missing_lock_pop_front type_id=28
[46] FUNC global_missing_lock_pop_back type_id=28
[47] FUNC map_missing_lock_pop_front type_id=28
[48] FUNC map_missing_lock_pop_back type_id=28
[49] FUNC inner_map_missing_lock_pop_front type_id=28
[50] FUNC inner_map_missing_lock_pop_back type_id=28
[51] FUNC kptr_missing_lock_push_front type_id=28
[52] FUNC_PROTO (anon) return=2 args=(41 dummy_ksym, 40 dummy_ksym, 27 dummy_ksym, 12 dummy_ksym)
[53] FUNC bpf_list_push_front_impl type_id=52
[54] FUNC kptr_missing_lock_push_back type_id=28
[55] FUNC bpf_list_push_back_impl type_id=52
[56] FUNC global_missing_lock_push_front type_id=28
[57] FUNC global_missing_lock_push_back type_id=28
[58] FUNC map_missing_lock_push_front type_id=28
[59] FUNC map_missing_lock_push_back type_id=28
[60] FUNC inner_map_missing_lock_push_front type_id=28
[61] FUNC inner_map_missing_lock_push_back type_id=28
[62] FUNC kptr_kptr_incorrect_lock_pop_front type_id=28
[63] FUNC kptr_global_incorrect_lock_pop_front type_id=28
[64] FUNC kptr_map_incorrect_lock_pop_front type_id=28
[65] FUNC kptr_inner_map_incorrect_lock_pop_front type_id=28
[66] FUNC global_global_incorrect_lock_pop_front type_id=28
[67] FUNC global_kptr_incorrect_lock_pop_front type_id=28
[68] FUNC global_map_incorrect_lock_pop_front type_id=28
[69] FUNC global_inner_map_incorrect_lock_pop_front type_id=28
[70] FUNC map_map_incorrect_lock_pop_front type_id=28
[71] FUNC map_kptr_incorrect_lock_pop_front type_id=28
[72] FUNC map_global_incorrect_lock_pop_front type_id=28
[73] FUNC map_inner_map_incorrect_lock_pop_front type_id=28
[74] FUNC inner_map_inner_map_incorrect_lock_pop_front type_id=28
[75] FUNC inner_map_kptr_incorrect_lock_pop_front type_id=28
[76] FUNC inner_map_global_incorrect_lock_pop_front type_id=28
[77] FUNC inner_map_map_incorrect_lock_pop_front type_id=28
[78] FUNC kptr_kptr_incorrect_lock_pop_back type_id=28
[79] FUNC kptr_global_incorrect_lock_pop_back type_id=28
[80] FUNC kptr_map_incorrect_lock_pop_back type_id=28
[81] FUNC kptr_inner_map_incorrect_lock_pop_back type_id=28
[82] FUNC global_global_incorrect_lock_pop_back type_id=28
[83] FUNC global_kptr_incorrect_lock_pop_back type_id=28
[84] FUNC global_map_incorrect_lock_pop_back type_id=28
[85] FUNC global_inner_map_incorrect_lock_pop_back type_id=28
[86] FUNC map_map_incorrect_lock_pop_back type_id=28
[87] FUNC map_kptr_incorrect_lock_pop_back type_id=28
[88] FUNC map_global_incorrect_lock_pop_back type_id=28
[89] FUNC map_inner_map_incorrect_lock_pop_back type_id=28
[90] FUNC inner_map_inner_map_incorrect_lock_pop_back type_id=28
[91] FUNC inner_map_kptr_incorrect_lock_pop_back type_id=28
[92] FUNC inner_map_global_incorrect_lock_pop_back type_id=28
[93] FUNC inner_map_map_incorrect_lock_pop_back type_id=28
[94] FUNC kptr_kptr_incorrect_lock_push_front type_id=28
[95] FUNC kptr_global_incorrect_lock_push_front type_id=28
[96] FUNC kptr_map_incorrect_lock_push_front type_id=28
[97] FUNC kptr_inner_map_incorrect_lock_push_front type_id=28
[98] FUNC global_global_incorrect_lock_push_front type_id=28
[99] FUNC global_kptr_incorrect_lock_push_front type_id=28
[100] FUNC global_map_incorrect_lock_push_front type_id=28
[101] FUNC global_inner_map_incorrect_lock_push_front type_id=28
[102] FUNC map_map_incorrect_lock_push_front type_id=28
[103] FUNC map_kptr_incorrect_lock_push_front type_id=28
[104] FUNC map_global_incorrect_lock_push_front type_id=28
[105] FUNC map_inner_map_incorrect_lock_push_front type_id=28
[106] FUNC inner_map_inner_map_incorrect_lock_push_front type_id=28
[107] FUNC inner_map_kptr_incorrect_lock_push_front type_id=28
[108] FUNC inner_map_global_incorrect_lock_push_front type_id=28
[109] FUNC inner_map_map_incorrect_lock_push_front type_id=28
[110] FUNC kptr_kptr_incorrect_lock_push_back type_id=28
[111] FUNC kptr_global_incorrect_lock_push_back type_id=28
[112] FUNC kptr_map_incorrect_lock_push_back type_id=28
[113] FUNC kptr_inner_map_incorrect_lock_push_back type_id=28
[114] FUNC global_global_incorrect_lock_push_back type_id=28
[115] FUNC global_kptr_incorrect_lock_push_back type_id=28
[116] FUNC global_map_incorrect_lock_push_back type_id=28
[117] FUNC global_inner_map_incorrect_lock_push_back type_id=28
[118] FUNC map_map_incorrect_lock_push_back type_id=28
[119] FUNC map_kptr_incorrect_lock_push_back type_id=28
[120] FUNC map_global_incorrect_lock_push_back type_id=28
[121] FUNC map_inner_map_incorrect_lock_push_back type_id=28
[122] FUNC inner_map_inner_map_incorrect_lock_push_back type_id=28
[123] FUNC inner_map_kptr_incorrect_lock_push_back type_id=28
[124] FUNC inner_map_global_incorrect_lock_push_back type_id=28
[125] FUNC inner_map_map_incorrect_lock_push_back type_id=28
[126] FUNC map_compat_kprobe type_id=28
[127] FUNC map_compat_kretprobe type_id=28
[128] FUNC map_compat_tp type_id=28
[129] FUNC map_compat_perf type_id=28
[130] FUNC map_compat_raw_tp type_id=28
[131] FUNC map_compat_raw_tp_w type_id=28
[132] FUNC obj_type_id_oor type_id=28
[133] FUNC obj_new_no_composite type_id=28
[134] FUNC obj_new_no_struct type_id=28
[135] UNION (anon) size=4 vlen=2
	data type_id=2 bits_offset=0
	udata type_id=10 bits_offset=0
[136] FUNC obj_drop_non_zero_off type_id=28
[137] FUNC new_null_ret type_id=28
[138] FUNC obj_new_acq type_id=28
[139] FUNC use_after_drop type_id=28
[140] FUNC ptr_walk_scalar type_id=28
[141] STRUCT test1 size=8 vlen=1
	ptr type_id=142 bits_offset=0
[142] PTR (anon) type_id=187
[143] FUNC direct_read_lock type_id=28
[144] FUNC direct_write_lock type_id=28
[145] FUNC direct_read_head type_id=28
[146] FUNC direct_write_head type_id=28
[147] FUNC direct_read_node type_id=28
[148] FUNC direct_write_node type_id=28
[149] FUNC use_after_unlock_push_front type_id=28
[150] FUNC use_after_unlock_push_back type_id=28
[151] FUNC double_push_front type_id=28
[152] FUNC double_push_back type_id=28
[153] FUNC no_node_value_type type_id=28
[154] STRUCT (anon) size=4 vlen=1
	data type_id=2 bits_offset=0
[155] FUNC incorrect_value_type type_id=28
[156] PTR (anon) type_id=157
[157] STRUCT __sk_buff size=192 vlen=34
	len type_id=9 bits_offset=0
	pkt_type type_id=9 bits_offset=32
	mark type_id=9 bits_offset=64
	queue_mapping type_id=9 bits_offset=96
	protocol type_id=9 bits_offset=128
	vlan_present type_id=9 bits_offset=160
	vlan_tci type_id=9 bits_offset=192
	vlan_proto type_id=9 bits_offset=224
	priority type_id=9 bits_offset=256
	ingress_ifindex type_id=9 bits_offset=288
	ifindex type_id=9 bits_offset=320
	tc_index type_id=9 bits_offset=352
	cb type_id=158 bits_offset=384
	hash type_id=9 bits_offset=544
	tc_classid type_id=9 bits_offset=576
	data type_id=9 bits_offset=608
	data_end type_id=9 bits_offset=640
	napi_id type_id=9 bits_offset=672
	family type_id=9 bits_offset=704
	remote_ip4 type_id=9 bits_offset=736
	local_ip4 type_id=9 bits_offset=768
	remote_ip6 type_id=159 bits_offset=800
	local_ip6 type_id=159 bits_offset=928
	remote_port type_id=9 bits_offset=1056
	local_port type_id=9 bits_offset=1088
	data_meta type_id=9 bits_offset=1120
	(anon) type_id=160 bits_offset=1152
	tstamp type_id=12 bits_offset=1216
	wire_len type_id=9 bits_offset=1280
	gso_segs type_id=9 bits_offset=1312
	(anon) type_id=162 bits_offset=1344
	gso_size type_id=9 bits_offset=1408
	tstamp_type type_id=164 bits_offset=1440
	hwtstamp type_id=12 bits_offset=1472
[158] ARRAY (anon) type_id=9 index_type_id=4 nr_elems=5
[159] ARRAY (anon) type_id=9 index_type_id=4 nr_elems=4
[160] UNION (anon) size=8 vlen=1
	flow_keys type_id=161 bits_offset=0
[161] PTR (anon) type_id=186
[162] UNION (anon) size=8 vlen=1
	sk type_id=163 bits_offset=0
[163] PTR (anon) type_id=188
[164] TYPEDEF __u8 type_id=165
[165] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
[166] FUNC_PROTO (anon) return=2 args=(156 ctx)
[167] FUNC incorrect_node_var_off type_id=166
[168] FUNC incorrect_node_off1 type_id=28
[169] FUNC incorrect_node_off2 type_id=28
[170] FUNC no_head_type type_id=28
[171] FUNC incorrect_head_var_off1 type_id=166
[172] FUNC incorrect_head_var_off2 type_id=166
[173] FUNC incorrect_head_off1 type_id=28
[174] FUNC incorrect_head_off2 type_id=28
[175] FUNC pop_front_off type_id=28
[176] STRUCT (anon) size=24 vlen=2
	head type_id=11 bits_offset=0
	lock type_id=8 bits_offset=128
[177] DECL_TAG contains:foo:node2 type=176 component_idx=0
[178] FUNC pop_back_off type_id=28
[179] VAR ghead type_id=11 linkage=0
[180] DECL_TAG contains:foo:node2 type=179 component_idx=-1
[181] VAR glock2 type_id=8 linkage=0
[182] VAR glock type_id=8 linkage=0
[183] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
[184] ARRAY (anon) type_id=183 index_type_id=4 nr_elems=4
[185] VAR _license type_id=184 linkage=1
[186] FWD bpf_flow_keys struct
[187] FWD test2 struct
[188] FWD bpf_sock struct
[189] DATASEC .maps size=104 vlen=3
	 type_id=19 offset=0 size=32
	 type_id=25 offset=32 size=40
	 type_id=26 offset=72 size=32
[190] DATASEC .bss.A size=20 vlen=2
	 type_id=179 offset=0 size=16
	 type_id=182 offset=16 size=4
[191] DATASEC .bss.B size=4 vlen=1
	 type_id=181 offset=0 size=4
[192] DATASEC license size=4 vlen=1
	 type_id=185 offset=0 size=4
[193] DATASEC .ksyms size=24 vlen=6
	 type_id=194 offset=0 size=4
	 type_id=194 offset=4 size=4
	 type_id=194 offset=8 size=4
	 type_id=194 offset=12 size=4
	 type_id=194 offset=16 size=4
	 type_id=194 offset=20 size=4
[194] VAR dummy_ksym type_id=2 linkage=1

#134/85  linked_list/map_compat_raw_tp:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'map_compat_raw_tp_w': BPF program load failed: Invalid argument
libbpf: prog 'map_compat_raw_tp_w': failed to load: -22
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -22
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -22
Expected: tracing progs cannot use bpf_{list_head,rb_root} yet
Verifier: magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 3520
str_off: 3520
str_len: 7267
btf_total_size: 10811
[1] PTR (anon) type_id=3
[2] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[3] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=2
[4] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
[5] PTR (anon) type_id=2
[6] PTR (anon) type_id=7
[7] STRUCT map_value size=24 vlen=3
	lock type_id=8 bits_offset=0
	data type_id=2 bits_offset=32
	head type_id=11 bits_offset=64
[8] STRUCT bpf_spin_lock size=4 vlen=1
	val type_id=9 bits_offset=0
[9] TYPEDEF __u32 type_id=10
[10] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
[11] STRUCT bpf_list_head size=16 vlen=1
	__opaque type_id=14 bits_offset=0
[12] TYPEDEF __u64 type_id=13
[13] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
[14] ARRAY (anon) type_id=12 index_type_id=4 nr_elems=2
[15] DECL_TAG contains:foo:node2 type=7 component_idx=2
[16] PTR (anon) type_id=17
[17] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=1
[18] STRUCT array_map size=32 vlen=4
	type type_id=1 bits_offset=0
	key type_id=5 bits_offset=64
	value type_id=6 bits_offset=128
	max_entries type_id=16 bits_offset=192
[19] VAR inner_map type_id=18 linkage=1
[20] PTR (anon) type_id=21
[21] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=12
[22] PTR (anon) type_id=18
[23] ARRAY (anon) type_id=22 index_type_id=4 nr_elems=0
[24] STRUCT (anon) size=32 vlen=5
	type type_id=20 bits_offset=0
	max_entries type_id=16 bits_offset=64
	key type_id=5 bits_offset=128
	value type_id=5 bits_offset=192
	values type_id=23 bits_offset=256
[25] VAR map_of_maps type_id=24 linkage=1
[26] VAR array_map type_id=18 linkage=1
[27] PTR (anon) type_id=0
[28] FUNC_PROTO (anon) return=2 args=(27 ctx)
[29] FUNC kptr_missing_lock_pop_front type_id=28
[30] STRUCT foo size=72 vlen=5
	node type_id=31 bits_offset=0
	head type_id=11 bits_offset=192
	lock type_id=8 bits_offset=320
	data type_id=2 bits_offset=352
	node2 type_id=31 bits_offset=384
[31] STRUCT bpf_list_node size=24 vlen=1
	__opaque type_id=32 bits_offset=0
[32] ARRAY (anon) type_id=12 index_type_id=4 nr_elems=3
[33] DECL_TAG contains:bar:node type=30 component_idx=1
[34] FUNC_PROTO (anon) return=27 args=(12 dummy_ksym, 27 dummy_ksym)
[35] FUNC bpf_obj_new_impl type_id=34
[36] FUNC_PROTO (anon) return=0 args=(27 dummy_ksym, 27 dummy_ksym)
[37] FUNC bpf_obj_drop_impl type_id=36
[38] STRUCT bar size=32 vlen=2
	node type_id=31 bits_offset=0
	data type_id=2 bits_offset=192
[39] FUNC_PROTO (anon) return=40 args=(41 dummy_ksym)
[40] PTR (anon) type_id=31
[41] PTR (anon) type_id=11
[42] FUNC bpf_list_pop_front type_id=39
[43] FUNC kptr_missing_lock_pop_back type_id=28
[44] FUNC bpf_list_pop_back type_id=39
[45] FUNC global_missing_lock_pop_front type_id=28
[46] FUNC global_missing_lock_pop_back type_id=28
[47] FUNC map_missing_lock_pop_front type_id=28
[48] FUNC map_missing_lock_pop_back type_id=28
[49] FUNC inner_map_missing_lock_pop_front type_id=28
[50] FUNC inner_map_missing_lock_pop_back type_id=28
[51] FUNC kptr_missing_lock_push_front type_id=28
[52] FUNC_PROTO (anon) return=2 args=(41 dummy_ksym, 40 dummy_ksym, 27 dummy_ksym, 12 dummy_ksym)
[53] FUNC bpf_list_push_front_impl type_id=52
[54] FUNC kptr_missing_lock_push_back type_id=28
[55] FUNC bpf_list_push_back_impl type_id=52
[56] FUNC global_missing_lock_push_front type_id=28
[57] FUNC global_missing_lock_push_back type_id=28
[58] FUNC map_missing_lock_push_front type_id=28
[59] FUNC map_missing_lock_push_back type_id=28
[60] FUNC inner_map_missing_lock_push_front type_id=28
[61] FUNC inner_map_missing_lock_push_back type_id=28
[62] FUNC kptr_kptr_incorrect_lock_pop_front type_id=28
[63] FUNC kptr_global_incorrect_lock_pop_front type_id=28
[64] FUNC kptr_map_incorrect_lock_pop_front type_id=28
[65] FUNC kptr_inner_map_incorrect_lock_pop_front type_id=28
[66] FUNC global_global_incorrect_lock_pop_front type_id=28
[67] FUNC global_kptr_incorrect_lock_pop_front type_id=28
[68] FUNC global_map_incorrect_lock_pop_front type_id=28
[69] FUNC global_inner_map_incorrect_lock_pop_front type_id=28
[70] FUNC map_map_incorrect_lock_pop_front type_id=28
[71] FUNC map_kptr_incorrect_lock_pop_front type_id=28
[72] FUNC map_global_incorrect_lock_pop_front type_id=28
[73] FUNC map_inner_map_incorrect_lock_pop_front type_id=28
[74] FUNC inner_map_inner_map_incorrect_lock_pop_front type_id=28
[75] FUNC inner_map_kptr_incorrect_lock_pop_front type_id=28
[76] FUNC inner_map_global_incorrect_lock_pop_front type_id=28
[77] FUNC inner_map_map_incorrect_lock_pop_front type_id=28
[78] FUNC kptr_kptr_incorrect_lock_pop_back type_id=28
[79] FUNC kptr_global_incorrect_lock_pop_back type_id=28
[80] FUNC kptr_map_incorrect_lock_pop_back type_id=28
[81] FUNC kptr_inner_map_incorrect_lock_pop_back type_id=28
[82] FUNC global_global_incorrect_lock_pop_back type_id=28
[83] FUNC global_kptr_incorrect_lock_pop_back type_id=28
[84] FUNC global_map_incorrect_lock_pop_back type_id=28
[85] FUNC global_inner_map_incorrect_lock_pop_back type_id=28
[86] FUNC map_map_incorrect_lock_pop_back type_id=28
[87] FUNC map_kptr_incorrect_lock_pop_back type_id=28
[88] FUNC map_global_incorrect_lock_pop_back type_id=28
[89] FUNC map_inner_map_incorrect_lock_pop_back type_id=28
[90] FUNC inner_map_inner_map_incorrect_lock_pop_back type_id=28
[91] FUNC inner_map_kptr_incorrect_lock_pop_back type_id=28
[92] FUNC inner_map_global_incorrect_lock_pop_back type_id=28
[93] FUNC inner_map_map_incorrect_lock_pop_back type_id=28
[94] FUNC kptr_kptr_incorrect_lock_push_front type_id=28
[95] FUNC kptr_global_incorrect_lock_push_front type_id=28
[96] FUNC kptr_map_incorrect_lock_push_front type_id=28
[97] FUNC kptr_inner_map_incorrect_lock_push_front type_id=28
[98] FUNC global_global_incorrect_lock_push_front type_id=28
[99] FUNC global_kptr_incorrect_lock_push_front type_id=28
[100] FUNC global_map_incorrect_lock_push_front type_id=28
[101] FUNC global_inner_map_incorrect_lock_push_front type_id=28
[102] FUNC map_map_incorrect_lock_push_front type_id=28
[103] FUNC map_kptr_incorrect_lock_push_front type_id=28
[104] FUNC map_global_incorrect_lock_push_front type_id=28
[105] FUNC map_inner_map_incorrect_lock_push_front type_id=28
[106] FUNC inner_map_inner_map_incorrect_lock_push_front type_id=28
[107] FUNC inner_map_kptr_incorrect_lock_push_front type_id=28
[108] FUNC inner_map_global_incorrect_lock_push_front type_id=28
[109] FUNC inner_map_map_incorrect_lock_push_front type_id=28
[110] FUNC kptr_kptr_incorrect_lock_push_back type_id=28
[111] FUNC kptr_global_incorrect_lock_push_back type_id=28
[112] FUNC kptr_map_incorrect_lock_push_back type_id=28
[113] FUNC kptr_inner_map_incorrect_lock_push_back type_id=28
[114] FUNC global_global_incorrect_lock_push_back type_id=28
[115] FUNC global_kptr_incorrect_lock_push_back type_id=28
[116] FUNC global_map_incorrect_lock_push_back type_id=28
[117] FUNC global_inner_map_incorrect_lock_push_back type_id=28
[118] FUNC map_map_incorrect_lock_push_back type_id=28
[119] FUNC map_kptr_incorrect_lock_push_back type_id=28
[120] FUNC map_global_incorrect_lock_push_back type_id=28
[121] FUNC map_inner_map_incorrect_lock_push_back type_id=28
[122] FUNC inner_map_inner_map_incorrect_lock_push_back type_id=28
[123] FUNC inner_map_kptr_incorrect_lock_push_back type_id=28
[124] FUNC inner_map_global_incorrect_lock_push_back type_id=28
[125] FUNC inner_map_map_incorrect_lock_push_back type_id=28
[126] FUNC map_compat_kprobe type_id=28
[127] FUNC map_compat_kretprobe type_id=28
[128] FUNC map_compat_tp type_id=28
[129] FUNC map_compat_perf type_id=28
[130] FUNC map_compat_raw_tp type_id=28
[131] FUNC map_compat_raw_tp_w type_id=28
[132] FUNC obj_type_id_oor type_id=28
[133] FUNC obj_new_no_composite type_id=28
[134] FUNC obj_new_no_struct type_id=28
[135] UNION (anon) size=4 vlen=2
	data type_id=2 bits_offset=0
	udata type_id=10 bits_offset=0
[136] FUNC obj_drop_non_zero_off type_id=28
[137] FUNC new_null_ret type_id=28
[138] FUNC obj_new_acq type_id=28
[139] FUNC use_after_drop type_id=28
[140] FUNC ptr_walk_scalar type_id=28
[141] STRUCT test1 size=8 vlen=1
	ptr type_id=142 bits_offset=0
[142] PTR (anon) type_id=187
[143] FUNC direct_read_lock type_id=28
[144] FUNC direct_write_lock type_id=28
[145] FUNC direct_read_head type_id=28
[146] FUNC direct_write_head type_id=28
[147] FUNC direct_read_node type_id=28
[148] FUNC direct_write_node type_id=28
[149] FUNC use_after_unlock_push_front type_id=28
[150] FUNC use_after_unlock_push_back type_id=28
[151] FUNC double_push_front type_id=28
[152] FUNC double_push_back type_id=28
[153] FUNC no_node_value_type type_id=28
[154] STRUCT (anon) size=4 vlen=1
	data type_id=2 bits_offset=0
[155] FUNC incorrect_value_type type_id=28
[156] PTR (anon) type_id=157
[157] STRUCT __sk_buff size=192 vlen=34
	len type_id=9 bits_offset=0
	pkt_type type_id=9 bits_offset=32
	mark type_id=9 bits_offset=64
	queue_mapping type_id=9 bits_offset=96
	protocol type_id=9 bits_offset=128
	vlan_present type_id=9 bits_offset=160
	vlan_tci type_id=9 bits_offset=192
	vlan_proto type_id=9 bits_offset=224
	priority type_id=9 bits_offset=256
	ingress_ifindex type_id=9 bits_offset=288
	ifindex type_id=9 bits_offset=320
	tc_index type_id=9 bits_offset=352
	cb type_id=158 bits_offset=384
	hash type_id=9 bits_offset=544
	tc_classid type_id=9 bits_offset=576
	data type_id=9 bits_offset=608
	data_end type_id=9 bits_offset=640
	napi_id type_id=9 bits_offset=672
	family type_id=9 bits_offset=704
	remote_ip4 type_id=9 bits_offset=736
	local_ip4 type_id=9 bits_offset=768
	remote_ip6 type_id=159 bits_offset=800
	local_ip6 type_id=159 bits_offset=928
	remote_port type_id=9 bits_offset=1056
	local_port type_id=9 bits_offset=1088
	data_meta type_id=9 bits_offset=1120
	(anon) type_id=160 bits_offset=1152
	tstamp type_id=12 bits_offset=1216
	wire_len type_id=9 bits_offset=1280
	gso_segs type_id=9 bits_offset=1312
	(anon) type_id=162 bits_offset=1344
	gso_size type_id=9 bits_offset=1408
	tstamp_type type_id=164 bits_offset=1440
	hwtstamp type_id=12 bits_offset=1472
[158] ARRAY (anon) type_id=9 index_type_id=4 nr_elems=5
[159] ARRAY (anon) type_id=9 index_type_id=4 nr_elems=4
[160] UNION (anon) size=8 vlen=1
	flow_keys type_id=161 bits_offset=0
[161] PTR (anon) type_id=186
[162] UNION (anon) size=8 vlen=1
	sk type_id=163 bits_offset=0
[163] PTR (anon) type_id=188
[164] TYPEDEF __u8 type_id=165
[165] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
[166] FUNC_PROTO (anon) return=2 args=(156 ctx)
[167] FUNC incorrect_node_var_off type_id=166
[168] FUNC incorrect_node_off1 type_id=28
[169] FUNC incorrect_node_off2 type_id=28
[170] FUNC no_head_type type_id=28
[171] FUNC incorrect_head_var_off1 type_id=166
[172] FUNC incorrect_head_var_off2 type_id=166
[173] FUNC incorrect_head_off1 type_id=28
[174] FUNC incorrect_head_off2 type_id=28
[175] FUNC pop_front_off type_id=28
[176] STRUCT (anon) size=24 vlen=2
	head type_id=11 bits_offset=0
	lock type_id=8 bits_offset=128
[177] DECL_TAG contains:foo:node2 type=176 component_idx=0
[178] FUNC pop_back_off type_id=28
[179] VAR ghead type_id=11 linkage=0
[180] DECL_TAG contains:foo:node2 type=179 component_idx=-1
[181] VAR glock2 type_id=8 linkage=0
[182] VAR glock type_id=8 linkage=0
[183] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
[184] ARRAY (anon) type_id=183 index_type_id=4 nr_elems=4
[185] VAR _license type_id=184 linkage=1
[186] FWD bpf_flow_keys struct
[187] FWD test2 struct
[188] FWD bpf_sock struct
[189] DATASEC .maps size=104 vlen=3
	 type_id=19 offset=0 size=32
	 type_id=25 offset=32 size=40
	 type_id=26 offset=72 size=32
[190] DATASEC .bss.A size=20 vlen=2
	 type_id=179 offset=0 size=16
	 type_id=182 offset=16 size=4
[191] DATASEC .bss.B size=4 vlen=1
	 type_id=181 offset=0 size=4
[192] DATASEC license size=4 vlen=1
	 type_id=185 offset=0 size=4
[193] DATASEC .ksyms size=24 vlen=6
	 type_id=194 offset=0 size=4
	 type_id=194 offset=4 size=4
	 type_id=194 offset=8 size=4
	 type_id=194 offset=12 size=4
	 type_id=194 offset=16 size=4
	 type_id=194 offset=20 size=4
[194] VAR dummy_ksym type_id=2 linkage=1

#134/86  linked_list/map_compat_raw_tp_w:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'obj_type_id_oor': BPF program load failed: unknown error (-524)
libbpf: prog 'obj_type_id_oor': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: local type ID argument must be in range [0, U32_MAX]
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/87  linked_list/obj_type_id_oor:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'obj_new_no_composite': BPF program load failed: unknown error (-524)
libbpf: prog 'obj_new_no_composite': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: bpf_obj_new/bpf_percpu_obj_new type ID argument must be of a struct
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/88  linked_list/obj_new_no_composite:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'obj_new_no_struct': BPF program load failed: unknown error (-524)
libbpf: prog 'obj_new_no_struct': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: bpf_obj_new/bpf_percpu_obj_new type ID argument must be of a struct
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/89  linked_list/obj_new_no_struct:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'obj_drop_non_zero_off': BPF program load failed: unknown error (-524)
libbpf: prog 'obj_drop_non_zero_off': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: R1 must have zero offset when passed to release func
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/90  linked_list/obj_drop_non_zero_off:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'new_null_ret': BPF program load failed: unknown error (-524)
libbpf: prog 'new_null_ret': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: R0 invalid mem access 'ptr_or_null_'
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/91  linked_list/new_null_ret:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'obj_new_acq': BPF program load failed: unknown error (-524)
libbpf: prog 'obj_new_acq': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: Unreleased reference id=
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/92  linked_list/obj_new_acq:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'use_after_drop': BPF program load failed: unknown error (-524)
libbpf: prog 'use_after_drop': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: invalid mem access 'scalar'
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/93  linked_list/use_after_drop:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'ptr_walk_scalar': BPF program load failed: unknown error (-524)
libbpf: prog 'ptr_walk_scalar': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: type=scalar expected=percpu_ptr_
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/94  linked_list/ptr_walk_scalar:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'direct_read_lock': BPF program load failed: unknown error (-524)
libbpf: prog 'direct_read_lock': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: direct access to bpf_spin_lock is disallowed
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/95  linked_list/direct_read_lock:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'direct_write_lock': BPF program load failed: unknown error (-524)
libbpf: prog 'direct_write_lock': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: direct access to bpf_spin_lock is disallowed
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/96  linked_list/direct_write_lock:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'direct_read_head': BPF program load failed: unknown error (-524)
libbpf: prog 'direct_read_head': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: direct access to bpf_list_head is disallowed
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/97  linked_list/direct_read_head:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'direct_write_head': BPF program load failed: unknown error (-524)
libbpf: prog 'direct_write_head': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: direct access to bpf_list_head is disallowed
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/98  linked_list/direct_write_head:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'direct_read_node': BPF program load failed: unknown error (-524)
libbpf: prog 'direct_read_node': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: direct access to bpf_list_node is disallowed
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/99  linked_list/direct_read_node:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'direct_write_node': BPF program load failed: unknown error (-524)
libbpf: prog 'direct_write_node': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: direct access to bpf_list_node is disallowed
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/100 linked_list/direct_write_node:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'use_after_unlock_push_front': BPF program load failed: unknown error (-524)
libbpf: prog 'use_after_unlock_push_front': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: invalid mem access 'scalar'
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/101 linked_list/use_after_unlock_push_front:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'use_after_unlock_push_back': BPF program load failed: unknown error (-524)
libbpf: prog 'use_after_unlock_push_back': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: invalid mem access 'scalar'
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/102 linked_list/use_after_unlock_push_back:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'double_push_front': BPF program load failed: unknown error (-524)
libbpf: prog 'double_push_front': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: arg#1 expected pointer to allocated object
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/103 linked_list/double_push_front:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'double_push_back': BPF program load failed: unknown error (-524)
libbpf: prog 'double_push_back': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: arg#1 expected pointer to allocated object
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/104 linked_list/double_push_back:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'no_node_value_type': BPF program load failed: unknown error (-524)
libbpf: prog 'no_node_value_type': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: bpf_list_node not found at offset=0
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/105 linked_list/no_node_value_type:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'incorrect_value_type': BPF program load failed: unknown error (-524)
libbpf: prog 'incorrect_value_type': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: operation on bpf_list_head expects arg#1 bpf_list_node at offset=48 in struct foo, but arg is at offset=0 in struct bar
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/106 linked_list/incorrect_value_type:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'incorrect_node_var_off': BPF program load failed: unknown error (-524)
libbpf: prog 'incorrect_node_var_off': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: variable ptr_ access var_off=(0x0; 0xffffffff) disallowed
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/107 linked_list/incorrect_node_var_off:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'incorrect_node_off1': BPF program load failed: unknown error (-524)
libbpf: prog 'incorrect_node_off1': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: bpf_list_node not found at offset=49
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/108 linked_list/incorrect_node_off1:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'incorrect_node_off2': BPF program load failed: unknown error (-524)
libbpf: prog 'incorrect_node_off2': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: arg#1 offset=0, but expected bpf_list_node at offset=48 in struct foo
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/109 linked_list/incorrect_node_off2:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'no_head_type': BPF program load failed: unknown error (-524)
libbpf: prog 'no_head_type': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: bpf_list_head not found at offset=0
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/110 linked_list/no_head_type:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'incorrect_head_var_off1': BPF program load failed: unknown error (-524)
libbpf: prog 'incorrect_head_var_off1': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: R1 doesn't have constant offset
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/111 linked_list/incorrect_head_var_off1:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'incorrect_head_var_off2': BPF program load failed: unknown error (-524)
libbpf: prog 'incorrect_head_var_off2': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: variable ptr_ access var_off=(0x0; 0xffffffff) disallowed
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/112 linked_list/incorrect_head_var_off2:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'incorrect_head_off1': BPF program load failed: unknown error (-524)
libbpf: prog 'incorrect_head_off1': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: bpf_list_head not found at offset=25
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/113 linked_list/incorrect_head_off1:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'incorrect_head_off2': BPF program load failed: unknown error (-524)
libbpf: prog 'incorrect_head_off2': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: bpf_list_head not found at offset=1
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/114 linked_list/incorrect_head_off2:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'pop_front_off': BPF program load failed: unknown error (-524)
libbpf: prog 'pop_front_off': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: off 48 doesn't point to 'struct bpf_spin_lock' that is at 40
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/115 linked_list/pop_front_off:FAIL
test_linked_list_fail_prog:PASS:linked_list_fail__open_opts 0 nsec
test_linked_list_fail_prog:PASS:bpf_object__find_program_by_name 0 nsec
libbpf: prog 'pop_back_off': BPF program load failed: unknown error (-524)
libbpf: prog 'pop_back_off': failed to load: -524
libbpf: failed to load object 'linked_list_fail'
libbpf: failed to load BPF skeleton 'linked_list_fail': -524
test_linked_list_fail_prog:PASS:linked_list_fail__load must fail 0 nsec
test_linked_list_fail_prog:FAIL:expected error message unexpected error: -524
Expected: off 48 doesn't point to 'struct bpf_spin_lock' that is at 40
Verifier: JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

#134/116 linked_list/pop_back_off:FAIL
init_btf:PASS:btf__new_empty 0 nsec
init_btf:PASS:btf__add_int 0 nsec
init_btf:PASS:btf__add_struct bpf_spin_lock 0 nsec
init_btf:PASS:btf__add_struct bpf_list_head 0 nsec
init_btf:PASS:btf__add_struct bpf_list_node 0 nsec
test_btf:PASS:init_btf 0 nsec
test_btf:PASS:btf__add_struct foo 0 nsec
test_btf:PASS:btf__add_struct foo::a 0 nsec
test_btf:PASS:btf__add_struct foo::a 0 nsec
test_btf:PASS:btf__add_struct foo::a 0 nsec
libbpf: BTF loading error: -7
libbpf: -- BEGIN BTF LOAD LOG ---
magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 100
str_off: 100
str_len: 57
btf_total_size: 181
[1] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[2] STRUCT bpf_spin_lock size=4 vlen=0
[3] STRUCT bpf_list_head size=16 vlen=0
[4] STRUCT bpf_list_node size=24 vlen=0
[5] STRUCT foo size=24 vlen=3
	a type_id=2 bits_offset=0
	b type_id=2 bits_offset=32
	c type_id=3 bits_offset=64

-- END BTF LOAD LOG --
test_btf:PASS:check btf 0 nsec
#134/117 linked_list/btf: too many locks:OK
init_btf:PASS:btf__new_empty 0 nsec
init_btf:PASS:btf__add_int 0 nsec
init_btf:PASS:btf__add_struct bpf_spin_lock 0 nsec
init_btf:PASS:btf__add_struct bpf_list_head 0 nsec
init_btf:PASS:btf__add_struct bpf_list_node 0 nsec
test_btf:PASS:init_btf 0 nsec
test_btf:PASS:btf__add_struct foo 0 nsec
test_btf:PASS:btf__add_struct foo::a 0 nsec
test_btf:PASS:btf__add_decl_tag contains:baz:a 0 nsec
test_btf:PASS:btf__add_struct baz 0 nsec
test_btf:PASS:btf__add_field baz::a 0 nsec
libbpf: BTF loading error: -22
libbpf: -- BEGIN BTF LOAD LOG ---
magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 116
str_off: 116
str_len: 72
btf_total_size: 212
[1] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[2] STRUCT bpf_spin_lock size=4 vlen=0
[3] STRUCT bpf_list_head size=16 vlen=0
[4] STRUCT bpf_list_node size=24 vlen=0
[5] STRUCT foo size=16 vlen=1
	a type_id=3 bits_offset=0
[6] DECL_TAG contains:baz:a type=5 component_idx=0
[7] STRUCT baz size=16 vlen=1
	a type_id=4 bits_offset=0
[7] STRUCT baz size=16 vlen=1
	a type_id=4 bits_offset=0 Member exceeds struct_size

-- END BTF LOAD LOG --
test_btf:PASS:check btf 0 nsec
#134/118 linked_list/btf: missing lock:OK
init_btf:PASS:btf__new_empty 0 nsec
init_btf:PASS:btf__add_int 0 nsec
init_btf:PASS:btf__add_struct bpf_spin_lock 0 nsec
init_btf:PASS:btf__add_struct bpf_list_head 0 nsec
init_btf:PASS:btf__add_struct bpf_list_node 0 nsec
test_btf:PASS:init_btf 0 nsec
test_btf:PASS:btf__add_struct foo 0 nsec
test_btf:PASS:btf__add_field foo::a 0 nsec
test_btf:PASS:btf__add_field foo::b 0 nsec
test_btf:PASS:btf__add_field foo::c 0 nsec
test_btf:PASS:btf__add_decl_tag contains:foo:b 0 nsec
libbpf: BTF loading error: -17
libbpf: -- BEGIN BTF LOAD LOG ---
magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 116
str_off: 116
str_len: 72
btf_total_size: 212
[1] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[2] STRUCT bpf_spin_lock size=4 vlen=0
[3] STRUCT bpf_list_head size=16 vlen=0
[4] STRUCT bpf_list_node size=24 vlen=0
[5] STRUCT foo size=36 vlen=3
	a type_id=3 bits_offset=0
	b type_id=4 bits_offset=0
	c type_id=2 bits_offset=0
[6] DECL_TAG contains:foo:b type=5 component_idx=0

-- END BTF LOAD LOG --
test_btf:PASS:check btf 0 nsec
#134/119 linked_list/btf: bad offset:OK
init_btf:PASS:btf__new_empty 0 nsec
init_btf:PASS:btf__add_int 0 nsec
init_btf:PASS:btf__add_struct bpf_spin_lock 0 nsec
init_btf:PASS:btf__add_struct bpf_list_head 0 nsec
init_btf:PASS:btf__add_struct bpf_list_node 0 nsec
test_btf:PASS:init_btf 0 nsec
test_btf:PASS:btf__add_struct foo 0 nsec
test_btf:PASS:btf__add_field foo::a 0 nsec
test_btf:PASS:btf__add_field foo::b 0 nsec
libbpf: BTF loading error: -22
libbpf: -- BEGIN BTF LOAD LOG ---
magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 88
str_off: 88
str_len: 55
btf_total_size: 167
[1] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[2] STRUCT bpf_spin_lock size=4 vlen=0
[3] STRUCT bpf_list_head size=16 vlen=0
[4] STRUCT bpf_list_node size=24 vlen=0
[5] STRUCT foo size=24 vlen=2
	a type_id=2 bits_offset=0
	b type_id=3 bits_offset=64

-- END BTF LOAD LOG --
test_btf:PASS:check btf 0 nsec
#134/120 linked_list/btf: missing contains::OK
init_btf:PASS:btf__new_empty 0 nsec
init_btf:PASS:btf__add_int 0 nsec
init_btf:PASS:btf__add_struct bpf_spin_lock 0 nsec
init_btf:PASS:btf__add_struct bpf_list_head 0 nsec
init_btf:PASS:btf__add_struct bpf_list_node 0 nsec
test_btf:PASS:init_btf 0 nsec
test_btf:PASS:btf__add_struct foo 0 nsec
test_btf:PASS:btf__add_field foo::a 0 nsec
test_btf:PASS:btf__add_field foo::b 0 nsec
test_btf:PASS:btf__add_decl_tag contains:bar:bar 0 nsec
libbpf: BTF loading error: -2
libbpf: -- BEGIN BTF LOAD LOG ---
magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 104
str_off: 104
str_len: 72
btf_total_size: 200
[1] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[2] STRUCT bpf_spin_lock size=4 vlen=0
[3] STRUCT bpf_list_head size=16 vlen=0
[4] STRUCT bpf_list_node size=24 vlen=0
[5] STRUCT foo size=24 vlen=2
	a type_id=2 bits_offset=0
	b type_id=3 bits_offset=64
[6] DECL_TAG contains:bar:bar type=5 component_idx=1

-- END BTF LOAD LOG --
test_btf:PASS:check btf 0 nsec
#134/121 linked_list/btf: missing struct:OK
init_btf:PASS:btf__new_empty 0 nsec
init_btf:PASS:btf__add_int 0 nsec
init_btf:PASS:btf__add_struct bpf_spin_lock 0 nsec
init_btf:PASS:btf__add_struct bpf_list_head 0 nsec
init_btf:PASS:btf__add_struct bpf_list_node 0 nsec
test_btf:PASS:init_btf 0 nsec
test_btf:PASS:btf__add_struct foo 0 nsec
test_btf:PASS:btf__add_field foo::a 0 nsec
test_btf:PASS:btf__add_field foo::b 0 nsec
test_btf:PASS:btf__add_decl_tag contains:foo:c 0 nsec
libbpf: BTF loading error: -2
libbpf: -- BEGIN BTF LOAD LOG ---
magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 104
str_off: 104
str_len: 70
btf_total_size: 198
[1] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[2] STRUCT bpf_spin_lock size=4 vlen=0
[3] STRUCT bpf_list_head size=16 vlen=0
[4] STRUCT bpf_list_node size=24 vlen=0
[5] STRUCT foo size=24 vlen=2
	a type_id=2 bits_offset=0
	b type_id=3 bits_offset=64
[6] DECL_TAG contains:foo:c type=5 component_idx=1

-- END BTF LOAD LOG --
test_btf:PASS:check btf 0 nsec
#134/122 linked_list/btf: missing node:OK
init_btf:PASS:btf__new_empty 0 nsec
init_btf:PASS:btf__add_int 0 nsec
init_btf:PASS:btf__add_struct bpf_spin_lock 0 nsec
init_btf:PASS:btf__add_struct bpf_list_head 0 nsec
init_btf:PASS:btf__add_struct bpf_list_node 0 nsec
test_btf:PASS:init_btf 0 nsec
test_btf:PASS:btf__add_struct foo 0 nsec
test_btf:PASS:btf__add_field foo::a 0 nsec
test_btf:PASS:btf__add_field foo::b 0 nsec
test_btf:PASS:btf__add_decl_tag contains:bar:a 0 nsec
test_btf:PASS:btf__add_struct bar 0 nsec
test_btf:PASS:btf__add_field bar::a 0 nsec
libbpf: BTF loading error: -22
libbpf: -- BEGIN BTF LOAD LOG ---
magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 128
str_off: 128
str_len: 74
btf_total_size: 226
[1] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[2] STRUCT bpf_spin_lock size=4 vlen=0
[3] STRUCT bpf_list_head size=16 vlen=0
[4] STRUCT bpf_list_node size=24 vlen=0
[5] STRUCT foo size=20 vlen=2
	a type_id=3 bits_offset=0
	b type_id=2 bits_offset=128
[6] DECL_TAG contains:bar:a type=5 component_idx=0
[7] STRUCT bar size=4 vlen=1
	a type_id=2 bits_offset=0

-- END BTF LOAD LOG --
test_btf:PASS:check btf 0 nsec
#134/123 linked_list/btf: node incorrect type:OK
init_btf:PASS:btf__new_empty 0 nsec
init_btf:PASS:btf__add_int 0 nsec
init_btf:PASS:btf__add_struct bpf_spin_lock 0 nsec
init_btf:PASS:btf__add_struct bpf_list_head 0 nsec
init_btf:PASS:btf__add_struct bpf_list_node 0 nsec
test_btf:PASS:init_btf 0 nsec
test_btf:PASS:btf__add_struct foo 0 nsec
test_btf:PASS:btf__add_field foo::a 0 nsec
test_btf:PASS:btf__add_field foo::b 0 nsec
test_btf:PASS:btf__add_field foo::c 0 nsec
test_btf:PASS:btf__add_field foo::d 0 nsec
test_btf:PASS:btf__add_decl_tag contains:foo:b 0 nsec
libbpf: BTF loading error: -22
libbpf: -- BEGIN BTF LOAD LOG ---
magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 128
str_off: 128
str_len: 72
btf_total_size: 224
[1] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[2] STRUCT bpf_spin_lock size=4 vlen=0
[3] STRUCT bpf_list_head size=16 vlen=0
[4] STRUCT bpf_list_node size=24 vlen=0
[5] STRUCT foo size=52 vlen=4
	a type_id=3 bits_offset=0
	b type_id=4 bits_offset=128
	b type_id=4 bits_offset=256
	d type_id=2 bits_offset=384
[6] DECL_TAG contains:foo:b type=5 component_idx=0
[5] STRUCT foo size=52 vlen=4
	b type_id=4 bits_offset=256 Member exceeds struct_size

-- END BTF LOAD LOG --
test_btf:PASS:check btf 0 nsec
#134/124 linked_list/btf: multiple bpf_list_node with name b:OK
init_btf:PASS:btf__new_empty 0 nsec
init_btf:PASS:btf__add_int 0 nsec
init_btf:PASS:btf__add_struct bpf_spin_lock 0 nsec
init_btf:PASS:btf__add_struct bpf_list_head 0 nsec
init_btf:PASS:btf__add_struct bpf_list_node 0 nsec
test_btf:PASS:init_btf 0 nsec
test_btf:PASS:btf__add_struct foo 0 nsec
test_btf:PASS:btf__add_field foo::a 0 nsec
test_btf:PASS:btf__add_field foo::b 0 nsec
test_btf:PASS:btf__add_field foo::c 0 nsec
test_btf:PASS:btf__add_decl_tag contains:foo:b 0 nsec
libbpf: BTF loading error: -40
libbpf: -- BEGIN BTF LOAD LOG ---
magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 116
str_off: 116
str_len: 72
btf_total_size: 212
[1] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[2] STRUCT bpf_spin_lock size=4 vlen=0
[3] STRUCT bpf_list_head size=16 vlen=0
[4] STRUCT bpf_list_node size=24 vlen=0
[5] STRUCT foo size=44 vlen=3
	a type_id=3 bits_offset=0
	b type_id=4 bits_offset=128
	c type_id=2 bits_offset=320
[6] DECL_TAG contains:foo:b type=5 component_idx=0

-- END BTF LOAD LOG --
test_btf:PASS:check btf 0 nsec
#134/125 linked_list/btf: owning | owned AA cycle:OK
init_btf:PASS:btf__new_empty 0 nsec
init_btf:PASS:btf__add_int 0 nsec
init_btf:PASS:btf__add_struct bpf_spin_lock 0 nsec
init_btf:PASS:btf__add_struct bpf_list_head 0 nsec
init_btf:PASS:btf__add_struct bpf_list_node 0 nsec
test_btf:PASS:init_btf 0 nsec
test_btf:PASS:btf__add_struct foo 0 nsec
test_btf:PASS:btf__add_field foo::a 0 nsec
test_btf:PASS:btf__add_field foo::b 0 nsec
test_btf:PASS:btf__add_field foo::c 0 nsec
test_btf:PASS:btf__add_decl_tag contains:bar:b 0 nsec
test_btf:PASS:btf__add_struct bar 0 nsec
test_btf:PASS:btf__add_field bar::a 0 nsec
test_btf:PASS:btf__add_field bar::b 0 nsec
test_btf:PASS:btf__add_field bar::c 0 nsec
test_btf:PASS:btf__add_decl_tag contains:foo:b 0 nsec
libbpf: BTF loading error: -40
libbpf: -- BEGIN BTF LOAD LOG ---
magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 180
str_off: 180
str_len: 91
btf_total_size: 295
[1] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[2] STRUCT bpf_spin_lock size=4 vlen=0
[3] STRUCT bpf_list_head size=16 vlen=0
[4] STRUCT bpf_list_node size=24 vlen=0
[5] STRUCT foo size=44 vlen=3
	a type_id=3 bits_offset=0
	b type_id=4 bits_offset=128
	c type_id=2 bits_offset=320
[6] DECL_TAG contains:bar:b type=5 component_idx=0
[7] STRUCT bar size=44 vlen=3
	a type_id=3 bits_offset=0
	b type_id=4 bits_offset=128
	c type_id=2 bits_offset=320
[8] DECL_TAG contains:foo:b type=7 component_idx=0

-- END BTF LOAD LOG --
test_btf:PASS:check btf 0 nsec
#134/126 linked_list/btf: owning | owned ABA cycle:OK
init_btf:PASS:btf__new_empty 0 nsec
init_btf:PASS:btf__add_int 0 nsec
init_btf:PASS:btf__add_struct bpf_spin_lock 0 nsec
init_btf:PASS:btf__add_struct bpf_list_head 0 nsec
init_btf:PASS:btf__add_struct bpf_list_node 0 nsec
test_btf:PASS:init_btf 0 nsec
test_btf:PASS:btf__add_struct foo 0 nsec
test_btf:PASS:btf__add_field foo::a 0 nsec
test_btf:PASS:btf__add_field foo::b 0 nsec
test_btf:PASS:btf__add_decl_tag contains:bar:a 0 nsec
test_btf:PASS:btf__add_struct bar 0 nsec
test_btf:PASS:btf__add_field bar::a 0 nsec
test_btf:PASS:check btf 0 nsec
#134/127 linked_list/btf: owning -> owned:OK
init_btf:PASS:btf__new_empty 0 nsec
init_btf:PASS:btf__add_int 0 nsec
init_btf:PASS:btf__add_struct bpf_spin_lock 0 nsec
init_btf:PASS:btf__add_struct bpf_list_head 0 nsec
init_btf:PASS:btf__add_struct bpf_list_node 0 nsec
test_btf:PASS:init_btf 0 nsec
test_btf:PASS:btf__add_struct foo 0 nsec
test_btf:PASS:btf__add_field foo::a 0 nsec
test_btf:PASS:btf__add_field foo::b 0 nsec
test_btf:PASS:btf__add_decl_tag contains:bar:b 0 nsec
test_btf:PASS:btf__add_struct bar 0 nsec
test_btf:PASS:btf__add_field bar::a 0 nsec
test_btf:PASS:btf__add_field bar::b 0 nsec
test_btf:PASS:btf__add_field bar::c 0 nsec
test_btf:PASS:btf__add_decl_tag contains:baz:a 0 nsec
test_btf:PASS:btf__add_struct baz 0 nsec
test_btf:PASS:btf__add_field baz:a 0 nsec
test_btf:PASS:check btf 0 nsec
#134/128 linked_list/btf: owning -> owning | owned -> owned:OK
init_btf:PASS:btf__new_empty 0 nsec
init_btf:PASS:btf__add_int 0 nsec
init_btf:PASS:btf__add_struct bpf_spin_lock 0 nsec
init_btf:PASS:btf__add_struct bpf_list_head 0 nsec
init_btf:PASS:btf__add_struct bpf_list_node 0 nsec
test_btf:PASS:init_btf 0 nsec
test_btf:PASS:btf__add_struct foo 0 nsec
test_btf:PASS:btf__add_field foo::a 0 nsec
test_btf:PASS:btf__add_field foo::b 0 nsec
test_btf:PASS:btf__add_field foo::c 0 nsec
test_btf:PASS:btf__add_decl_tag contains:bar:b 0 nsec
test_btf:PASS:btf__add_struct bar 0 nsec
test_btf:PASS:btf__add_field bar:a 0 nsec
test_btf:PASS:btf__add_field bar:b 0 nsec
test_btf:PASS:btf__add_field bar:c 0 nsec
test_btf:PASS:btf__add_decl_tag contains:baz:a 0 nsec
test_btf:PASS:btf__add_struct baz 0 nsec
test_btf:PASS:btf__add_field baz:a 0 nsec
libbpf: BTF loading error: -40
libbpf: -- BEGIN BTF LOAD LOG ---
magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 204
str_off: 204
str_len: 95
btf_total_size: 323
[1] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[2] STRUCT bpf_spin_lock size=4 vlen=0
[3] STRUCT bpf_list_head size=16 vlen=0
[4] STRUCT bpf_list_node size=24 vlen=0
[5] STRUCT foo size=44 vlen=3
	a type_id=3 bits_offset=0
	b type_id=4 bits_offset=128
	c type_id=2 bits_offset=320
[6] DECL_TAG contains:bar:b type=5 component_idx=0
[7] STRUCT bar size=44 vlen=3
	a type_id=3 bits_offset=0
	b type_id=4 bits_offset=128
	c type_id=2 bits_offset=320
[8] DECL_TAG contains:baz:a type=7 component_idx=0
[9] STRUCT baz size=24 vlen=1
	a type_id=4 bits_offset=0

-- END BTF LOAD LOG --
test_btf:PASS:check btf 0 nsec
#134/129 linked_list/btf: owning | owned -> owning | owned -> owned:OK
init_btf:PASS:btf__new_empty 0 nsec
init_btf:PASS:btf__add_int 0 nsec
init_btf:PASS:btf__add_struct bpf_spin_lock 0 nsec
init_btf:PASS:btf__add_struct bpf_list_head 0 nsec
init_btf:PASS:btf__add_struct bpf_list_node 0 nsec
test_btf:PASS:init_btf 0 nsec
test_btf:PASS:btf__add_struct foo 0 nsec
test_btf:PASS:btf__add_field foo::a 0 nsec
test_btf:PASS:btf__add_field foo::b 0 nsec
test_btf:PASS:btf__add_decl_tag contains:bar:b 0 nsec
test_btf:PASS:btf__add_struct bar 0 nsec
test_btf:PASS:btf__add_field bar::a 0 nsec
test_btf:PASS:btf__add_field bar::b 0 nsec
test_btf:PASS:btf__add_field bar::c 0 nsec
test_btf:PASS:btf__add_decl_tag 0 nsec
test_btf:PASS:btf__add_struct baz 0 nsec
test_btf:PASS:btf__add_field bar::a 0 nsec
test_btf:PASS:btf__add_field bar::b 0 nsec
test_btf:PASS:btf__add_field bar::c 0 nsec
test_btf:PASS:btf__add_decl_tag contains:bam:a 0 nsec
test_btf:PASS:btf__add_struct bam 0 nsec
test_btf:PASS:btf__add_field bam::a 0 nsec
libbpf: BTF loading error: -40
libbpf: -- BEGIN BTF LOAD LOG ---
magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 256
str_off: 256
str_len: 114
btf_total_size: 394
[1] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[2] STRUCT bpf_spin_lock size=4 vlen=0
[3] STRUCT bpf_list_head size=16 vlen=0
[4] STRUCT bpf_list_node size=24 vlen=0
[5] STRUCT foo size=20 vlen=2
	a type_id=3 bits_offset=0
	b type_id=2 bits_offset=128
[6] DECL_TAG contains:bar:b type=5 component_idx=0
[7] STRUCT bar size=44 vlen=3
	a type_id=3 bits_offset=0
	b type_id=4 bits_offset=128
	c type_id=2 bits_offset=320
[8] DECL_TAG contains:baz:b type=7 component_idx=0
[9] STRUCT baz size=44 vlen=3
	a type_id=3 bits_offset=0
	b type_id=4 bits_offset=128
	c type_id=2 bits_offset=320
[10] DECL_TAG contains:bam:a type=9 component_idx=0
[11] STRUCT bam size=24 vlen=1
	a type_id=4 bits_offset=0

-- END BTF LOAD LOG --
test_btf:PASS:check btf 0 nsec
#134/130 linked_list/btf: owning -> owning | owned -> owning | owned -> owned:OK
init_btf:PASS:btf__new_empty 0 nsec
init_btf:PASS:btf__add_int 0 nsec
init_btf:PASS:btf__add_struct bpf_spin_lock 0 nsec
init_btf:PASS:btf__add_struct bpf_list_head 0 nsec
init_btf:PASS:btf__add_struct bpf_list_node 0 nsec
list_and_rb_node_same_struct:PASS:init_btf 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_struct bpf_rb_node 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_struct bpf_refcount 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_struct bar 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_field bar::a 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_field bar::c 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_field bar::ref 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_struct foo 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_field foo::a 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_field foo::b 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_decl_tag contains:bar:a 0 nsec
list_and_rb_node_same_struct:PASS:check btf 0 nsec
#134/131 linked_list/btf: list_node and rb_node in same struct:OK
init_btf:PASS:btf__new_empty 0 nsec
init_btf:PASS:btf__add_int 0 nsec
init_btf:PASS:btf__add_struct bpf_spin_lock 0 nsec
init_btf:PASS:btf__add_struct bpf_list_head 0 nsec
init_btf:PASS:btf__add_struct bpf_list_node 0 nsec
list_and_rb_node_same_struct:PASS:init_btf 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_struct bpf_rb_node 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_struct bar 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_field bar::a 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_field bar::c 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_struct foo 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_field foo::a 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_field foo::b 0 nsec
list_and_rb_node_same_struct:PASS:btf__add_decl_tag contains:bar:a 0 nsec
libbpf: BTF loading error: -22
libbpf: -- BEGIN BTF LOAD LOG ---
magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 152
str_off: 152
str_len: 88
btf_total_size: 264
[1] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[2] STRUCT bpf_spin_lock size=4 vlen=0
[3] STRUCT bpf_list_head size=16 vlen=0
[4] STRUCT bpf_list_node size=24 vlen=0
[5] STRUCT bpf_rb_node size=32 vlen=0
[6] STRUCT bar size=56 vlen=2
	a type_id=4 bits_offset=0
	c type_id=5 bits_offset=192
[7] STRUCT foo size=20 vlen=2
	a type_id=3 bits_offset=0
	b type_id=2 bits_offset=128
[8] DECL_TAG contains:bar:a type=7 component_idx=0

-- END BTF LOAD LOG --
list_and_rb_node_same_struct:PASS:check btf 0 nsec
libbpf: prog 'map_list_push_pop': BPF program load failed: unknown error (-524)
libbpf: prog 'map_list_push_pop': -- BEGIN PROG LOAD LOG --
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
-- END PROG LOAD LOG --
libbpf: prog 'map_list_push_pop': failed to load: -524
libbpf: failed to load object 'linked_list'
libbpf: failed to load BPF skeleton 'linked_list': -524
test_linked_list_success:FAIL:linked_list__open_and_load unexpected error: -524
libbpf: prog 'map_list_push_pop': BPF program load failed: unknown error (-524)
libbpf: prog 'map_list_push_pop': -- BEGIN PROG LOAD LOG --
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
-- END PROG LOAD LOG --
libbpf: prog 'map_list_push_pop': failed to load: -524
libbpf: failed to load object 'linked_list'
libbpf: failed to load BPF skeleton 'linked_list': -524
test_linked_list_success:FAIL:linked_list__open_and_load unexpected error: -524
libbpf: prog 'map_list_push_pop': BPF program load failed: unknown error (-524)
libbpf: prog 'map_list_push_pop': -- BEGIN PROG LOAD LOG --
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
-- END PROG LOAD LOG --
libbpf: prog 'map_list_push_pop': failed to load: -524
libbpf: failed to load object 'linked_list'
libbpf: failed to load BPF skeleton 'linked_list': -524
test_linked_list_success:FAIL:linked_list__open_and_load unexpected error: -524
libbpf: prog 'map_list_push_pop': BPF program load failed: unknown error (-524)
libbpf: prog 'map_list_push_pop': -- BEGIN PROG LOAD LOG --
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
-- END PROG LOAD LOG --
libbpf: prog 'map_list_push_pop': failed to load: -524
libbpf: failed to load object 'linked_list'
libbpf: failed to load BPF skeleton 'linked_list': -524
test_linked_list_success:FAIL:linked_list__open_and_load unexpected error: -524
libbpf: prog 'map_list_push_pop': BPF program load failed: unknown error (-524)
libbpf: prog 'map_list_push_pop': -- BEGIN PROG LOAD LOG --
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
-- END PROG LOAD LOG --
libbpf: prog 'map_list_push_pop': failed to load: -524
libbpf: failed to load object 'linked_list'
libbpf: failed to load BPF skeleton 'linked_list': -524
test_linked_list_success:FAIL:linked_list__open_and_load unexpected error: -524
libbpf: prog 'map_list_push_pop': BPF program load failed: unknown error (-524)
libbpf: prog 'map_list_push_pop': -- BEGIN PROG LOAD LOG --
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
-- END PROG LOAD LOG --
libbpf: prog 'map_list_push_pop': failed to load: -524
libbpf: failed to load object 'linked_list'
libbpf: failed to load BPF skeleton 'linked_list': -524
test_linked_list_success:FAIL:linked_list__open_and_load unexpected error: -524
libbpf: prog 'map_list_push_pop': BPF program load failed: unknown error (-524)
libbpf: prog 'map_list_push_pop': -- BEGIN PROG LOAD LOG --
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
-- END PROG LOAD LOG --
libbpf: prog 'map_list_push_pop': failed to load: -524
libbpf: failed to load object 'linked_list'
libbpf: failed to load BPF skeleton 'linked_list': -524
test_linked_list_success:FAIL:linked_list__open_and_load unexpected error: -524
#134/132 linked_list/btf: list_node and rb_node in same struct, no bpf_refcount:FAIL
#134     linked_list:FAIL
libbpf: prog 'handler_enter1': BPF program load failed: Invalid argument
libbpf: prog 'handler_enter1': failed to load: -22
libbpf: failed to load object 'linked_maps'
libbpf: failed to load BPF skeleton 'linked_maps': -22
test_linked_maps:FAIL:skel_open unexpected error: -22
#135     linked_maps:FAIL
test_linked_vars:PASS:skel_open 0 nsec
libbpf: prog 'handler1': BPF program load failed: Invalid argument
libbpf: prog 'handler1': failed to load: -22
libbpf: failed to load object 'linked_vars'
libbpf: failed to load BPF skeleton 'linked_vars': -22
test_linked_vars:FAIL:skel_load unexpected error: -22 (errno 22)
#136     linked_vars:FAIL
test_load_bytes_relative:PASS:bpf 0 nsec
#137     load_bytes_relative:OK
libbpf: prog 'stash_rb_nodes': BPF program load failed: unknown error (-524)
libbpf: prog 'stash_rb_nodes': -- BEGIN PROG LOAD LOG --
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
-- END PROG LOAD LOG --
libbpf: prog 'stash_rb_nodes': failed to load: -524
libbpf: failed to load object 'local_kptr_stash'
libbpf: failed to load BPF skeleton 'local_kptr_stash': -524
test_local_kptr_stash_simple:FAIL:local_kptr_stash__open_and_load unexpected error: -524
#138/1   local_kptr_stash/local_kptr_stash_simple:FAIL
libbpf: prog 'stash_rb_nodes': BPF program load failed: unknown error (-524)
libbpf: prog 'stash_rb_nodes': -- BEGIN PROG LOAD LOG --
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
-- END PROG LOAD LOG --
libbpf: prog 'stash_rb_nodes': failed to load: -524
libbpf: failed to load object 'local_kptr_stash'
libbpf: failed to load BPF skeleton 'local_kptr_stash': -524
test_local_kptr_stash_plain:FAIL:local_kptr_stash__open_and_load unexpected error: -524
#138/2   local_kptr_stash/local_kptr_stash_plain:FAIL
libbpf: prog 'stash_rb_nodes': BPF program load failed: unknown error (-524)
libbpf: prog 'stash_rb_nodes': -- BEGIN PROG LOAD LOG --
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
-- END PROG LOAD LOG --
libbpf: prog 'stash_rb_nodes': failed to load: -524
libbpf: failed to load object 'local_kptr_stash'
libbpf: failed to load BPF skeleton 'local_kptr_stash': -524
test_local_kptr_stash_local_with_root:FAIL:local_kptr_stash__open_and_load unexpected error: -524
#138/3   local_kptr_stash/local_kptr_stash_local_with_root:FAIL
libbpf: prog 'stash_rb_nodes': BPF program load failed: unknown error (-524)
libbpf: prog 'stash_rb_nodes': -- BEGIN PROG LOAD LOG --
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
-- END PROG LOAD LOG --
libbpf: prog 'stash_rb_nodes': failed to load: -524
libbpf: failed to load object 'local_kptr_stash'
libbpf: failed to load BPF skeleton 'local_kptr_stash': -524
test_local_kptr_stash_unstash:FAIL:local_kptr_stash__open_and_load unexpected error: -524
#138/4   local_kptr_stash/local_kptr_stash_unstash:FAIL
libbpf: prog 'stash_rb_nodes': BPF program load failed: unknown error (-524)
libbpf: prog 'stash_rb_nodes': -- BEGIN PROG LOAD LOG --
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
-- END PROG LOAD LOG --
libbpf: prog 'stash_rb_nodes': failed to load: -524
libbpf: failed to load object 'local_kptr_stash'
libbpf: failed to load BPF skeleton 'local_kptr_stash': -524
test_refcount_acquire_without_unstash:FAIL:local_kptr_stash__open_and_load unexpected error: -524
#138/5   local_kptr_stash/refcount_acquire_without_unstash:FAIL
tester_init:PASS:tester_log_buf 0 nsec
process_subtest:PASS:obj_open_mem 0 nsec
process_subtest:PASS:specs_alloc 0 nsec
#138/6   local_kptr_stash/local_kptr_stash_fail:OK
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'stash_rb_nodes': BPF program load failed: unknown error (-524)
libbpf: prog 'stash_rb_nodes': failed to load: -524
libbpf: failed to load object 'local_kptr_stash_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'invalid kptr access, R2 type=ptr_node_data2 expected=ptr_node_data'
#138/7   local_kptr_stash/stash_rb_nodes:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'drop_rb_node_off': BPF program load failed: unknown error (-524)
libbpf: prog 'drop_rb_node_off': failed to load: -524
libbpf: failed to load object 'local_kptr_stash_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'R1 must have zero offset when passed to release func'
#138/8   local_kptr_stash/drop_rb_node_off:FAIL
#138     local_kptr_stash:FAIL
obj_load_log_buf:PASS:obj_log_buf 0 nsec
obj_load_log_buf:PASS:skel_open 0 nsec
obj_load_log_buf:PASS:unexpected_load_success 0 nsec
obj_load_log_buf:PASS:libbpf_log_error 0 nsec
obj_load_log_buf:PASS:unexp_libbpf_log 0 nsec
obj_load_log_buf:FAIL:libbpf_log_not_empty unexpected error: -22
obj_load_log_buf:PASS:obj_log_not_empty 0 nsec
obj_load_log_buf:FAIL:good_log_verbose unexpected error: -22
obj_load_log_buf:FAIL:bad_log_not_empty unexpected error: -22
LIBBPF LOG:   
=================
libbpf: loading object 'test_log_buf' from buffer
libbpf: elf: section(2) .symtab, size 192, link 1, flags 0, type=2
libbpf: elf: section(3) raw_tp/sys_enter, size 128, link 0, flags 6, type=1
libbpf: sec 'raw_tp/sys_enter': found program 'good_prog' at insn offset 0 (0 bytes), code size 5 insns (40 bytes)
libbpf: sec 'raw_tp/sys_enter': found program 'bad_prog' at insn offset 5 (40 bytes), code size 11 insns (88 bytes)
libbpf: elf: section(4) .rodata, size 4, link 0, flags 2, type=1
libbpf: elf: section(5) .bss, size 16, link 0, flags 3, type=8
libbpf: elf: section(6) license, size 4, link 0, flags 3, type=1
libbpf: license of test_log_buf is GPL
libbpf: elf: section(7) .relraw_tp/sys_enter, size 48, link 2, flags 40, type=9
libbpf: elf: section(8) .BTF, size 568, link 0, flags 0, type=1
libbpf: elf: section(9) .BTF.ext, size 168, link 0, flags 0, type=1
libbpf: looking for externs among 8 symbols...
libbpf: collected 0 externs total
libbpf: map 'test_log.rodata' (global data): at sec_idx 4, offset 0, flags 480.
libbpf: map 0 is "test_log.rodata"
libbpf: map 'test_log.bss' (global data): at sec_idx 5, offset 0, flags 400.
libbpf: map 1 is "test_log.bss"
libbpf: sec '.relraw_tp/sys_enter': collecting relocation for section(3) 'raw_tp/sys_enter'
libbpf: sec '.relraw_tp/sys_enter': relo #0: insn #0 against 'a'
libbpf: prog 'good_prog': found data map 1 (test_log.bss, sec 5, off 0) for insn 0
libbpf: sec '.relraw_tp/sys_enter': relo #1: insn #5 against 'off'
libbpf: prog 'bad_prog': found data map 0 (test_log.rodata, sec 4, off 0) for insn 0
libbpf: sec '.relraw_tp/sys_enter': relo #2: insn #11 against 'a'
libbpf: prog 'bad_prog': found data map 1 (test_log.bss, sec 5, off 0) for insn 6
libbpf: object 'test_log_buf': failed (-95) to create BPF token from '/sys/fs/bpf', skipping optional step...
libbpf: map 'test_log.rodata': created successfully, fd=19
libbpf: map 'test_log.bss': created successfully, fd=20
libbpf: prog 'good_prog': BPF program load failed: Invalid argument
libbpf: prog 'good_prog': failed to load: -22
libbpf: failed to load object 'test_log_buf'
libbpf: failed to load BPF skeleton 'test_log_buf': -22
=================
OBJ LOG:      
=================
magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 308
str_off: 308
str_len: 236
btf_total_size: 568
[1] PTR (anon) type_id=2
[2] CONST (anon) type_id=0
[3] FUNC_PROTO (anon) return=4 args=(1 ctx)
[4] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[5] FUNC good_prog type_id=3
[6] FUNC bad_prog type_id=3
[7] CONST (anon) type_id=8
[8] VOLATILE (anon) type_id=4
[9] VAR off type_id=7 linkage=1
[10] ARRAY (anon) type_id=4 index_type_id=11 nr_elems=4
[11] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
[12] VAR a type_id=10 linkage=1
[13] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
[14] ARRAY (anon) type_id=13 index_type_id=11 nr_elems=4
[15] VAR _license type_id=14 linkage=1
[16] DATASEC .rodata size=4 vlen=1
	 type_id=9 offset=0 size=4
[17] DATASEC .bss size=16 vlen=1
	 type_id=12 offset=0 size=16
[18] DATASEC license size=4 vlen=1
	 type_id=15 offset=0 size=4
=================
GOOD_PROG LOG:
=================
=================
BAD_PROG  LOG:
=================
=================
obj_load_log_buf:PASS:skel_open 0 nsec
obj_load_log_buf:PASS:unexpected_load_success 0 nsec
obj_load_log_buf:PASS:libbpf_log_error 0 nsec
obj_load_log_buf:FAIL:libbpf_log_correct unexpected error: -22
obj_load_log_buf:PASS:obj_log__empty 0 nsec
obj_load_log_buf:FAIL:good_log_ok unexpected good_log_ok: actual '' != expected 'processed 4 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
'
obj_load_log_buf:PASS:bad_log_empty 0 nsec
LIBBPF LOG:   
=================
libbpf: loading object 'test_log_buf' from buffer
libbpf: elf: section(2) .symtab, size 192, link 1, flags 0, type=2
libbpf: elf: section(3) raw_tp/sys_enter, size 128, link 0, flags 6, type=1
libbpf: sec 'raw_tp/sys_enter': found program 'good_prog' at insn offset 0 (0 bytes), code size 5 insns (40 bytes)
libbpf: sec 'raw_tp/sys_enter': found program 'bad_prog' at insn offset 5 (40 bytes), code size 11 insns (88 bytes)
libbpf: elf: section(4) .rodata, size 4, link 0, flags 2, type=1
libbpf: elf: section(5) .bss, size 16, link 0, flags 3, type=8
libbpf: elf: section(6) license, size 4, link 0, flags 3, type=1
libbpf: license of test_log_buf is GPL
libbpf: elf: section(7) .relraw_tp/sys_enter, size 48, link 2, flags 40, type=9
libbpf: elf: section(8) .BTF, size 568, link 0, flags 0, type=1
libbpf: elf: section(9) .BTF.ext, size 168, link 0, flags 0, type=1
libbpf: looking for externs among 8 symbols...
libbpf: collected 0 externs total
libbpf: map 'test_log.rodata' (global data): at sec_idx 4, offset 0, flags 480.
libbpf: map 0 is "test_log.rodata"
libbpf: map 'test_log.bss' (global data): at sec_idx 5, offset 0, flags 400.
libbpf: map 1 is "test_log.bss"
libbpf: sec '.relraw_tp/sys_enter': collecting relocation for section(3) 'raw_tp/sys_enter'
libbpf: sec '.relraw_tp/sys_enter': relo #0: insn #0 against 'a'
libbpf: prog 'good_prog': found data map 1 (test_log.bss, sec 5, off 0) for insn 0
libbpf: sec '.relraw_tp/sys_enter': relo #1: insn #5 against 'off'
libbpf: prog 'bad_prog': found data map 0 (test_log.rodata, sec 4, off 0) for insn 0
libbpf: sec '.relraw_tp/sys_enter': relo #2: insn #11 against 'a'
libbpf: prog 'bad_prog': found data map 1 (test_log.bss, sec 5, off 0) for insn 6
libbpf: object 'test_log_buf': failed (-95) to create BPF token from '/sys/fs/bpf', skipping optional step...
libbpf: map 'test_log.rodata': created successfully, fd=19
libbpf: map 'test_log.bss': created successfully, fd=20
libbpf: prog 'good_prog': BPF program load failed: Invalid argument
libbpf: prog 'good_prog': failed to load: -22
libbpf: failed to load object 'test_log_buf'
libbpf: failed to load BPF skeleton 'test_log_buf': -22
=================
OBJ LOG:      
=================
=================
GOOD_PROG LOG:
=================
=================
BAD_PROG  LOG:
=================
=================
#139/1   log_buf/obj_load_log_buf:FAIL
bpf_prog_load_log_buf:PASS:log_buf_alloc 0 nsec
bpf_prog_load_log_buf:PASS:good_log_0 0 nsec
bpf_prog_load_log_buf:PASS:good_fd1 0 nsec
bpf_prog_load_log_buf:PASS:good_log_2 0 nsec
bpf_prog_load_log_buf:PASS:good_fd2 0 nsec
bpf_prog_load_log_buf:PASS:bad_log_0 0 nsec
bpf_prog_load_log_buf:PASS:bad_fd 0 nsec
#139/2   log_buf/bpf_prog_load_log_buf:OK
bpf_btf_load_log_buf:PASS:empty_btf 0 nsec
bpf_btf_load_log_buf:PASS:int_type 0 nsec
bpf_btf_load_log_buf:PASS:raw_btf_data_good 0 nsec
bpf_btf_load_log_buf:PASS:log_buf_alloc 0 nsec
bpf_btf_load_log_buf:PASS:good_log_0 0 nsec
bpf_btf_load_log_buf:PASS:good_fd1 0 nsec
LOG_BUF: magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 16
str_off: 16
str_len: 5
btf_total_size: 45
[1] INT int size=4 bits_offset=0 nr_bits=32 encoding=(none)

bpf_btf_load_log_buf:PASS:good_log_2 0 nsec
bpf_btf_load_log_buf:PASS:good_fd2 0 nsec
bpf_btf_load_log_buf:PASS:bad_ptr_type 0 nsec
bpf_btf_load_log_buf:PASS:raw_btf_data_bad 0 nsec
LOG_BUF: magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 28
str_off: 28
str_len: 5
btf_total_size: 57
[1] INT int size=4 bits_offset=0 nr_bits=32 encoding=(none)
[2] PTR (anon) type_id=100
[2] PTR (anon) type_id=100 Invalid type_id

bpf_btf_load_log_buf:PASS:bad_log_0 0 nsec
bpf_btf_load_log_buf:PASS:bad_fd 0 nsec
#139/3   log_buf/bpf_btf_load_log_buf:OK
#139     log_buf:FAIL
bad_core_relo:PASS:skel_open 0 nsec
libbpf: prog 'bad_relo': BPF program load failed: Invalid argument
libbpf: prog 'bad_relo': failed to load: -22
libbpf: failed to load object 'test_log_fixup'
libbpf: failed to load BPF skeleton 'test_log_fixup': -22
bad_core_relo:PASS:load_fail 0 nsec
bad_core_relo:FAIL:log_buf_part1 unexpected log_buf_part1: '0: <invalid CO-RE relocation>
failed to resolve CO-RE relocation <byte_sz> ' is not a substring of ''
bad_core_relo:FAIL:log_buf_part2 unexpected log_buf_part2: 'struct task_struct___bad.fake_field (0:1 @ offset 4)
' is not a substring of ''
bad_core_relo:FAIL:log_buf_end unexpected log_buf_end: 'max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
' is not a substring of ''
LOG:   
=================
=================
#140/1   log_fixup/bad_core_relo_trunc_none:FAIL
bad_core_relo:PASS:skel_open 0 nsec
libbpf: prog 'bad_relo': BPF program load failed: Invalid argument
libbpf: prog 'bad_relo': failed to load: -22
libbpf: failed to load object 'test_log_fixup'
libbpf: failed to load BPF skeleton 'test_log_fixup': -22
bad_core_relo:PASS:load_fail 0 nsec
bad_core_relo:FAIL:log_buf_part1 unexpected log_buf_part1: '0: <invalid CO-RE relocation>
failed to resolve CO-RE relocation <byte_sz> ' is not a substring of ''
bad_core_relo:FAIL:log_buf_part2 unexpected log_buf_part2: 'struct task_struct___bad.fake_field (0:1 @ offset 4)
' is not a substring of ''
bad_core_relo:PASS:log_buf_end 0 nsec
LOG:   
=================
=================
#140/2   log_fixup/bad_core_relo_trunc_partial:FAIL
bad_core_relo:PASS:skel_open 0 nsec
libbpf: prog 'bad_relo': BPF program load failed: Invalid argument
libbpf: prog 'bad_relo': failed to load: -22
libbpf: failed to load object 'test_log_fixup'
libbpf: failed to load BPF skeleton 'test_log_fixup': -22
bad_core_relo:PASS:load_fail 0 nsec
bad_core_relo:FAIL:log_buf_part1 unexpected log_buf_part1: '0: <invalid CO-RE relocation>
failed to resolve CO-RE relocation <byte_sz> ' is not a substring of ''
bad_core_relo:PASS:log_buf_part2 0 nsec
bad_core_relo:PASS:log_buf_end 0 nsec
LOG:   
=================
=================
#140/3   log_fixup/bad_core_relo_trunc_full:FAIL
bad_core_relo_subprog:PASS:skel_open 0 nsec
libbpf: prog 'bad_relo_subprog': BPF program load failed: Invalid argument
libbpf: prog 'bad_relo_subprog': failed to load: -22
libbpf: failed to load object 'test_log_fixup'
libbpf: failed to load BPF skeleton 'test_log_fixup': -22
bad_core_relo_subprog:PASS:load_fail 0 nsec
bad_core_relo_subprog:FAIL:log_buf unexpected log_buf: ': <invalid CO-RE relocation>
failed to resolve CO-RE relocation <byte_off> ' is not a substring of ''
bad_core_relo_subprog:FAIL:log_buf unexpected log_buf: 'struct task_struct___bad.fake_field_subprog (0:2 @ offset 8)
' is not a substring of ''
LOG:   
=================
=================
#140/4   log_fixup/bad_core_relo_subprog:FAIL
missing_map:PASS:skel_open 0 nsec
libbpf: prog 'use_missing_map': BPF program load failed: Invalid argument
libbpf: prog 'use_missing_map': failed to load: -22
libbpf: failed to load object 'test_log_fixup'
libbpf: failed to load BPF skeleton 'test_log_fixup': -22
missing_map:PASS:load_fail 0 nsec
missing_map:PASS:existing_map_autocreate 0 nsec
missing_map:PASS:missing_map_autocreate 0 nsec
missing_map:FAIL:log_buf unexpected log_buf: ': <invalid BPF map reference>
BPF map 'missing_map' is referenced but wasn't created
' is not a substring of ''
LOG:   
=================
=================
#140/5   log_fixup/missing_map:FAIL
missing_kfunc:PASS:skel_open 0 nsec
libbpf: prog 'use_missing_kfunc': BPF program load failed: Invalid argument
libbpf: prog 'use_missing_kfunc': failed to load: -22
libbpf: failed to load object 'test_log_fixup'
libbpf: failed to load BPF skeleton 'test_log_fixup': -22
missing_kfunc:PASS:load_fail 0 nsec
missing_kfunc:FAIL:log_buf unexpected log_buf: '0: <invalid kfunc call>
kfunc 'bpf_nonexistent_kfunc' is referenced but wasn't resolved
' is not a substring of ''
LOG:   
=================
=================
#140/6   log_fixup/missing_kfunc:FAIL
#140     log_fixup:FAIL
setup_prog:PASS:test_lookup_and_delete__open 0 nsec
setup_prog:PASS:bpf_map__set_type 0 nsec
setup_prog:PASS:bpf_map__set_max_entries 0 nsec
libbpf: prog 'bpf_lookup_and_delete_test': BPF program load failed: Invalid argument
libbpf: prog 'bpf_lookup_and_delete_test': failed to load: -22
libbpf: failed to load object 'test_lookup_and_delete'
libbpf: failed to load BPF skeleton 'test_lookup_and_delete': -22
setup_prog:FAIL:test_lookup_and_delete__load unexpected error: -22 (errno 22)
test_lookup_and_delete_hash:FAIL:setup_prog unexpected error: -22
#141/1   lookup_and_delete/lookup_and_delete:FAIL
setup_prog:PASS:test_lookup_and_delete__open 0 nsec
setup_prog:PASS:bpf_map__set_type 0 nsec
setup_prog:PASS:bpf_map__set_max_entries 0 nsec
libbpf: prog 'bpf_lookup_and_delete_test': BPF program load failed: Invalid argument
libbpf: prog 'bpf_lookup_and_delete_test': failed to load: -22
libbpf: failed to load object 'test_lookup_and_delete'
libbpf: failed to load BPF skeleton 'test_lookup_and_delete': -22
setup_prog:FAIL:test_lookup_and_delete__load unexpected error: -22 (errno 22)
test_lookup_and_delete_percpu_hash:FAIL:setup_prog unexpected error: -22
#141/2   lookup_and_delete/lookup_and_delete_percpu:FAIL
setup_prog:PASS:test_lookup_and_delete__open 0 nsec
setup_prog:PASS:bpf_map__set_type 0 nsec
setup_prog:PASS:bpf_map__set_max_entries 0 nsec
libbpf: prog 'bpf_lookup_and_delete_test': BPF program load failed: Invalid argument
libbpf: prog 'bpf_lookup_and_delete_test': failed to load: -22
libbpf: failed to load object 'test_lookup_and_delete'
libbpf: failed to load BPF skeleton 'test_lookup_and_delete': -22
setup_prog:FAIL:test_lookup_and_delete__load unexpected error: -22 (errno 22)
test_lookup_and_delete_lru_hash:FAIL:setup_prog unexpected error: -22
#141/3   lookup_and_delete/lookup_and_delete_lru:FAIL
setup_prog:PASS:test_lookup_and_delete__open 0 nsec
setup_prog:PASS:bpf_map__set_type 0 nsec
setup_prog:PASS:bpf_map__set_max_entries 0 nsec
libbpf: prog 'bpf_lookup_and_delete_test': BPF program load failed: Invalid argument
libbpf: prog 'bpf_lookup_and_delete_test': failed to load: -22
libbpf: failed to load object 'test_lookup_and_delete'
libbpf: failed to load BPF skeleton 'test_lookup_and_delete': -22
setup_prog:FAIL:test_lookup_and_delete__load unexpected error: -22 (errno 22)
test_lookup_and_delete_lru_percpu_hash:FAIL:setup_prog unexpected error: -22
#141/4   lookup_and_delete/lookup_and_delete_lru_percpu:FAIL
#141     lookup_and_delete:FAIL
test_lookup_key:PASS:test_lookup_key__open 0 nsec
test_lookup_key:SKIP:bpf_lookup_*_key(), bpf_key_put() kfuncs not supported
#142     lookup_key:SKIP
libbpf: prog 'printk': BPF program load failed: Invalid argument
libbpf: prog 'printk': failed to load: -22
libbpf: failed to load object 'lru_bug'
libbpf: failed to load BPF skeleton 'lru_bug': -22
test_lru_bug:FAIL:lru_bug__open_and_load unexpected error: -22
#143     lru_bug:FAIL
test_lsm_cgroup_functional:PASS:create empty cgroup 0 nsec
test_lsm_cgroup_functional:PASS:create cgroup for reuse 0 nsec
test_lsm_cgroup_functional:PASS:join_cgroup 0 nsec
libbpf: prog 'socket_post_create': failed to find kernel BTF type ID of 'socket_post_create': -3
libbpf: prog 'socket_post_create': failed to prepare load attributes: -3
libbpf: prog 'socket_post_create': failed to load: -3
libbpf: failed to load object 'lsm_cgroup'
libbpf: failed to load BPF skeleton 'lsm_cgroup': -3
test_lsm_cgroup_functional:FAIL:open_and_load unexpected error: -3
#144/1   lsm_cgroup/functional:FAIL
libbpf: prog 'nonvoid_socket_clone': failed to find kernel BTF type ID of 'inet_csk_clone': -3
libbpf: prog 'nonvoid_socket_clone': failed to prepare load attributes: -3
libbpf: prog 'nonvoid_socket_clone': failed to load: -3
libbpf: failed to load object 'lsm_cgroup_nonvoid'
libbpf: failed to load BPF skeleton 'lsm_cgroup_nonvoid': -3
test_lsm_cgroup_nonvoid:PASS:open succeeds 0 nsec
#144/2   lsm_cgroup/nonvoid:OK
#144     lsm_cgroup:FAIL
test_lwt_redirect:PASS:pthread_create 0 nsec
BusyBox v1.30.1 (Ubuntu 1:1.30.1-7ubuntu3.1) multi-call binary.

Usage: ip [OPTIONS] address|route|link|tunnel|neigh|rule [ARGS]

OPTIONS := -f[amily] inet|inet6|link | -o[neline]

ip addr add|del IFADDR dev IFACE | show|flush [dev IFACE] [to PREFIX]
ip route list|flush|add|del|change|append|replace|test ROUTE
ip link set IFACE [up|down] [arp on|off] [multicast on|off]
	[promisc on|off] [mtu NUM] [name NAME] [qlen NUM] [address MAC]
	[master IFACE | nomaster]
ip tunnel add|change|del|show [NAME]
	[mode ipip|gre|sit] [remote ADDR] [local ADDR] [ttl TTL]
ip neigh show|flush [to PREFIX] [dev DEV] [nud STATE]
ip rule [list] | add|del SELECTOR ACTION
test_lwt_redirect_run:FAIL:netns_create unexpected error: 256 (errno 0)
#145/1   lwt_redirect/lwt_redirect_normal:FAIL
BusyBox v1.30.1 (Ubuntu 1:1.30.1-7ubuntu3.1) multi-call binary.

Usage: ip [OPTIONS] address|route|link|tunnel|neigh|rule [ARGS]

OPTIONS := -f[amily] inet|inet6|link | -o[neline]

ip addr add|del IFADDR dev IFACE | show|flush [dev IFACE] [to PREFIX]
ip route list|flush|add|del|change|append|replace|test ROUTE
ip link set IFACE [up|down] [arp on|off] [multicast on|off]
	[promisc on|off] [mtu NUM] [name NAME] [qlen NUM] [address MAC]
	[master IFACE | nomaster]
ip tunnel add|change|del|show [NAME]
	[mode ipip|gre|sit] [remote ADDR] [local ADDR] [ttl TTL]
ip neigh show|flush [to PREFIX] [dev DEV] [nud STATE]
ip rule [list] | add|del SELECTOR ACTION
test_lwt_redirect_run:FAIL:netns_create unexpected error: 256 (errno 0)
#145/2   lwt_redirect/lwt_redirect_normal_nomac:FAIL
BusyBox v1.30.1 (Ubuntu 1:1.30.1-7ubuntu3.1) multi-call binary.

Usage: ip [OPTIONS] address|route|link|tunnel|neigh|rule [ARGS]

OPTIONS := -f[amily] inet|inet6|link | -o[neline]

ip addr add|del IFADDR dev IFACE | show|flush [dev IFACE] [to PREFIX]
ip route list|flush|add|del|change|append|replace|test ROUTE
ip link set IFACE [up|down] [arp on|off] [multicast on|off]
	[promisc on|off] [mtu NUM] [name NAME] [qlen NUM] [address MAC]
	[master IFACE | nomaster]
ip tunnel add|change|del|show [NAME]
	[mode ipip|gre|sit] [remote ADDR] [local ADDR] [ttl TTL]
ip neigh show|flush [to PREFIX] [dev DEV] [nud STATE]
ip rule [list] | add|del SELECTOR ACTION
test_lwt_redirect_run:FAIL:netns_create unexpected error: 256 (errno 0)
#145/3   lwt_redirect/lwt_redirect_dev_down:FAIL
BusyBox v1.30.1 (Ubuntu 1:1.30.1-7ubuntu3.1) multi-call binary.

Usage: ip [OPTIONS] address|route|link|tunnel|neigh|rule [ARGS]

OPTIONS := -f[amily] inet|inet6|link | -o[neline]

ip addr add|del IFADDR dev IFACE | show|flush [dev IFACE] [to PREFIX]
ip route list|flush|add|del|change|append|replace|test ROUTE
ip link set IFACE [up|down] [arp on|off] [multicast on|off]
	[promisc on|off] [mtu NUM] [name NAME] [qlen NUM] [address MAC]
	[master IFACE | nomaster]
ip tunnel add|change|del|show [NAME]
	[mode ipip|gre|sit] [remote ADDR] [local ADDR] [ttl TTL]
ip neigh show|flush [to PREFIX] [dev DEV] [nud STATE]
ip rule [list] | add|del SELECTOR ACTION
test_lwt_redirect_run:FAIL:netns_create unexpected error: 256 (errno 0)
#145/4   lwt_redirect/lwt_redirect_dev_down_nomac:FAIL
BusyBox v1.30.1 (Ubuntu 1:1.30.1-7ubuntu3.1) multi-call binary.

Usage: ip [OPTIONS] address|route|link|tunnel|neigh|rule [ARGS]

OPTIONS := -f[amily] inet|inet6|link | -o[neline]

ip addr add|del IFADDR dev IFACE | show|flush [dev IFACE] [to PREFIX]
ip route list|flush|add|del|change|append|replace|test ROUTE
ip link set IFACE [up|down] [arp on|off] [multicast on|off]
	[promisc on|off] [mtu NUM] [name NAME] [qlen NUM] [address MAC]
	[master IFACE | nomaster]
ip tunnel add|change|del|show [NAME]
	[mode ipip|gre|sit] [remote ADDR] [local ADDR] [ttl TTL]
ip neigh show|flush [to PREFIX] [dev DEV] [nud STATE]
ip rule [list] | add|del SELECTOR ACTION
test_lwt_redirect_run:FAIL:netns_create unexpected error: 256 (errno 0)
test_lwt_redirect:PASS:pthread_join 0 nsec
#145/5   lwt_redirect/lwt_redirect_dev_carrier_down:FAIL
#145     lwt_redirect:FAIL
test_lwt_reroute:PASS:pthread_create 0 nsec
BusyBox v1.30.1 (Ubuntu 1:1.30.1-7ubuntu3.1) multi-call binary.

Usage: ip [OPTIONS] address|route|link|tunnel|neigh|rule [ARGS]

OPTIONS := -f[amily] inet|inet6|link | -o[neline]

ip addr add|del IFADDR dev IFACE | show|flush [dev IFACE] [to PREFIX]
ip route list|flush|add|del|change|append|replace|test ROUTE
ip link set IFACE [up|down] [arp on|off] [multicast on|off]
	[promisc on|off] [mtu NUM] [name NAME] [qlen NUM] [address MAC]
	[master IFACE | nomaster]
ip tunnel add|change|del|show [NAME]
	[mode ipip|gre|sit] [remote ADDR] [local ADDR] [ttl TTL]
ip neigh show|flush [to PREFIX] [dev DEV] [nud STATE]
ip rule [list] | add|del SELECTOR ACTION
test_lwt_reroute_run:FAIL:netns_create unexpected error: 256 (errno 0)
#146/1   lwt_reroute/lwt_reroute_normal_xmit:FAIL
BusyBox v1.30.1 (Ubuntu 1:1.30.1-7ubuntu3.1) multi-call binary.

Usage: ip [OPTIONS] address|route|link|tunnel|neigh|rule [ARGS]

OPTIONS := -f[amily] inet|inet6|link | -o[neline]

ip addr add|del IFADDR dev IFACE | show|flush [dev IFACE] [to PREFIX]
ip route list|flush|add|del|change|append|replace|test ROUTE
ip link set IFACE [up|down] [arp on|off] [multicast on|off]
	[promisc on|off] [mtu NUM] [name NAME] [qlen NUM] [address MAC]
	[master IFACE | nomaster]
ip tunnel add|change|del|show [NAME]
	[mode ipip|gre|sit] [remote ADDR] [local ADDR] [ttl TTL]
ip neigh show|flush [to PREFIX] [dev DEV] [nud STATE]
ip rule [list] | add|del SELECTOR ACTION
test_lwt_reroute_run:FAIL:netns_create unexpected error: 256 (errno 0)
test_lwt_reroute:PASS:pthread_join 0 nsec
#146/2   lwt_reroute/lwt_reroute_qdisc_dropped:FAIL
#146     lwt_reroute:FAIL
test_map_in_map_access:PASS:access_map_in_map open 0 nsec
test_map_in_map_access:PASS:find program 0 nsec
test_map_in_map_access:PASS:find map 0 nsec
libbpf: prog 'access_map_in_array': BPF program load failed: Invalid argument
libbpf: prog 'access_map_in_array': failed to load: -22
libbpf: failed to load object 'access_map_in_map'
libbpf: failed to load BPF skeleton 'access_map_in_map': -22
test_map_in_map_access:FAIL:access_map_in_map load unexpected error: -22 (errno 22)
#148/1   map_in_map/acc_map_in_array:FAIL
test_map_in_map_access:PASS:access_map_in_map open 0 nsec
test_map_in_map_access:PASS:find program 0 nsec
test_map_in_map_access:PASS:find map 0 nsec
libbpf: prog 'sleepable_access_map_in_array': failed to find kernel BTF type ID of '__x64_sys_getpgid': -3
libbpf: prog 'sleepable_access_map_in_array': failed to prepare load attributes: -3
libbpf: prog 'sleepable_access_map_in_array': failed to load: -3
libbpf: failed to load object 'access_map_in_map'
libbpf: failed to load BPF skeleton 'access_map_in_map': -3
test_map_in_map_access:FAIL:access_map_in_map load unexpected error: -3 (errno 3)
#148/2   map_in_map/sleepable_acc_map_in_array:FAIL
test_map_in_map_access:PASS:access_map_in_map open 0 nsec
test_map_in_map_access:PASS:find program 0 nsec
test_map_in_map_access:PASS:find map 0 nsec
libbpf: prog 'access_map_in_htab': BPF program load failed: Invalid argument
libbpf: prog 'access_map_in_htab': failed to load: -22
libbpf: failed to load object 'access_map_in_map'
libbpf: failed to load BPF skeleton 'access_map_in_map': -22
test_map_in_map_access:FAIL:access_map_in_map load unexpected error: -22 (errno 22)
#148/3   map_in_map/acc_map_in_htab:FAIL
test_map_in_map_access:PASS:access_map_in_map open 0 nsec
test_map_in_map_access:PASS:find program 0 nsec
test_map_in_map_access:PASS:find map 0 nsec
libbpf: prog 'sleepable_access_map_in_htab': failed to find kernel BTF type ID of '__x64_sys_getpgid': -3
libbpf: prog 'sleepable_access_map_in_htab': failed to prepare load attributes: -3
libbpf: prog 'sleepable_access_map_in_htab': failed to load: -3
libbpf: failed to load object 'access_map_in_map'
libbpf: failed to load BPF skeleton 'access_map_in_map': -3
test_map_in_map_access:FAIL:access_map_in_map load unexpected error: -3 (errno 3)
#148/4   map_in_map/sleepable_acc_map_in_htab:FAIL
#148     map_in_map:FAIL
test_map_init:SKIP: >1 cpu needed for this test
#149     map_init:SKIP
tester_init:PASS:tester_log_buf 0 nsec
process_subtest:PASS:obj_open_mem 0 nsec
process_subtest:PASS:specs_alloc 0 nsec
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'kptr access size must be BPF_DW'
#150/1   map_kptr/size_not_bpf_dw:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'kptr access cannot have variable offset'
#150/2   map_kptr/non_const_var_off:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'R1 doesn't have constant offset. kptr has to be'
#150/3   map_kptr/non_const_var_off_kptr_xchg:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'kptr access misaligned expected=8 off=7'
#150/4   map_kptr/misaligned_access_write:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'kptr access misaligned expected=8 off=1'
#150/5   map_kptr/misaligned_access_read:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'variable untrusted_ptr_ access var_off=(0x0; 0x1e0)'
#150/6   map_kptr/reject_var_off_store:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'invalid kptr access, R1 type=untrusted_ptr_prog_test_ref_kfunc'
#150/7   map_kptr/reject_bad_type_match:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'R1 type=untrusted_ptr_or_null_ expected=percpu_ptr_'
#150/8   map_kptr/marked_as_untrusted_or_null:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'access beyond struct prog_test_ref_kfunc at off 32 size 4'
#150/9   map_kptr/correct_btf_id_check_size:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'R1 type=untrusted_ptr_ expected=percpu_ptr_'
#150/10  map_kptr/inherit_untrusted_on_walk:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'off=8 kptr isn't referenced kptr'
#150/11  map_kptr/reject_kptr_xchg_on_unref:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'R1 type=rcu_ptr_or_null_ expected=percpu_ptr_'
#150/12  map_kptr/mark_ref_as_untrusted_or_null:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'store to referenced kptr disallowed'
#150/13  map_kptr/reject_untrusted_store_to_ref:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'R2 must be referenced'
#150/14  map_kptr/reject_untrusted_xchg:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'invalid kptr access, R2 type=ptr_prog_test_ref_kfunc expected=ptr_prog_test_member'
#150/15  map_kptr/reject_bad_type_xchg:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'invalid kptr access, R2 type=ptr_prog_test_ref_kfunc'
#150/16  map_kptr/reject_member_of_ref_xchg:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'kptr cannot be accessed indirectly by helper'
#150/17  map_kptr/reject_indirect_global_func_access:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'Unreleased reference id=5 alloc_insn='
#150/18  map_kptr/kptr_xchg_ref_state:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'Possibly NULL pointer passed to helper arg2'
#150/19  map_kptr/kptr_xchg_possibly_null:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_call_test_acquire': not found in kernel or module BTFs
libbpf: failed to load object 'map_kptr_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'kptr cannot be accessed indirectly by helper'
#150/20  map_kptr/reject_indirect_helper_access:FAIL
libbpf: prog 'do_call_rcu_tasks_trace': BPF program load failed: Invalid argument
libbpf: prog 'do_call_rcu_tasks_trace': -- BEGIN PROG LOAD LOG --
arg#0 reference type('UNKNOWN ') size cannot be determined: -22
0: R1=ctx() R10=fp0
; current = bpf_get_current_task_btf(); @ rcu_tasks_trace_gp.c:21
0: (85) call bpf_get_current_task_btf#158     ; R0_w=scalar()
1: (bf) r6 = r0                       ; R0_w=scalar(id=1) R6_w=scalar(id=1)
; v = bpf_task_storage_get(&task_ls_map, current, NULL, BPF_LOCAL_STORAGE_GET_F_CREATE); @ rcu_tasks_trace_gp.c:22
2: (18) r1 = 0x62d26e00               ; R1_w=map_ptr(map=task_ls_map,ks=4,vs=4)
4: (bf) r2 = r6                       ; R2_w=scalar(id=1) R6_w=scalar(id=1)
5: (b7) r3 = 0                        ; R3_w=0
6: (b7) r4 = 1                        ; R4_w=1
7: (85) call bpf_task_storage_get#156
program of this type cannot use helper bpf_task_storage_get#156
processed 7 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
-- END PROG LOAD LOG --
libbpf: prog 'do_call_rcu_tasks_trace': failed to load: -22
libbpf: failed to load object 'rcu_tasks_trace_gp'
libbpf: failed to load BPF skeleton 'rcu_tasks_trace_gp': -22
serial_test_map_kptr:FAIL:rcu_tasks_trace_gp__open_and_load unexpected error: -22
#150     map_kptr:FAIL
spin_lock_thread:PASS:test_run_opts err 0 nsec
spin_lock_thread:PASS:test_run_opts retval 0 nsec
spin_lock_thread:PASS:test_run_opts err 0 nsec
spin_lock_thread:PASS:test_run_opts retval 0 nsec
spin_lock_thread:PASS:test_run_opts err 0 nsec
spin_lock_thread:PASS:test_run_opts retval 0 nsec
spin_lock_thread:PASS:test_run_opts err 0 nsec
spin_lock_thread:PASS:test_run_opts retval 0 nsec
#151     map_lock:OK
test_map_lookup_percpu_elem:PASS:malloc 0 nsec
test_map_lookup_percpu_elem:PASS:test_map_lookup_percpu_elem__open 0 nsec
libbpf: prog 'sysenter_getuid': BPF program load failed: Invalid argument
libbpf: prog 'sysenter_getuid': failed to load: -22
libbpf: failed to load object 'test_map_lookup_percpu_elem'
libbpf: failed to load BPF skeleton 'test_map_lookup_percpu_elem': -22
test_map_lookup_percpu_elem:FAIL:test_map_lookup_percpu_elem__load unexpected error: -22 (errno 22)
#152     map_lookup_percpu_elem:FAIL
setup:PASS:test_map_ops__open 0 nsec
libbpf: prog 'map_update': BPF program load failed: Invalid argument
libbpf: prog 'map_update': failed to load: -22
libbpf: failed to load object 'test_map_ops'
libbpf: failed to load BPF skeleton 'test_map_ops': -22
setup:FAIL:test_map_ops__load unexpected error: -22 (errno 22)
#153/1   map_ops/map_ops_update_delete:FAIL
setup:PASS:test_map_ops__open 0 nsec
libbpf: prog 'map_update': BPF program load failed: Invalid argument
libbpf: prog 'map_update': failed to load: -22
libbpf: failed to load object 'test_map_ops'
libbpf: failed to load BPF skeleton 'test_map_ops': -22
setup:FAIL:test_map_ops__load unexpected error: -22 (errno 22)
#153/2   map_ops/map_ops_push_peek_pop:FAIL
setup:PASS:test_map_ops__open 0 nsec
libbpf: prog 'map_update': BPF program load failed: Invalid argument
libbpf: prog 'map_update': failed to load: -22
libbpf: failed to load object 'test_map_ops'
libbpf: failed to load BPF skeleton 'test_map_ops': -22
setup:FAIL:test_map_ops__load unexpected error: -22 (errno 22)
#153/3   map_ops/map_ops_for_each:FAIL
#153     map_ops:FAIL
test_map_ptr:PASS:skel_open 0 nsec
test_map_ptr:FAIL:skel_load unexpected error: -22 (errno 22)
#154     map_ptr:FAIL
test_metadata_unused:PASS:skel-load 0 nsec
test_metadata_unused:PASS:prog-holds-rodata 0 nsec
test_metadata_unused:PASS:bpf_metadata_a 0 nsec
test_metadata_unused:PASS:bpf_metadata_b 0 nsec
test_metadata_unused:PASS:rebind_map 0 nsec
#155/1   metadata/unused:OK
test_metadata_used:PASS:skel-load 0 nsec
test_metadata_used:PASS:prog-holds-rodata 0 nsec
test_metadata_used:PASS:metadata_a 0 nsec
test_metadata_used:PASS:metadata_b 0 nsec
test_metadata_used:PASS:rebind_map 0 nsec
#155/2   metadata/used:OK
#155     metadata:OK
serial_test_migrate_reuseport:PASS:open_and_load 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:setsockopt - SO_ATTACH_REUSEPORT_EBPF 0 nsec
start_servers:PASS:getsockname 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
run_test:PASS:start_servers 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
run_test:PASS:start_clients 0 nsec
run_test:PASS:listen 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
run_test:PASS:fill_maps 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:listen 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:listen 0 nsec
migrate_dance:PASS:shutdown 0 nsec
run_test:PASS:migrate_dance 0 nsec
count_requests:PASS:settimeo 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:count in userspace 0 nsec
count_requests:PASS:count in BPF prog 0 nsec
#156/1   migrate_reuseport/IPv4 TCP_ESTABLISHED  inet_csk_listen_stop:OK
setup_fastopen:PASS:open 0 nsec
setup_fastopen:PASS:read 0 nsec
setup_fastopen:PASS:lseek 0 nsec
setup_fastopen:PASS:write - setup 0 nsec
run_test:PASS:setup_fastopen - setup 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:setsockopt - SO_ATTACH_REUSEPORT_EBPF 0 nsec
start_servers:PASS:getsockname 0 nsec
start_servers:PASS:setsockopt - TCP_FASTOPEN 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:setsockopt - TCP_FASTOPEN 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:setsockopt - TCP_FASTOPEN 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:setsockopt - TCP_FASTOPEN 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:setsockopt - TCP_FASTOPEN 0 nsec
run_test:PASS:start_servers 0 nsec
drop_ack:PASS:bpf_program__attach_xdp 0 nsec
run_test:PASS:drop_ack 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
run_test:PASS:start_clients 0 nsec
run_test:PASS:listen 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
run_test:PASS:fill_maps 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:listen 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:listen 0 nsec
migrate_dance:PASS:shutdown 0 nsec
run_test:PASS:migrate_dance 0 nsec
pass_ack:PASS:bpf_link__destroy 0 nsec
run_test:PASS:pass_ack 0 nsec
count_requests:PASS:settimeo 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:count in userspace 0 nsec
count_requests:PASS:count in BPF prog 0 nsec
setup_fastopen:PASS:open 0 nsec
setup_fastopen:PASS:write - restore 0 nsec
run_test:PASS:setup_fastopen - restore 0 nsec
#156/2   migrate_reuseport/IPv4 TCP_SYN_RECV     inet_csk_listen_stop:OK
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:setsockopt - SO_ATTACH_REUSEPORT_EBPF 0 nsec
start_servers:PASS:getsockname 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
run_test:PASS:start_servers 0 nsec
drop_ack:PASS:bpf_program__attach_xdp 0 nsec
run_test:PASS:drop_ack 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
run_test:PASS:start_clients 0 nsec
run_test:PASS:listen 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
run_test:PASS:fill_maps 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
run_test:PASS:migrate_dance 0 nsec
pass_ack:PASS:bpf_link__destroy 0 nsec
run_test:PASS:pass_ack 0 nsec
count_requests:PASS:settimeo 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:count in userspace 0 nsec
count_requests:PASS:count in BPF prog 0 nsec
#156/3   migrate_reuseport/IPv4 TCP_NEW_SYN_RECV reqsk_timer_handler:OK
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:setsockopt - SO_ATTACH_REUSEPORT_EBPF 0 nsec
start_servers:PASS:getsockname 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
run_test:PASS:start_servers 0 nsec
drop_ack:PASS:bpf_program__attach_xdp 0 nsec
run_test:PASS:drop_ack 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
run_test:PASS:start_clients 0 nsec
run_test:PASS:listen 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
run_test:PASS:fill_maps 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
run_test:PASS:migrate_dance 0 nsec
pass_ack:PASS:bpf_link__destroy 0 nsec
run_test:PASS:pass_ack 0 nsec
count_requests:PASS:settimeo 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:count in userspace 0 nsec
count_requests:PASS:count in BPF prog 0 nsec
#156/4   migrate_reuseport/IPv4 TCP_NEW_SYN_RECV inet_csk_complete_hashdance:OK
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:setsockopt - SO_ATTACH_REUSEPORT_EBPF 0 nsec
start_servers:PASS:getsockname 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
run_test:PASS:start_servers 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
run_test:PASS:start_clients 0 nsec
run_test:PASS:listen 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
run_test:PASS:fill_maps 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:listen 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:listen 0 nsec
migrate_dance:PASS:shutdown 0 nsec
run_test:PASS:migrate_dance 0 nsec
count_requests:PASS:settimeo 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:count in userspace 0 nsec
count_requests:PASS:count in BPF prog 0 nsec
#156/5   migrate_reuseport/IPv6 TCP_ESTABLISHED  inet_csk_listen_stop:OK
setup_fastopen:PASS:open 0 nsec
setup_fastopen:PASS:read 0 nsec
setup_fastopen:PASS:lseek 0 nsec
setup_fastopen:PASS:write - setup 0 nsec
run_test:PASS:setup_fastopen - setup 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:setsockopt - SO_ATTACH_REUSEPORT_EBPF 0 nsec
start_servers:PASS:getsockname 0 nsec
start_servers:PASS:setsockopt - TCP_FASTOPEN 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:setsockopt - TCP_FASTOPEN 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:setsockopt - TCP_FASTOPEN 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:setsockopt - TCP_FASTOPEN 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:setsockopt - TCP_FASTOPEN 0 nsec
run_test:PASS:start_servers 0 nsec
drop_ack:PASS:bpf_program__attach_xdp 0 nsec
run_test:PASS:drop_ack 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:setsockopt - TCP_FASTOPEN_CONNECT 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
run_test:PASS:start_clients 0 nsec
run_test:PASS:listen 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
run_test:PASS:fill_maps 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:listen 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:listen 0 nsec
migrate_dance:PASS:shutdown 0 nsec
run_test:PASS:migrate_dance 0 nsec
pass_ack:PASS:bpf_link__destroy 0 nsec
run_test:PASS:pass_ack 0 nsec
count_requests:PASS:settimeo 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:count in userspace 0 nsec
count_requests:PASS:count in BPF prog 0 nsec
setup_fastopen:PASS:open 0 nsec
setup_fastopen:PASS:write - restore 0 nsec
run_test:PASS:setup_fastopen - restore 0 nsec
#156/6   migrate_reuseport/IPv6 TCP_SYN_RECV     inet_csk_listen_stop:OK
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:setsockopt - SO_ATTACH_REUSEPORT_EBPF 0 nsec
start_servers:PASS:getsockname 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
run_test:PASS:start_servers 0 nsec
drop_ack:PASS:bpf_program__attach_xdp 0 nsec
run_test:PASS:drop_ack 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
run_test:PASS:start_clients 0 nsec
run_test:PASS:listen 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
run_test:PASS:fill_maps 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
run_test:PASS:migrate_dance 0 nsec
pass_ack:PASS:bpf_link__destroy 0 nsec
run_test:PASS:pass_ack 0 nsec
count_requests:PASS:settimeo 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:count in userspace 0 nsec
count_requests:PASS:count in BPF prog 0 nsec
#156/7   migrate_reuseport/IPv6 TCP_NEW_SYN_RECV reqsk_timer_handler:OK
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:setsockopt - SO_ATTACH_REUSEPORT_EBPF 0 nsec
start_servers:PASS:getsockname 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
start_servers:PASS:listen 0 nsec
start_servers:PASS:socket 0 nsec
start_servers:PASS:setsockopt - SO_REUSEPORT 0 nsec
start_servers:PASS:bind 0 nsec
run_test:PASS:start_servers 0 nsec
drop_ack:PASS:bpf_program__attach_xdp 0 nsec
run_test:PASS:drop_ack 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
start_clients:PASS:socket 0 nsec
start_clients:PASS:settimeo 0 nsec
start_clients:PASS:connect 0 nsec
start_clients:PASS:write 0 nsec
run_test:PASS:start_clients 0 nsec
run_test:PASS:listen 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
update_maps:PASS:bpf_map_update_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_lookup_elem - reuseport_map 0 nsec
update_maps:PASS:bpf_map_update_elem - migrate_map 0 nsec
run_test:PASS:fill_maps 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
migrate_dance:PASS:shutdown 0 nsec
run_test:PASS:migrate_dance 0 nsec
pass_ack:PASS:bpf_link__destroy 0 nsec
run_test:PASS:pass_ack 0 nsec
count_requests:PASS:settimeo 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:accept 0 nsec
count_requests:PASS:read 0 nsec
count_requests:PASS:count in userspace 0 nsec
count_requests:PASS:count in BPF prog 0 nsec
#156/8   migrate_reuseport/IPv6 TCP_NEW_SYN_RECV inet_csk_complete_hashdance:OK
#156     migrate_reuseport:OK
libbpf: extern (func ksym) 'bpf_kfunc_common_test': not found in kernel or module BTFs
libbpf: failed to load object 'missed_kprobe'
libbpf: failed to load BPF skeleton 'missed_kprobe': -22
test_missed_perf_kprobe:FAIL:missed_kprobe__open_and_load unexpected error: -22
#157/1   missed/perf_kprobe:FAIL
libbpf: extern (func ksym) 'bpf_kfunc_common_test': not found in kernel or module BTFs
libbpf: failed to load object 'missed_kprobe_recursion'
libbpf: failed to load BPF skeleton 'missed_kprobe_recursion': -22
test_missed_kprobe_recursion:FAIL:missed_kprobe_recursion__open_and_load unexpected error: -22
#157/2   missed/kprobe_recursion:FAIL
libbpf: prog 'trigger': BPF program load failed: Invalid argument
libbpf: prog 'trigger': failed to load: -22
libbpf: failed to load object 'missed_tp_recursion'
libbpf: failed to load BPF skeleton 'missed_tp_recursion': -22
test_missed_tp_recursion:FAIL:missed_tp_recursion__open_and_load unexpected error: -22
#157/3   missed/tp_recursion:FAIL
#157     missed:FAIL
test_mmap:PASS:skel_open 0 nsec
test_mmap:PASS:bpf_map__set_max_entries 0 nsec
test_mmap:PASS:bpf_map__set_max_entries 0 nsec
libbpf: prog 'test_mmap': BPF program load failed: Invalid argument
libbpf: prog 'test_mmap': failed to load: -22
libbpf: failed to load object 'test_mmap'
libbpf: failed to load BPF skeleton 'test_mmap': -22
test_mmap:FAIL:skel_load skeleton load failed
#158     mmap:FAIL
libbpf: prog 'add_to_list_in_inner_array': failed to find kernel BTF type ID of '__x64_sys_nanosleep': -3
libbpf: prog 'add_to_list_in_inner_array': failed to prepare load attributes: -3
libbpf: prog 'add_to_list_in_inner_array': failed to load: -3
libbpf: failed to load object 'mmap_inner_array'
libbpf: failed to load BPF skeleton 'mmap_inner_array': -3
test_mmap_inner_array:FAIL:open_and_load unexpected error: -3
#159     mmap_inner_array:FAIL
libbpf: prog 'fentry_test': BPF program load failed: Invalid argument
libbpf: prog 'fentry_test': failed to load: -22
libbpf: failed to load object 'modify_return'
libbpf: failed to load BPF skeleton 'modify_return': -22
run_test:FAIL:skel_load unexpected error: -22
libbpf: prog 'fentry_test': BPF program load failed: Invalid argument
libbpf: prog 'fentry_test': failed to load: -22
libbpf: failed to load object 'modify_return'
libbpf: failed to load BPF skeleton 'modify_return': -22
run_test:FAIL:skel_load unexpected error: -22
#160     modify_return:FAIL
test_module_attach:PASS:skel_open 0 nsec
test_module_attach:FAIL:set_attach_target unexpected error: -3 (errno 3)
test_module_attach:FAIL:set_attach_target_explicit unexpected error: -3 (errno 3)
libbpf: prog 'handle_raw_tp': BPF program load failed: Invalid argument
libbpf: prog 'handle_raw_tp': failed to load: -22
libbpf: failed to load object 'test_module_attach'
libbpf: failed to load BPF skeleton 'test_module_attach': -22
test_module_attach:FAIL:skel_load failed to load skeleton
#161     module_attach:FAIL
#162     module_fentry_shadow:SKIP
tester_init:PASS:tester_log_buf 0 nsec
process_subtest:PASS:obj_open_mem 0 nsec
process_subtest:PASS:specs_alloc 0 nsec
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_cpumask_first_zero': not found in kernel or module BTFs
libbpf: failed to load object 'nested_trust_success'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#163/1   nested_trust/test_read_cpumask:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_cpumask_first_zero': not found in kernel or module BTFs
libbpf: failed to load object 'nested_trust_success'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#163/2   nested_trust/test_nested_offset:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_cpumask_first_zero': not found in kernel or module BTFs
libbpf: failed to load object 'nested_trust_success'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#163/3   nested_trust/test_skb_field:FAIL
tester_init:PASS:tester_log_buf 0 nsec
process_subtest:PASS:obj_open_mem 0 nsec
process_subtest:PASS:specs_alloc 0 nsec
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_cpumask_test_cpu': not found in kernel or module BTFs
libbpf: failed to load object 'nested_trust_failure'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'R2 must be'
#163/4   nested_trust/test_invalid_nested_user_cpus:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_cpumask_test_cpu': not found in kernel or module BTFs
libbpf: failed to load object 'nested_trust_failure'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'R2 type=untrusted_ptr_ expected=ptr_, trusted_ptr_, rcu_ptr_'
#163/5   nested_trust/test_invalid_skb_field:FAIL
#163     nested_trust:FAIL
serial_test_netcnt:PASS:netcnt_prog__open_and_load 0 nsec
serial_test_netcnt:PASS:malloc(percpu_netcnt) 0 nsec
serial_test_netcnt:PASS:test__join_cgroup 0 nsec
serial_test_netcnt:PASS:attach_cgroup(bpf_nextcnt) 0 nsec
serial_test_netcnt:PASS:ping -6 ::1 -A -c 10000 -q > /dev/null 0 nsec
serial_test_netcnt:PASS:bpf_map_get_next_key 0 nsec
serial_test_netcnt:PASS:bpf_map_lookup_elem(netcnt) 0 nsec
serial_test_netcnt:PASS:bpf_map_lookup_elem(percpu_netcnt) 0 nsec
serial_test_netcnt:PASS:MAX_PERCPU_PACKETS 0 nsec
serial_test_netcnt:PASS:packets 0 nsec
serial_test_netcnt:PASS:bytes 0 nsec
#164     netcnt:OK
libbpf: prog 'nf_link_attach_test': BPF program load failed: Invalid argument
libbpf: prog 'nf_link_attach_test': failed to load: -22
libbpf: failed to load object 'test_netfilter_link_attach'
libbpf: failed to load BPF skeleton 'test_netfilter_link_attach': -22
test_netfilter_link_attach:FAIL:test_netfilter_link_attach__open_and_load unexpected error: -22
#165     netfilter_link_attach:FAIL
test_netns_cookie:PASS:skel_open 0 nsec
test_netns_cookie:PASS:join_cgroup 0 nsec
test_netns_cookie:PASS:prog_attach 0 nsec
test_netns_cookie:PASS:prog_attach 0 nsec
test_netns_cookie:PASS:start_server 0 nsec
test_netns_cookie:PASS:connect_to_fd 0 nsec
test_netns_cookie:PASS:send(msg) 0 nsec
test_netns_cookie:PASS:map_lookup(sockops_netns_cookies) 0 nsec
test_netns_cookie:PASS:getsockopt 0 nsec
test_netns_cookie:PASS:cookie_value 0 nsec
test_netns_cookie:PASS:map_lookup(sk_msg_netns_cookies) 0 nsec
test_netns_cookie:PASS:cookie_value 0 nsec
#166     netns_cookie:OK
test_current_pid_tgid_tp:PASS:test_ns_current_pid_tgid__open 0 nsec
libbpf: prog 'tp_handler': BPF program load failed: Invalid argument
libbpf: prog 'tp_handler': failed to load: -22
libbpf: failed to load object 'test_ns_current_pid_tgid'
libbpf: failed to load BPF skeleton 'test_ns_current_pid_tgid': -22
test_current_pid_tgid_tp:FAIL:test_ns_current_pid_tgid__load unexpected error: -22 (errno 22)
#167/1   ns_current_pid_tgid/root_ns_tp:FAIL
test_ns_current_pid_tgid_new_ns:FAIL:clone unexpected clone: actual -1 == expected -1
#167/2   ns_current_pid_tgid/new_ns_tp:FAIL
serial_test_ns_current_pid_tgid:PASS:join_cgroup 0 nsec
BusyBox v1.30.1 (Ubuntu 1:1.30.1-7ubuntu3.1) multi-call binary.

Usage: ip [OPTIONS] address|route|link|tunnel|neigh|rule [ARGS]

OPTIONS := -f[amily] inet|inet6|link | -o[neline]

ip addr add|del IFADDR dev IFACE | show|flush [dev IFACE] [to PREFIX]
ip route list|flush|add|del|change|append|replace|test ROUTE
ip link set IFACE [up|down] [arp on|off] [multicast on|off]
	[promisc on|off] [mtu NUM] [name NAME] [qlen NUM] [address MAC]
	[master IFACE | nomaster]
ip tunnel add|change|del|show [NAME]
	[mode ipip|gre|sit] [remote ADDR] [local ADDR] [ttl TTL]
ip neigh show|flush [to PREFIX] [dev DEV] [nud STATE]
ip rule [list] | add|del SELECTOR ACTION
test_in_netns:FAIL:ip netns add ns_current_pid_tgid unexpected error: 256 (errno 2)
#167/3   ns_current_pid_tgid/new_ns_cgrp:FAIL
BusyBox v1.30.1 (Ubuntu 1:1.30.1-7ubuntu3.1) multi-call binary.

Usage: ip [OPTIONS] address|route|link|tunnel|neigh|rule [ARGS]

OPTIONS := -f[amily] inet|inet6|link | -o[neline]

ip addr add|del IFADDR dev IFACE | show|flush [dev IFACE] [to PREFIX]
ip route list|flush|add|del|change|append|replace|test ROUTE
ip link set IFACE [up|down] [arp on|off] [multicast on|off]
	[promisc on|off] [mtu NUM] [name NAME] [qlen NUM] [address MAC]
	[master IFACE | nomaster]
ip tunnel add|change|del|show [NAME]
	[mode ipip|gre|sit] [remote ADDR] [local ADDR] [ttl TTL]
ip neigh show|flush [to PREFIX] [dev DEV] [nud STATE]
ip rule [list] | add|del SELECTOR ACTION
test_in_netns:FAIL:ip netns add ns_current_pid_tgid unexpected error: 256 (errno 2)
#167/4   ns_current_pid_tgid/new_ns_sk_msg:FAIL
#167     ns_current_pid_tgid:FAIL
test_obj_name:PASS:check-bpf-prog-name 0 nsec
test_obj_name:PASS:check-bpf-map-name 0 nsec
test_obj_name:PASS:check-bpf-prog-name 0 nsec
test_obj_name:PASS:check-bpf-map-name 0 nsec
test_obj_name:PASS:check-bpf-prog-name 0 nsec
test_obj_name:PASS:check-bpf-map-name 0 nsec
test_obj_name:PASS:check-bpf-prog-name 0 nsec
test_obj_name:PASS:check-bpf-map-name 0 nsec
#168     obj_name:OK
libbpf: prog 'xdp_ingress_v6': BPF program load failed: Permission denied
libbpf: prog 'xdp_ingress_v6': -- BEGIN PROG LOAD LOG --
0: R1=ctx() R10=fp0
; int xdp_ingress_v6(struct xdp_md *xdp) @ test_parse_tcp_hdr_opt.c:82
0: (b4) w0 = 1                        ; R0_w=1
; const void *data_end = (void *)(long)xdp->data_end; @ test_parse_tcp_hdr_opt.c:85
1: (61) r2 = *(u32 *)(r1 +4)          ; R1=ctx() R2_w=pkt_end()
; const void *data = (void *)(long)xdp->data; @ test_parse_tcp_hdr_opt.c:84
2: (61) r1 = *(u32 *)(r1 +0)          ; R1_w=pkt(r=0)
; if (tcp_hdr + 1 > data_end) @ test_parse_tcp_hdr_opt.c:94
3: (bf) r3 = r1                       ; R1_w=pkt(r=0) R3_w=pkt(r=0)
4: (07) r3 += 74                      ; R3_w=pkt(off=74,r=0)
5: (2d) if r3 > r2 goto pc+54         ; R2_w=pkt_end() R3_w=pkt(off=74,r=74)
; tcp_hdr_opt_len = (tcp_hdr->doff * 4) - sizeof(struct tcphdr); @ test_parse_tcp_hdr_opt.c:97
6: (69) r3 = *(u16 *)(r1 +66)         ; R1_w=pkt(r=74) R3_w=scalar(smin=smin32=0,smax=umax=smax32=umax32=0xffff,var_off=(0x0; 0xffff))
7: (74) w3 >>= 2                      ; R3_w=scalar(smin=smin32=0,smax=umax=smax32=umax32=16383,var_off=(0x0; 0x3fff))
8: (54) w3 &= 60                      ; R3_w=scalar(smin=smin32=0,smax=umax=smax32=umax32=60,var_off=(0x0; 0x3c))
9: (04) w3 += -20                     ; R3_w=scalar(smin=0,smax=umax=umax32=0xfffffffc,smin32=-20,smax32=40,var_off=(0x0; 0xfffffffc))
; if (tcp_hdr_opt_len < tcp_hdr_opt_len_tpr) @ test_parse_tcp_hdr_opt.c:98
10: (a6) if w3 < 0x6 goto pc+49       ; R3_w=scalar(smin=umin=umin32=6,smax=umax=umax32=0xfffffffc,smin32=-20,smax32=40,var_off=(0x0; 0xfffffffc))
11: (b4) w4 = 74                      ; R4_w=74
12: (b4) w6 = 14                      ; R6_w=14
13: (05) goto pc+6
; if (err || !opt_state.hdr_bytes_remaining) @ test_parse_tcp_hdr_opt.c:108
20: (bc) w5 = w6                      ; R5_w=14 R6=14
21: (bf) r7 = r4                      ; R4=74 R7_w=74
22: (57) r7 &= 255                    ; R7_w=74
; tcp_opt = (__u8 *)(data + state->byte_offset); @ test_parse_tcp_hdr_opt.c:42
23: (bf) r6 = r1                      ; R1=pkt(r=74) R6_w=pkt(r=74)
24: (0f) r6 += r7                     ; R6_w=pkt(off=74,r=74) R7_w=74
; if (tcp_opt + 1 > data_end) @ test_parse_tcp_hdr_opt.c:43
25: (bf) r8 = r6                      ; R6_w=pkt(off=74,r=74) R8_w=pkt(off=74,r=74)
26: (07) r8 += 1                      ; R8_w=pkt(off=75,r=74)
27: (2d) if r8 > r2 goto pc+32        ; R2=pkt_end() R8_w=pkt(off=75,r=75)
; kind = tcp_opt[0]; @ test_parse_tcp_hdr_opt.c:46
28: (71) r7 = *(u8 *)(r6 +0)          ; R6_w=pkt(off=74,r=75) R7_w=scalar(smin=smin32=0,smax=umax=smax32=umax32=255,var_off=(0x0; 0xff))
; if (kind == TCPOPT_EOL) @ test_parse_tcp_hdr_opt.c:48
29: (16) if w7 == 0x1 goto pc+17      ; R7_w=scalar(smin=smin32=0,smax=umax=smax32=umax32=255,var_off=(0x0; 0xff))
30: (16) if w7 == 0x0 goto pc+29      ; R7=scalar(smin=umin=smin32=umin32=1,smax=umax=smax32=umax32=255,var_off=(0x0; 0xff))
; if (state->hdr_bytes_remaining < 2 || @ test_parse_tcp_hdr_opt.c:57
31: (bc) w9 = w3                      ; R3=scalar(id=1,smin=umin=umin32=6,smax=umax=umax32=0xfffffffc,smin32=-20,smax32=40,var_off=(0x0; 0xfffffffc)) R9_w=scalar(id=1,smin=umin=umin32=6,smax=umax=umax32=0xfffffffc,smin32=-20,smax32=40,var_off=(0x0; 0xfffffffc))
32: (54) w9 &= 255                    ; R9_w=scalar(smin=smin32=0,smax=umax=smax32=umax32=252,var_off=(0x0; 0xfc))
33: (a6) if w9 < 0x2 goto pc+26       ; R9_w=scalar(smin=umin=smin32=umin32=2,smax=umax=smax32=umax32=252,var_off=(0x0; 0xfc))
34: (bf) r9 = r8                      ; R8=pkt(off=75,r=75) R9_w=pkt(off=75,r=75)
35: (07) r9 += 1                      ; R9_w=pkt(off=76,r=75)
36: (2d) if r9 > r2 goto pc+23        ; R2=pkt_end() R9_w=pkt(off=76,r=76)
; hdr_len = tcp_opt[1]; @ test_parse_tcp_hdr_opt.c:61
37: (71) r8 = *(u8 *)(r8 +0)          ; R8_w=scalar(smin=smin32=0,smax=umax=smax32=umax32=255,var_off=(0x0; 0xff))
; if (hdr_len > state->hdr_bytes_remaining) @ test_parse_tcp_hdr_opt.c:62
38: (bc) w9 = w3                      ; R3=scalar(id=1,smin=umin=umin32=6,smax=umax=umax32=0xfffffffc,smin32=-20,smax32=40,var_off=(0x0; 0xfffffffc)) R9_w=scalar(id=1,smin=umin=umin32=6,smax=umax=umax32=0xfffffffc,smin32=-20,smax32=40,var_off=(0x0; 0xfffffffc))
39: (54) w9 &= 255                    ; R9=scalar(smin=smin32=0,smax=umax=smax32=umax32=252,var_off=(0x0; 0xfc))
40: (ae) if w9 < w8 goto pc+19        ; R8=scalar(smin=smin32=0,smax=umax=smax32=umax32=252,var_off=(0x0; 0xff)) R9=scalar(smin=smin32=0,smax=umax=smax32=umax32=252,var_off=(0x0; 0xfc))
; if (kind == tcp_hdr_opt_kind_tpr) { @ test_parse_tcp_hdr_opt.c:65
41: (56) if w7 != 0xfd goto pc+8      ; R7=253
; if (hdr_len != tcp_hdr_opt_len_tpr) @ test_parse_tcp_hdr_opt.c:66
42: (56) if w8 != 0x6 goto pc+17      ; R8=6
43: (bf) r1 = r6                      ; R1_w=pkt(off=74,r=76) R6=pkt(off=74,r=76)
44: (07) r1 += 6                      ; R1_w=pkt(off=80,r=76)
45: (2d) if r1 > r2 goto pc+14        ; R1_w=pkt(off=80,r=80) R2=pkt_end()
46: (05) goto pc+7
; state->server_id = *(__u32 *)&tcp_opt[2]; @ test_parse_tcp_hdr_opt.c:72
54: (61) r1 = *(u32 *)(r6 +2)
misaligned packet access off 2+0+74+2 size 4
processed 42 insns (limit 1000000) max_states_per_insn 0 total_states 3 peak_states 3 mark_read 2
-- END PROG LOAD LOG --
libbpf: prog 'xdp_ingress_v6': failed to load: -13
libbpf: failed to load object 'test_parse_tcp_hdr_opt'
libbpf: failed to load BPF skeleton 'test_parse_tcp_hdr_opt': -13
test_parse_opt:FAIL:skel_open_and_load unexpected error: -13
#169/1   parse_tcp_hdr_opt/parse_tcp_hdr_opt:FAIL
libbpf: prog 'xdp_ingress_v6': BPF program load failed: unknown error (-524)
libbpf: prog 'xdp_ingress_v6': -- BEGIN PROG LOAD LOG --
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
-- END PROG LOAD LOG --
libbpf: prog 'xdp_ingress_v6': failed to load: -524
libbpf: failed to load object 'test_parse_tcp_hdr_opt_dynptr'
libbpf: failed to load BPF skeleton 'test_parse_tcp_hdr_opt_dynptr': -524
test_parse_opt_dynptr:FAIL:skel_open_and_load unexpected error: -524
#169/2   parse_tcp_hdr_opt/parse_tcp_hdr_opt_dynptr:FAIL
#169     parse_tcp_hdr_opt:FAIL
libbpf: prog 'read_array_1': BPF program load failed: Invalid argument
libbpf: prog 'read_array_1': failed to load: -22
libbpf: failed to load object 'test_pe_preserve_elems'
libbpf: failed to load BPF skeleton 'test_pe_preserve_elems': -22
test_pe_preserve_elems:FAIL:skel_open failed to open skeleton
#170     pe_preserve_elems:FAIL
test_array:PASS:percpu_alloc_array__open 0 nsec
libbpf: prog 'test_array_map_1': BPF program load failed: Invalid argument
libbpf: prog 'test_array_map_1': failed to load: -22
libbpf: failed to load object 'percpu_alloc_array'
libbpf: failed to load BPF skeleton 'percpu_alloc_array': -22
test_array:FAIL:percpu_alloc_array__load unexpected error: -22 (errno 22)
#171/1   percpu_alloc/array:FAIL
test_array_sleepable:PASS:percpu_alloc__open 0 nsec
libbpf: prog 'test_array_map_10': BPF program load failed: Invalid argument
libbpf: prog 'test_array_map_10': failed to load: -22
libbpf: failed to load object 'percpu_alloc_array'
libbpf: failed to load BPF skeleton 'percpu_alloc_array': -22
test_array_sleepable:FAIL:percpu_alloc_array__load unexpected error: -22 (errno 22)
#171/2   percpu_alloc/array_sleepable:FAIL
test_cgrp_local_storage:PASS:join_cgroup /percpu_alloc 0 nsec
test_cgrp_local_storage:PASS:percpu_alloc_cgrp_local_storage__open 0 nsec
libbpf: prog 'test_cgrp_local_storage_1': BPF program load failed: Invalid argument
libbpf: prog 'test_cgrp_local_storage_1': failed to load: -22
libbpf: failed to load object 'percpu_alloc_cgrp_local_storage'
libbpf: failed to load BPF skeleton 'percpu_alloc_cgrp_local_storage': -22
test_cgrp_local_storage:FAIL:percpu_alloc_cgrp_local_storage__load unexpected error: -22 (errno 22)
#171/3   percpu_alloc/cgrp_local_storage:FAIL
tester_init:PASS:tester_log_buf 0 nsec
process_subtest:PASS:obj_open_mem 0 nsec
process_subtest:PASS:specs_alloc 0 nsec
#171/4   percpu_alloc/failure_tests:OK
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'test_array_map_1': BPF program load failed: Invalid argument
libbpf: prog 'test_array_map_1': failed to load: -22
libbpf: failed to load object 'percpu_alloc_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'store to referenced kptr disallowed'
#171/5   percpu_alloc/test_array_map_1:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'test_array_map_2': BPF program load failed: Invalid argument
libbpf: prog 'test_array_map_2': failed to load: -22
libbpf: failed to load object 'percpu_alloc_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'invalid kptr access, R2 type=percpu_ptr_val2_t expected=ptr_val_t'
#171/6   percpu_alloc/test_array_map_2:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'test_array_map_3': BPF program load failed: Invalid argument
libbpf: prog 'test_array_map_3': failed to load: -22
libbpf: failed to load object 'percpu_alloc_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'R1 type=scalar expected=percpu_ptr_, percpu_rcu_ptr_, percpu_trusted_ptr_'
#171/7   percpu_alloc/test_array_map_3:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'test_array_map_4': BPF program load failed: Invalid argument
libbpf: prog 'test_array_map_4': failed to load: -22
libbpf: failed to load object 'percpu_alloc_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'arg#0 expected for bpf_percpu_obj_drop_impl()'
#171/8   percpu_alloc/test_array_map_4:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'test_array_map_5': BPF program load failed: Invalid argument
libbpf: prog 'test_array_map_5': failed to load: -22
libbpf: failed to load object 'percpu_alloc_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'arg#0 expected for bpf_obj_drop_impl()'
#171/9   percpu_alloc/test_array_map_5:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'test_array_map_6': BPF program load failed: Invalid argument
libbpf: prog 'test_array_map_6': failed to load: -22
libbpf: failed to load object 'percpu_alloc_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'bpf_percpu_obj_new type ID argument must be of a struct of scalars'
#171/10  percpu_alloc/test_array_map_6:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'test_array_map_7': BPF program load failed: Invalid argument
libbpf: prog 'test_array_map_7': failed to load: -22
libbpf: failed to load object 'percpu_alloc_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'bpf_percpu_obj_new type ID argument must not contain special fields'
#171/11  percpu_alloc/test_array_map_7:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'test_array_map_8': BPF program load failed: Invalid argument
libbpf: prog 'test_array_map_8': failed to load: -22
libbpf: failed to load object 'percpu_alloc_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'bpf_percpu_obj_new type size (600) is greater than 512'
#171/12  percpu_alloc/test_array_map_8:FAIL
#171     percpu_alloc:FAIL
test_perf_branches_hw:FAIL:perf_event_open err -1 errno 38
#172/1   perf_branches/perf_branches_hw:FAIL
test_perf_branches_no_hw:FAIL:perf_event_open err -1
#172/2   perf_branches/perf_branches_no_hw:FAIL
#172     perf_branches:FAIL
serial_test_perf_buffer:PASS:nr_cpus 0 nsec
serial_test_perf_buffer:PASS:nr_on_cpus 0 nsec
libbpf: prog 'handle_sys_enter': BPF program load failed: Invalid argument
libbpf: prog 'handle_sys_enter': failed to load: -22
libbpf: failed to load object 'test_perf_buffer'
libbpf: failed to load BPF skeleton 'test_perf_buffer': -22
serial_test_perf_buffer:FAIL:skel_load skeleton open/load failed
#173     perf_buffer:FAIL
serial_test_perf_link:FAIL:perf_fd unexpected perf_fd: actual -1 < expected 0
#174     perf_link:FAIL
libbpf: map 'nopinmap3': invalid pinning value 2.
test_pinning:PASS:invalid open 0 nsec
test_pinning:PASS:default open 0 nsec
test_pinning:PASS:default load 0 nsec
test_pinning:PASS:stat pinpath 0 nsec
test_pinning:PASS:stat nopinpath 0 nsec
test_pinning:PASS:stat nopinpath2 0 nsec
get_map_id:PASS:find map 0 nsec
get_map_id:PASS:get map info 0 nsec
test_pinning:PASS:default load 0 nsec
get_map_id:PASS:find map 0 nsec
get_map_id:PASS:get map info 0 nsec
test_pinning:PASS:check reuse 0 nsec
test_pinning:PASS:find map 0 nsec
test_pinning:PASS:re-pin map 0 nsec
libbpf: map 'pinmap' already has pin path '/sys/fs/bpf/pinmap' different from '/sys/fs/bpf/other'
test_pinning:PASS:pin map different 0 nsec
test_pinning:PASS:unpin maps 0 nsec
test_pinning:PASS:pin maps 0 nsec
test_pinning:PASS:get pin path 0 nsec
test_pinning:PASS:find map 0 nsec
test_pinning:PASS:set pin path 0 nsec
test_pinning:PASS:get pin path after set 0 nsec
test_pinning:PASS:pin maps 0 nsec
test_pinning:PASS:stat custpinpath 0 nsec
test_pinning:PASS:unlink custpinpath 0 nsec
test_pinning:PASS:rmdir custpindir 0 nsec
test_pinning:PASS:default open 0 nsec
test_pinning:PASS:set pin path 0 nsec
test_pinning:PASS:set pin path 0 nsec
libbpf: couldn't reuse pinned map at '/sys/fs/bpf/pinmap': parameter mismatch
libbpf: map 'nopinmap2': error reusing pinned map
libbpf: map 'nopinmap2': failed to create: Invalid argument(-22)
libbpf: failed to load object './test_pinning.bpf.o'
test_pinning:PASS:param mismatch load 0 nsec
test_pinning:PASS:stat nopinpath2 0 nsec
test_pinning:PASS:stat pinpath 0 nsec
test_pinning:PASS:custom load 0 nsec
test_pinning:PASS:stat custpinpath 0 nsec
test_pinning:PASS:unlink custpinpath 0 nsec
test_pinning:PASS:rmdir custpindir 0 nsec
test_pinning:PASS:default open 0 nsec
test_pinning:PASS:create pinmap manually 0 nsec
test_pinning:PASS:find map 0 nsec
test_pinning:PASS:reuse pinmap fd 0 nsec
test_pinning:PASS:set pin path 0 nsec
test_pinning:PASS:custom load 0 nsec
test_pinning:PASS:stat custpinpath 0 nsec
#175     pinning:OK
libbpf: prog 'test_pkt_access': BPF program load failed: Permission denied
libbpf: prog 'test_pkt_access': -- BEGIN PROG LOAD LOG --
Func#6 ('get_skb_ifindex') is safe for any args that match its prototype
Validating test_pkt_write_access_subprog() func#7...
221: R1=ctx() R2=scalar() R10=fp0
; int test_pkt_write_access_subprog(struct __sk_buff *skb, __u32 off) @ test_pkt_access.c:85
221: (b4) w0 = -1                     ; R0_w=0xffffffff
; if (off > sizeof(struct ethhdr) + sizeof(struct ipv6hdr)) @ test_pkt_access.c:91
222: (26) if w2 > 0x36 goto pc+11     ; R2=scalar(smax=0x7fffffff00000036,umax=0xffffffff00000036,smin32=0,smax32=umax32=54,var_off=(0x0; 0xffffffff0000003f))
223: (bc) w3 = w2                     ; R2=scalar(smax=0x7fffffff00000036,umax=0xffffffff00000036,smin32=0,smax32=umax32=54,var_off=(0x0; 0xffffffff0000003f)) R3_w=scalar(smin=smin32=0,smax=umax=smax32=umax32=54,var_off=(0x0; 0x3f))
; void *data = (void *)(long)skb->data; @ test_pkt_access.c:87
224: (61) r2 = *(u32 *)(r1 +76)       ; R1=ctx() R2_w=pkt(r=0)
; tcp = data + off; @ test_pkt_access.c:94
225: (0f) r2 += r3                    ; R2_w=pkt(id=6,r=0,smin=smin32=0,smax=umax=smax32=umax32=54,var_off=(0x0; 0x3f)) R3_w=scalar(smin=smin32=0,smax=umax=smax32=umax32=54,var_off=(0x0; 0x3f))
; if (tcp + 1 > data_end) @ test_pkt_access.c:95
226: (bf) r3 = r2                     ; R2_w=pkt(id=6,r=0,smin=smin32=0,smax=umax=smax32=umax32=54,var_off=(0x0; 0x3f)) R3_w=pkt(id=6,r=0,smin=smin32=0,smax=umax=smax32=umax32=54,var_off=(0x0; 0x3f))
227: (07) r3 += 20                    ; R3_w=pkt(id=6,off=20,r=0,smin=smin32=0,smax=umax=smax32=umax32=54,var_off=(0x0; 0x3f))
; void *data_end = (void *)(long)skb->data_end; @ test_pkt_access.c:88
228: (61) r1 = *(u32 *)(r1 +80)       ; R1_w=pkt_end()
; if (tcp + 1 > data_end) @ test_pkt_access.c:95
229: (2d) if r3 > r1 goto pc+4        ; R1_w=pkt_end() R3_w=pkt(id=6,off=20,r=20,smin=smin32=0,smax=umax=smax32=umax32=54,var_off=(0x0; 0x3f))
; tcp->check++; @ test_pkt_access.c:98
230: (69) r1 = *(u16 *)(r2 +16)
misaligned packet access off 2+(0x0; 0x3f)+0+16 size 2
processed 334 insns (limit 1000000) max_states_per_insn 3 total_states 21 peak_states 21 mark_read 8
-- END PROG LOAD LOG --
libbpf: prog 'test_pkt_access': failed to load: -13
libbpf: failed to load object './test_pkt_access.bpf.o'
test_pkt_access:FAIL:17
#176     pkt_access:FAIL
test_pkt_md_access:PASS:test_run_opts err 0 nsec
test_pkt_md_access:PASS:test_run_opts retval 0 nsec
#177     pkt_md_access:OK
tester_init:PASS:tester_log_buf 0 nsec
process_subtest:PASS:obj_open_mem 0 nsec
process_subtest:PASS:specs_alloc 0 nsec
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'preempt_lock_missing_1': BPF program load failed: unknown error (-524)
libbpf: prog 'preempt_lock_missing_1': failed to load: -524
libbpf: failed to load object 'preempt_lock'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: '1 bpf_preempt_enable is missing'
#178/1   preempt_lock/preempt_lock_missing_1:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'preempt_lock_missing_2': BPF program load failed: unknown error (-524)
libbpf: prog 'preempt_lock_missing_2': failed to load: -524
libbpf: failed to load object 'preempt_lock'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: '2 bpf_preempt_enable(s) are missing'
#178/2   preempt_lock/preempt_lock_missing_2:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'preempt_lock_missing_3': BPF program load failed: unknown error (-524)
libbpf: prog 'preempt_lock_missing_3': failed to load: -524
libbpf: failed to load object 'preempt_lock'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: '3 bpf_preempt_enable(s) are missing'
#178/3   preempt_lock/preempt_lock_missing_3:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'preempt_lock_missing_3_minus_2': BPF program load failed: unknown error (-524)
libbpf: prog 'preempt_lock_missing_3_minus_2': failed to load: -524
libbpf: failed to load object 'preempt_lock'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: '1 bpf_preempt_enable is missing'
#178/4   preempt_lock/preempt_lock_missing_3_minus_2:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'preempt_lock_missing_1_subprog': BPF program load failed: unknown error (-524)
libbpf: prog 'preempt_lock_missing_1_subprog': failed to load: -524
libbpf: failed to load object 'preempt_lock'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: '1 bpf_preempt_enable is missing'
#178/5   preempt_lock/preempt_lock_missing_1_subprog:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'preempt_lock_missing_2_subprog': BPF program load failed: unknown error (-524)
libbpf: prog 'preempt_lock_missing_2_subprog': failed to load: -524
libbpf: failed to load object 'preempt_lock'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: '2 bpf_preempt_enable(s) are missing'
#178/6   preempt_lock/preempt_lock_missing_2_subprog:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'preempt_lock_missing_2_minus_1_subprog': BPF program load failed: unknown error (-524)
libbpf: prog 'preempt_lock_missing_2_minus_1_subprog': failed to load: -524
libbpf: failed to load object 'preempt_lock'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: '1 bpf_preempt_enable is missing'
#178/7   preempt_lock/preempt_lock_missing_2_minus_1_subprog:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'preempt_balance': BPF program load failed: unknown error (-524)
libbpf: prog 'preempt_balance': failed to load: -524
libbpf: failed to load object 'preempt_lock'
run_subtest:FAIL:unexpected_load_failure unexpected error: -524 (errno 524)
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
#178/8   preempt_lock/preempt_balance:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'preempt_balance_subprog_test': BPF program load failed: unknown error (-524)
libbpf: prog 'preempt_balance_subprog_test': failed to load: -524
libbpf: failed to load object 'preempt_lock'
run_subtest:FAIL:unexpected_load_failure unexpected error: -524 (errno 524)
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
#178/9   preempt_lock/preempt_balance_subprog_test:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'preempt_global_subprog_test': BPF program load failed: unknown error (-524)
libbpf: prog 'preempt_global_subprog_test': failed to load: -524
libbpf: failed to load object 'preempt_lock'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'global function calls are not allowed with preemption disabled'
#178/10  preempt_lock/preempt_global_subprog_test:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'preempt_sleepable_helper': failed to find kernel BTF type ID of '__x64_sys_getpgid': -3
libbpf: prog 'preempt_sleepable_helper': failed to prepare load attributes: -3
libbpf: prog 'preempt_sleepable_helper': failed to load: -3
libbpf: failed to load object 'preempt_lock'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'sleepable helper bpf_copy_from_user#'
#178/11  preempt_lock/preempt_sleepable_helper:FAIL
#178     preempt_lock:FAIL
libbpf: prog 'test0': BPF program load failed: Invalid argument
libbpf: prog 'test0': failed to load: -22
libbpf: failed to load object 'preempted_bpf_ma_op'
libbpf: failed to load BPF skeleton 'preempted_bpf_ma_op': -22
test_preempted_bpf_ma_op:FAIL:open_and_load unexpected error: -22
#179     preempted_bpf_ma_op:FAIL
tester_init:PASS:tester_log_buf 0 nsec
process_subtest:PASS:obj_open_mem 0 nsec
process_subtest:PASS:specs_alloc 0 nsec
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_st_ops_inc10': not found in kernel or module BTFs
libbpf: failed to load object 'pro_epilogue'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#180/1   pro_epilogue/test_prologue:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_st_ops_inc10': not found in kernel or module BTFs
libbpf: failed to load object 'pro_epilogue'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#180/2   pro_epilogue/test_epilogue:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_st_ops_inc10': not found in kernel or module BTFs
libbpf: failed to load object 'pro_epilogue'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#180/3   pro_epilogue/test_pro_epilogue:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_st_ops_inc10': not found in kernel or module BTFs
libbpf: failed to load object 'pro_epilogue'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#180/4   pro_epilogue/syscall_prologue:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_st_ops_inc10': not found in kernel or module BTFs
libbpf: failed to load object 'pro_epilogue'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#180/5   pro_epilogue/syscall_epilogue:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_st_ops_inc10': not found in kernel or module BTFs
libbpf: failed to load object 'pro_epilogue'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#180/6   pro_epilogue/syscall_pro_epilogue:FAIL
tester_init:PASS:tester_log_buf 0 nsec
process_subtest:PASS:obj_open_mem 0 nsec
process_subtest:PASS:specs_alloc 0 nsec
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_st_ops_test_epilogue': not found in kernel or module BTFs
libbpf: failed to load object 'pro_epilogue_goto_start'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#180/7   pro_epilogue/test_prologue_goto_start:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_st_ops_test_epilogue': not found in kernel or module BTFs
libbpf: failed to load object 'pro_epilogue_goto_start'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#180/8   pro_epilogue/test_epilogue_goto_start:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_st_ops_test_epilogue': not found in kernel or module BTFs
libbpf: failed to load object 'pro_epilogue_goto_start'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#180/9   pro_epilogue/test_pro_epilogue_goto_start:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_st_ops_test_epilogue': not found in kernel or module BTFs
libbpf: failed to load object 'pro_epilogue_goto_start'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#180/10  pro_epilogue/syscall_prologue_goto_start:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_st_ops_test_epilogue': not found in kernel or module BTFs
libbpf: failed to load object 'pro_epilogue_goto_start'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#180/11  pro_epilogue/syscall_epilogue_goto_start:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_st_ops_test_epilogue': not found in kernel or module BTFs
libbpf: failed to load object 'pro_epilogue_goto_start'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#180/12  pro_epilogue/syscall_pro_epilogue_goto_start:FAIL
tester_init:PASS:tester_log_buf 0 nsec
process_subtest:PASS:obj_open_mem 0 nsec
process_subtest:PASS:specs_alloc 0 nsec
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_st_ops_test_epilogue': not found in kernel or module BTFs
libbpf: failed to load object 'epilogue_exit'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#180/13  pro_epilogue/test_epilogue_exit:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_st_ops_test_epilogue': not found in kernel or module BTFs
libbpf: failed to load object 'epilogue_exit'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#180/14  pro_epilogue/syscall_epilogue_exit0:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: extern (func ksym) 'bpf_kfunc_st_ops_test_epilogue': not found in kernel or module BTFs
libbpf: failed to load object 'epilogue_exit'
run_subtest:FAIL:unexpected_load_failure unexpected error: -22 (errno 22)
VERIFIER LOG:
=============
=============
#180/15  pro_epilogue/syscall_epilogue_exit1:FAIL
libbpf: extern (func ksym) 'bpf_kfunc_st_ops_test_epilogue': not found in kernel or module BTFs
libbpf: failed to load object 'epilogue_tailcall'
libbpf: failed to load BPF skeleton 'epilogue_tailcall': -22
test_tailcall:FAIL:epilogue_tailcall__open_and_load unexpected error: -22
#180/16  pro_epilogue/tailcall:FAIL
#180     pro_epilogue:FAIL
libbpf: prog 'on_write': BPF program load failed: Invalid argument
libbpf: prog 'on_write': failed to load: -22
libbpf: failed to load object 'test_probe_read_user_str'
libbpf: failed to load BPF skeleton 'test_probe_read_user_str': -22
test_probe_read_user_str:FAIL:test_probe_read_user_str__open_and_load skeleton open and load failed
#181     probe_read_user_str:FAIL
libbpf: elf: failed to open ./test_probe_user.bpf.o: No such file or directory
serial_test_probe_user:FAIL:obj_open_file unexpected error: -2
#182     probe_user:FAIL
test_prog_array_init:PASS:could not open BPF object 0 nsec
libbpf: prog 'tailcall_1': BPF program load failed: Invalid argument
libbpf: prog 'tailcall_1': failed to load: -22
libbpf: failed to load object 'test_prog_array_init'
libbpf: failed to load BPF skeleton 'test_prog_array_init': -22
test_prog_array_init:FAIL:could not load BPF object unexpected error: -22 (errno 22)
#183     prog_array_init:FAIL
test_prog_run_opts:PASS:enable_stats good fd 0 nsec
libbpf: prog 'test_pkt_access': BPF program load failed: Permission denied
libbpf: prog 'test_pkt_access': -- BEGIN PROG LOAD LOG --
Func#6 ('get_skb_ifindex') is safe for any args that match its prototype
Validating test_pkt_write_access_subprog() func#7...
221: R1=ctx() R2=scalar() R10=fp0
; int test_pkt_write_access_subprog(struct __sk_buff *skb, __u32 off) @ test_pkt_access.c:85
221: (b4) w0 = -1                     ; R0_w=0xffffffff
; if (off > sizeof(struct ethhdr) + sizeof(struct ipv6hdr)) @ test_pkt_access.c:91
222: (26) if w2 > 0x36 goto pc+11     ; R2=scalar(smax=0x7fffffff00000036,umax=0xffffffff00000036,smin32=0,smax32=umax32=54,var_off=(0x0; 0xffffffff0000003f))
223: (bc) w3 = w2                     ; R2=scalar(smax=0x7fffffff00000036,umax=0xffffffff00000036,smin32=0,smax32=umax32=54,var_off=(0x0; 0xffffffff0000003f)) R3_w=scalar(smin=smin32=0,smax=umax=smax32=umax32=54,var_off=(0x0; 0x3f))
; void *data = (void *)(long)skb->data; @ test_pkt_access.c:87
224: (61) r2 = *(u32 *)(r1 +76)       ; R1=ctx() R2_w=pkt(r=0)
; tcp = data + off; @ test_pkt_access.c:94
225: (0f) r2 += r3                    ; R2_w=pkt(id=6,r=0,smin=smin32=0,smax=umax=smax32=umax32=54,var_off=(0x0; 0x3f)) R3_w=scalar(smin=smin32=0,smax=umax=smax32=umax32=54,var_off=(0x0; 0x3f))
; if (tcp + 1 > data_end) @ test_pkt_access.c:95
226: (bf) r3 = r2                     ; R2_w=pkt(id=6,r=0,smin=smin32=0,smax=umax=smax32=umax32=54,var_off=(0x0; 0x3f)) R3_w=pkt(id=6,r=0,smin=smin32=0,smax=umax=smax32=umax32=54,var_off=(0x0; 0x3f))
227: (07) r3 += 20                    ; R3_w=pkt(id=6,off=20,r=0,smin=smin32=0,smax=umax=smax32=umax32=54,var_off=(0x0; 0x3f))
; void *data_end = (void *)(long)skb->data_end; @ test_pkt_access.c:88
228: (61) r1 = *(u32 *)(r1 +80)       ; R1_w=pkt_end()
; if (tcp + 1 > data_end) @ test_pkt_access.c:95
229: (2d) if r3 > r1 goto pc+4        ; R1_w=pkt_end() R3_w=pkt(id=6,off=20,r=20,smin=smin32=0,smax=umax=smax32=umax32=54,var_off=(0x0; 0x3f))
; tcp->check++; @ test_pkt_access.c:98
230: (69) r1 = *(u16 *)(r2 +16)
misaligned packet access off 2+(0x0; 0x3f)+0+16 size 2
processed 334 insns (limit 1000000) max_states_per_insn 3 total_states 21 peak_states 21 mark_read 8
-- END PROG LOAD LOG --
libbpf: prog 'test_pkt_access': failed to load: -13
libbpf: failed to load object 'test_pkt_access'
libbpf: failed to load BPF skeleton 'test_pkt_access': -13
test_prog_run_opts:FAIL:open_and_load unexpected error: -13
#184     prog_run_opts:FAIL
#185/1   prog_tests_framework/test_good_subtest:OK
test_prog_tests_framework:PASS:skip_cnt_check 0 nsec
test_prog_tests_framework:PASS:error_cnt_check 0 nsec
test_prog_tests_framework:PASS:subtest_num_check 0 nsec
#185/2   prog_tests_framework/test_skip_subtest:SKIP
#185/3   prog_tests_framework/test_skip_subtest:SKIP
test_prog_tests_framework:PASS:skip_cnt_check 0 nsec
test_prog_tests_framework:PASS:subtest_num_check 0 nsec
#185/4   prog_tests_framework/test_fail_subtest:FAIL
test_prog_tests_framework:PASS:error_cnt_check 0 nsec
test_prog_tests_framework:PASS:subtest_num_check 0 nsec
#185     prog_tests_framework:OK
libbpf: prog 'lsm_run': failed to find kernel BTF type ID of 'bpf': -3
libbpf: prog 'lsm_run': failed to prepare load attributes: -3
libbpf: prog 'lsm_run': failed to load: -3
libbpf: failed to load object 'test_ptr_untrusted'
libbpf: failed to load BPF skeleton 'test_ptr_untrusted': -3
serial_test_ptr_untrusted:FAIL:skel_open unexpected error: -3
#186     ptr_untrusted:FAIL
test_queue_stack_map_by_type:PASS:bpf_map_pop_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_pop_elem test retval 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_pop_elem data_size_out 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_pop_elem iph.daddr 0 nsec
test_queue_stack_map_by_type:PASS:check-queue-stack-map-empty 0 nsec
test_queue_stack_map_by_type:PASS:check-queue-stack-map-empty test retval 0 nsec
test_queue_stack_map_by_type:PASS:check-queue-stack-map-empty data_size_out 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_pop_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_pop_elem test retval 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_pop_elem data_size_out 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_pop_elem iph.daddr 0 nsec
test_queue_stack_map_by_type:PASS:check-queue-stack-map-empty 0 nsec
test_queue_stack_map_by_type:PASS:check-queue-stack-map-empty test retval 0 nsec
test_queue_stack_map_by_type:PASS:check-queue-stack-map-empty data_size_out 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_lookup_and_delete_elem 0 nsec
test_queue_stack_map_by_type:PASS:bpf_map_push_elem val 0 nsec
#187     queue_stack_map:OK
libbpf: prog 'test_raw_tp_null': failed to find kernel BTF type ID of 'bpf_testmod_test_raw_tp_null': -3
libbpf: prog 'test_raw_tp_null': failed to prepare load attributes: -3
libbpf: prog 'test_raw_tp_null': failed to load: -3
libbpf: failed to load object 'raw_tp_null'
libbpf: failed to load BPF skeleton 'raw_tp_null': -3
test_raw_tp_null:FAIL:raw_tp_null__open_and_load unexpected error: -3
#188     raw_tp_null:FAIL
test_raw_tp_test_run:PASS:parse_cpu_mask_file 0 nsec
libbpf: prog 'rename': BPF program load failed: Invalid argument
libbpf: prog 'rename': failed to load: -22
libbpf: failed to load object 'test_raw_tp_test_run'
libbpf: failed to load BPF skeleton 'test_raw_tp_test_run': -22
test_raw_tp_test_run:FAIL:skel_open unexpected error: -22
#189     raw_tp_test_run:FAIL
test_raw_tp_writable_reject_nbd_invalid:FAIL:bpf_raw_tracepoint_writable load failed: -22 errno 22
#190     raw_tp_writable_reject_nbd_invalid:FAIL
serial_test_raw_tp_writable_test_run:FAIL:bpf_raw_tracepoint_writable loaded failed: -22 errno 22
#191     raw_tp_writable_test_run:FAIL
tester_init:PASS:tester_log_buf 0 nsec
process_subtest:PASS:obj_open_mem 0 nsec
process_subtest:PASS:specs_alloc 0 nsec
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'rbtree_api_nolock_add': BPF program load failed: unknown error (-524)
libbpf: prog 'rbtree_api_nolock_add': failed to load: -524
libbpf: failed to load object 'rbtree_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'bpf_spin_lock at off=16 must be held for bpf_rb_root'
#193/1   rbtree_fail/rbtree_api_nolock_add:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'rbtree_api_nolock_remove': BPF program load failed: unknown error (-524)
libbpf: prog 'rbtree_api_nolock_remove': failed to load: -524
libbpf: failed to load object 'rbtree_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'bpf_spin_lock at off=16 must be held for bpf_rb_root'
#193/2   rbtree_fail/rbtree_api_nolock_remove:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'rbtree_api_nolock_first': BPF program load failed: unknown error (-524)
libbpf: prog 'rbtree_api_nolock_first': failed to load: -524
libbpf: failed to load object 'rbtree_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'bpf_spin_lock at off=16 must be held for bpf_rb_root'
#193/3   rbtree_fail/rbtree_api_nolock_first:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'rbtree_api_remove_unadded_node': BPF program load failed: unknown error (-524)
libbpf: prog 'rbtree_api_remove_unadded_node': failed to load: -524
libbpf: failed to load object 'rbtree_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'rbtree_remove node input must be non-owning ref'
#193/4   rbtree_fail/rbtree_api_remove_unadded_node:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'rbtree_api_remove_no_drop': BPF program load failed: unknown error (-524)
libbpf: prog 'rbtree_api_remove_no_drop': failed to load: -524
libbpf: failed to load object 'rbtree_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED    REGEX: 'Unreleased reference id=3 alloc_insn={{[0-9]+}}'
#193/5   rbtree_fail/rbtree_api_remove_no_drop:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'rbtree_api_add_to_multiple_trees': BPF program load failed: unknown error (-524)
libbpf: prog 'rbtree_api_add_to_multiple_trees': failed to load: -524
libbpf: failed to load object 'rbtree_fail'
run_subtest:PASS:unexpected_load_success 0 nsec
VERIFIER LOG:
=============
JIT is required for calling kernel function
processed 0 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
=============
validate_msgs:FAIL:695 expect_msg
EXPECTED   SUBSTR: 'arg#1 expected pointer to allocated object'
#193/6   rbtree_fail/rbtree_api_add_to_multiple_trees:FAIL
run_subtest:PASS:obj_open_mem 0 nsec
libbpf: prog 'rbtree_api_use_unchecked_remove_retval': BPF program load failed: unknown error (-524)
libbpf: prog 'rbtree_api_use_unchecked_remove_retval': failed to load: -524
libbpf: failed to load object 'rbtree_fail'
